#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_InteractiveActor

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Abp_InteractiveActor_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Abp_InteractiveActor.Abp_InteractiveActor_C
// 0x00D0 (0x0430 - 0x0360)
class UAbp_InteractiveActor_C : public UBUAnimInteractiveActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct Abp_InteractiveActor::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0368(0x0010)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x03A8(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03E8(0x0048)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Abp_InteractiveActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Abp_InteractiveActor_C">();
	}
	static class UAbp_InteractiveActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbp_InteractiveActor_C>();
	}
};
static_assert(alignof(UAbp_InteractiveActor_C) == 0x000010, "Wrong alignment on UAbp_InteractiveActor_C");
static_assert(sizeof(UAbp_InteractiveActor_C) == 0x000430, "Wrong size on UAbp_InteractiveActor_C");
static_assert(offsetof(UAbp_InteractiveActor_C, UberGraphFrame) == 0x000360, "Member 'UAbp_InteractiveActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, __AnimBlueprintMutables) == 0x000368, "Member 'UAbp_InteractiveActor_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, AnimBlueprintExtension_PropertyAccess) == 0x000378, "Member 'UAbp_InteractiveActor_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, AnimBlueprintExtension_Base) == 0x000380, "Member 'UAbp_InteractiveActor_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, AnimGraphNode_Root) == 0x000388, "Member 'UAbp_InteractiveActor_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, AnimGraphNode_SequencePlayer) == 0x0003A8, "Member 'UAbp_InteractiveActor_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAbp_InteractiveActor_C, AnimGraphNode_Slot) == 0x0003E8, "Member 'UAbp_InteractiveActor_C::AnimGraphNode_Slot' has a wrong offset!");

}

