#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_InteractiveActor

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Abp_InteractiveActor.Abp_InteractiveActor_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Abp_InteractiveActor_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Abp_InteractiveActor_C_AnimGraph) == 0x000008, "Wrong alignment on Abp_InteractiveActor_C_AnimGraph");
static_assert(sizeof(Abp_InteractiveActor_C_AnimGraph) == 0x000010, "Wrong size on Abp_InteractiveActor_C_AnimGraph");
static_assert(offsetof(Abp_InteractiveActor_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Abp_InteractiveActor_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Abp_InteractiveActor.Abp_InteractiveActor_C.ExecuteUbergraph_Abp_InteractiveActor
// 0x0004 (0x0004 - 0x0000)
struct Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor) == 0x000004, "Wrong alignment on Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor");
static_assert(sizeof(Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor) == 0x000004, "Wrong size on Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor");
static_assert(offsetof(Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor, EntryPoint) == 0x000000, "Member 'Abp_InteractiveActor_C_ExecuteUbergraph_Abp_InteractiveActor::EntryPoint' has a wrong offset!");

}

