#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Abp_ModularMeshCS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Abp_ModularMeshCS.Abp_ModularMeshCS_C.AnimBlueprintGeneratedConstantData
// 0x014F (0x0150 - 0x0001)
struct Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_72;                                   // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NameProperty_73;                                   // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_74;                                  // 0x0018(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          BlendProfile_75;                                   // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            CurveFloat_76;                                     // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             EnumProperty_77;                                   // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      EnumProperty_78;                                   // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ArrayProperty_79;                                  // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   StructProperty_80;                                 // 0x0050(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          BoolProperty_81;                                   // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FloatProperty_82;                                  // 0x0074(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          StructProperty_83;                                 // 0x0078(0x002C)(BlueprintVisible, NoDestructor)
	float                                         FloatProperty_84;                                  // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoolProperty_85;                                   // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               EnumProperty_86;                                   // 0x00A9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                ByteProperty_87;                                   // 0x00AA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NameProperty_88;                                   // 0x00AC(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0138(0x0018)()
};
static_assert(alignof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData) == 0x000150, "Wrong size on Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, NameProperty_72) == 0x000004, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::NameProperty_72' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, NameProperty_73) == 0x00000C, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::NameProperty_73' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, ArrayProperty_74) == 0x000018, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::ArrayProperty_74' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, BlendProfile_75) == 0x000028, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::BlendProfile_75' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, CurveFloat_76) == 0x000030, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::CurveFloat_76' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, EnumProperty_77) == 0x000038, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::EnumProperty_77' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, EnumProperty_78) == 0x000039, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::EnumProperty_78' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, ArrayProperty_79) == 0x000040, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::ArrayProperty_79' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, StructProperty_80) == 0x000050, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::StructProperty_80' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, BoolProperty_81) == 0x000070, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::BoolProperty_81' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, FloatProperty_82) == 0x000074, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::FloatProperty_82' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, StructProperty_83) == 0x000078, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::StructProperty_83' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, FloatProperty_84) == 0x0000A4, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::FloatProperty_84' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, BoolProperty_85) == 0x0000A8, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::BoolProperty_85' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, EnumProperty_86) == 0x0000A9, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::EnumProperty_86' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, ByteProperty_87) == 0x0000AA, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::ByteProperty_87' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, NameProperty_88) == 0x0000AC, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::NameProperty_88' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B8, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000138, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Abp_ModularMeshCS.Abp_ModularMeshCS_C.AnimBlueprintGeneratedMutableData
// 0x0027 (0x0028 - 0x0001)
struct Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          BoolProperty;                                      // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntProperty_0;                                     // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AnimSequenceBase_1;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AnimSequenceBase_2;                                // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AnimSequenceBase_3;                                // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AnimSequenceBase_4;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData) == 0x000028, "Wrong size on Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, BoolProperty) == 0x000001, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::BoolProperty' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, IntProperty_0) == 0x000004, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::IntProperty_0' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, AnimSequenceBase_1) == 0x000008, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::AnimSequenceBase_1' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, AnimSequenceBase_2) == 0x000010, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::AnimSequenceBase_2' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, AnimSequenceBase_3) == 0x000018, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::AnimSequenceBase_3' has a wrong offset!");
static_assert(offsetof(Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData, AnimSequenceBase_4) == 0x000020, "Member 'Abp_ModularMeshCS::FAnimBlueprintGeneratedMutableData::AnimSequenceBase_4' has a wrong offset!");

}

