#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AudioLinkEngine

#include "Basic.hpp"


namespace SDK::Params
{

// Function AudioLinkEngine.AudioLinkBlueprintInterface.PlayLink
// 0x0004 (0x0004 - 0x0000)
struct AudioLinkBlueprintInterface_PlayLink final
{
public:
	float                                         StartTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioLinkBlueprintInterface_PlayLink) == 0x000004, "Wrong alignment on AudioLinkBlueprintInterface_PlayLink");
static_assert(sizeof(AudioLinkBlueprintInterface_PlayLink) == 0x000004, "Wrong size on AudioLinkBlueprintInterface_PlayLink");
static_assert(offsetof(AudioLinkBlueprintInterface_PlayLink, StartTime) == 0x000000, "Member 'AudioLinkBlueprintInterface_PlayLink::StartTime' has a wrong offset!");

// Function AudioLinkEngine.AudioLinkBlueprintInterface.SetLinkSound
// 0x0008 (0x0008 - 0x0000)
struct AudioLinkBlueprintInterface_SetLinkSound final
{
public:
	class USoundBase*                             NewSound;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioLinkBlueprintInterface_SetLinkSound) == 0x000008, "Wrong alignment on AudioLinkBlueprintInterface_SetLinkSound");
static_assert(sizeof(AudioLinkBlueprintInterface_SetLinkSound) == 0x000008, "Wrong size on AudioLinkBlueprintInterface_SetLinkSound");
static_assert(offsetof(AudioLinkBlueprintInterface_SetLinkSound, NewSound) == 0x000000, "Member 'AudioLinkBlueprintInterface_SetLinkSound::NewSound' has a wrong offset!");

// Function AudioLinkEngine.AudioLinkBlueprintInterface.IsLinkPlaying
// 0x0001 (0x0001 - 0x0000)
struct AudioLinkBlueprintInterface_IsLinkPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioLinkBlueprintInterface_IsLinkPlaying) == 0x000001, "Wrong alignment on AudioLinkBlueprintInterface_IsLinkPlaying");
static_assert(sizeof(AudioLinkBlueprintInterface_IsLinkPlaying) == 0x000001, "Wrong size on AudioLinkBlueprintInterface_IsLinkPlaying");
static_assert(offsetof(AudioLinkBlueprintInterface_IsLinkPlaying, ReturnValue) == 0x000000, "Member 'AudioLinkBlueprintInterface_IsLinkPlaying::ReturnValue' has a wrong offset!");

}

