#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AugmentedReality

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AugmentedReality_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AugmentedReality.ARTrackedGeometry.GetUnderlyingMesh
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedGeometry_GetUnderlyingMesh final
{
public:
	class UMRMeshComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetUnderlyingMesh) == 0x000008, "Wrong alignment on ARTrackedGeometry_GetUnderlyingMesh");
static_assert(sizeof(ARTrackedGeometry_GetUnderlyingMesh) == 0x000008, "Wrong size on ARTrackedGeometry_GetUnderlyingMesh");
static_assert(offsetof(ARTrackedGeometry_GetUnderlyingMesh, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetUnderlyingMesh::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetDebugName
// 0x0008 (0x0008 - 0x0000)
struct ARTrackedGeometry_GetDebugName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetDebugName) == 0x000004, "Wrong alignment on ARTrackedGeometry_GetDebugName");
static_assert(sizeof(ARTrackedGeometry_GetDebugName) == 0x000008, "Wrong size on ARTrackedGeometry_GetDebugName");
static_assert(offsetof(ARTrackedGeometry_GetDebugName, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetDebugName::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetLastUpdateFrameNumber
// 0x0004 (0x0004 - 0x0000)
struct ARTrackedGeometry_GetLastUpdateFrameNumber final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetLastUpdateFrameNumber) == 0x000004, "Wrong alignment on ARTrackedGeometry_GetLastUpdateFrameNumber");
static_assert(sizeof(ARTrackedGeometry_GetLastUpdateFrameNumber) == 0x000004, "Wrong size on ARTrackedGeometry_GetLastUpdateFrameNumber");
static_assert(offsetof(ARTrackedGeometry_GetLastUpdateFrameNumber, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetLastUpdateFrameNumber::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetLastUpdateTimestamp
// 0x0004 (0x0004 - 0x0000)
struct ARTrackedGeometry_GetLastUpdateTimestamp final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetLastUpdateTimestamp) == 0x000004, "Wrong alignment on ARTrackedGeometry_GetLastUpdateTimestamp");
static_assert(sizeof(ARTrackedGeometry_GetLastUpdateTimestamp) == 0x000004, "Wrong size on ARTrackedGeometry_GetLastUpdateTimestamp");
static_assert(offsetof(ARTrackedGeometry_GetLastUpdateTimestamp, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetLastUpdateTimestamp::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetLocalToTrackingTransform
// 0x0060 (0x0060 - 0x0000)
struct ARTrackedGeometry_GetLocalToTrackingTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetLocalToTrackingTransform) == 0x000010, "Wrong alignment on ARTrackedGeometry_GetLocalToTrackingTransform");
static_assert(sizeof(ARTrackedGeometry_GetLocalToTrackingTransform) == 0x000060, "Wrong size on ARTrackedGeometry_GetLocalToTrackingTransform");
static_assert(offsetof(ARTrackedGeometry_GetLocalToTrackingTransform, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetLocalToTrackingTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetLocalToWorldTransform
// 0x0060 (0x0060 - 0x0000)
struct ARTrackedGeometry_GetLocalToWorldTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetLocalToWorldTransform) == 0x000010, "Wrong alignment on ARTrackedGeometry_GetLocalToWorldTransform");
static_assert(sizeof(ARTrackedGeometry_GetLocalToWorldTransform) == 0x000060, "Wrong size on ARTrackedGeometry_GetLocalToWorldTransform");
static_assert(offsetof(ARTrackedGeometry_GetLocalToWorldTransform, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetLocalToWorldTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetName
// 0x0010 (0x0010 - 0x0000)
struct ARTrackedGeometry_GetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetName) == 0x000008, "Wrong alignment on ARTrackedGeometry_GetName");
static_assert(sizeof(ARTrackedGeometry_GetName) == 0x000010, "Wrong size on ARTrackedGeometry_GetName");
static_assert(offsetof(ARTrackedGeometry_GetName, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetName::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetObjectClassification
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_GetObjectClassification final
{
public:
	EARObjectClassification                       ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetObjectClassification) == 0x000001, "Wrong alignment on ARTrackedGeometry_GetObjectClassification");
static_assert(sizeof(ARTrackedGeometry_GetObjectClassification) == 0x000001, "Wrong size on ARTrackedGeometry_GetObjectClassification");
static_assert(offsetof(ARTrackedGeometry_GetObjectClassification, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetObjectClassification::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.GetTrackingState
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_GetTrackingState final
{
public:
	EARTrackingState                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_GetTrackingState) == 0x000001, "Wrong alignment on ARTrackedGeometry_GetTrackingState");
static_assert(sizeof(ARTrackedGeometry_GetTrackingState) == 0x000001, "Wrong size on ARTrackedGeometry_GetTrackingState");
static_assert(offsetof(ARTrackedGeometry_GetTrackingState, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_GetTrackingState::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.HasSpatialMeshUsageFlag
// 0x0002 (0x0002 - 0x0000)
struct ARTrackedGeometry_HasSpatialMeshUsageFlag final
{
public:
	EARSpatialMeshUsageFlags                      InFlag;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_HasSpatialMeshUsageFlag) == 0x000001, "Wrong alignment on ARTrackedGeometry_HasSpatialMeshUsageFlag");
static_assert(sizeof(ARTrackedGeometry_HasSpatialMeshUsageFlag) == 0x000002, "Wrong size on ARTrackedGeometry_HasSpatialMeshUsageFlag");
static_assert(offsetof(ARTrackedGeometry_HasSpatialMeshUsageFlag, InFlag) == 0x000000, "Member 'ARTrackedGeometry_HasSpatialMeshUsageFlag::InFlag' has a wrong offset!");
static_assert(offsetof(ARTrackedGeometry_HasSpatialMeshUsageFlag, ReturnValue) == 0x000001, "Member 'ARTrackedGeometry_HasSpatialMeshUsageFlag::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARTrackedGeometry.IsTracked
// 0x0001 (0x0001 - 0x0000)
struct ARTrackedGeometry_IsTracked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARTrackedGeometry_IsTracked) == 0x000001, "Wrong alignment on ARTrackedGeometry_IsTracked");
static_assert(sizeof(ARTrackedGeometry_IsTracked) == 0x000001, "Wrong size on ARTrackedGeometry_IsTracked");
static_assert(offsetof(ARTrackedGeometry_IsTracked, ReturnValue) == 0x000000, "Member 'ARTrackedGeometry_IsTracked::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARMeshGeometry.GetObjectClassificationAtLocation
// 0x0040 (0x0040 - 0x0000)
struct ARMeshGeometry_GetObjectClassificationAtLocation final
{
public:
	struct FVector                                InWorldLocation;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARObjectClassification                       OutClassification;                                 // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutClassificationLocation;                         // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLocationDiff;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARMeshGeometry_GetObjectClassificationAtLocation) == 0x000008, "Wrong alignment on ARMeshGeometry_GetObjectClassificationAtLocation");
static_assert(sizeof(ARMeshGeometry_GetObjectClassificationAtLocation) == 0x000040, "Wrong size on ARMeshGeometry_GetObjectClassificationAtLocation");
static_assert(offsetof(ARMeshGeometry_GetObjectClassificationAtLocation, InWorldLocation) == 0x000000, "Member 'ARMeshGeometry_GetObjectClassificationAtLocation::InWorldLocation' has a wrong offset!");
static_assert(offsetof(ARMeshGeometry_GetObjectClassificationAtLocation, OutClassification) == 0x000018, "Member 'ARMeshGeometry_GetObjectClassificationAtLocation::OutClassification' has a wrong offset!");
static_assert(offsetof(ARMeshGeometry_GetObjectClassificationAtLocation, OutClassificationLocation) == 0x000020, "Member 'ARMeshGeometry_GetObjectClassificationAtLocation::OutClassificationLocation' has a wrong offset!");
static_assert(offsetof(ARMeshGeometry_GetObjectClassificationAtLocation, MaxLocationDiff) == 0x000038, "Member 'ARMeshGeometry_GetObjectClassificationAtLocation::MaxLocationDiff' has a wrong offset!");
static_assert(offsetof(ARMeshGeometry_GetObjectClassificationAtLocation, ReturnValue) == 0x00003C, "Member 'ARMeshGeometry_GetObjectClassificationAtLocation::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARActor.AddARComponent
// 0x0020 (0x0020 - 0x0000)
struct ARActor_AddARComponent final
{
public:
	TSubclassOf<class UARComponent>               InComponentClass;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NativeID;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UARComponent*                           ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARActor_AddARComponent) == 0x000008, "Wrong alignment on ARActor_AddARComponent");
static_assert(sizeof(ARActor_AddARComponent) == 0x000020, "Wrong size on ARActor_AddARComponent");
static_assert(offsetof(ARActor_AddARComponent, InComponentClass) == 0x000000, "Member 'ARActor_AddARComponent::InComponentClass' has a wrong offset!");
static_assert(offsetof(ARActor_AddARComponent, NativeID) == 0x000008, "Member 'ARActor_AddARComponent::NativeID' has a wrong offset!");
static_assert(offsetof(ARActor_AddARComponent, ReturnValue) == 0x000018, "Member 'ARActor_AddARComponent::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.AddManualEnvironmentCaptureProbe
// 0x0038 (0x0038 - 0x0000)
struct ARBlueprintLibrary_AddManualEnvironmentCaptureProbe final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Extent;                                            // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe) == 0x000008, "Wrong alignment on ARBlueprintLibrary_AddManualEnvironmentCaptureProbe");
static_assert(sizeof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe) == 0x000038, "Wrong size on ARBlueprintLibrary_AddManualEnvironmentCaptureProbe");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, Location) == 0x000000, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::Location' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, Extent) == 0x000018, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::Extent' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddManualEnvironmentCaptureProbe, ReturnValue) == 0x000030, "Member 'ARBlueprintLibrary_AddManualEnvironmentCaptureProbe::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.AddRuntimeCandidateImage
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_AddRuntimeCandidateImage final
{
public:
	class UARSessionConfig*                       SessionConfig;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CandidateTexture;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FriendlyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalWidth;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UARCandidateImage*                      ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_AddRuntimeCandidateImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_AddRuntimeCandidateImage");
static_assert(sizeof(ARBlueprintLibrary_AddRuntimeCandidateImage) == 0x000030, "Wrong size on ARBlueprintLibrary_AddRuntimeCandidateImage");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, SessionConfig) == 0x000000, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::SessionConfig' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, CandidateTexture) == 0x000008, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::CandidateTexture' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, FriendlyName) == 0x000010, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::FriendlyName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, PhysicalWidth) == 0x000020, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::PhysicalWidth' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddRuntimeCandidateImage, ReturnValue) == 0x000028, "Member 'ARBlueprintLibrary_AddRuntimeCandidateImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.AddTrackedPointWithName
// 0x0080 (0x0080 - 0x0000)
struct ARBlueprintLibrary_AddTrackedPointWithName final
{
public:
	struct FTransform                             WorldTransform;                                    // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 PointName;                                         // 0x0060(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeletePointsWithSameName;                         // 0x0070(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0071(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0xE];                                       // 0x0072(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_AddTrackedPointWithName) == 0x000010, "Wrong alignment on ARBlueprintLibrary_AddTrackedPointWithName");
static_assert(sizeof(ARBlueprintLibrary_AddTrackedPointWithName) == 0x000080, "Wrong size on ARBlueprintLibrary_AddTrackedPointWithName");
static_assert(offsetof(ARBlueprintLibrary_AddTrackedPointWithName, WorldTransform) == 0x000000, "Member 'ARBlueprintLibrary_AddTrackedPointWithName::WorldTransform' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddTrackedPointWithName, PointName) == 0x000060, "Member 'ARBlueprintLibrary_AddTrackedPointWithName::PointName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddTrackedPointWithName, bDeletePointsWithSameName) == 0x000070, "Member 'ARBlueprintLibrary_AddTrackedPointWithName::bDeletePointsWithSameName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_AddTrackedPointWithName, ReturnValue) == 0x000071, "Member 'ARBlueprintLibrary_AddTrackedPointWithName::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.CalculateAlignmentTransform
// 0x0120 (0x0120 - 0x0000)
struct ARBlueprintLibrary_CalculateAlignmentTransform final
{
public:
	struct FTransform                             TransformInFirstCoordinateSystem;                  // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             TransformInSecondCoordinateSystem;                 // 0x0060(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             AlignmentTransform;                                // 0x00C0(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_CalculateAlignmentTransform) == 0x000010, "Wrong alignment on ARBlueprintLibrary_CalculateAlignmentTransform");
static_assert(sizeof(ARBlueprintLibrary_CalculateAlignmentTransform) == 0x000120, "Wrong size on ARBlueprintLibrary_CalculateAlignmentTransform");
static_assert(offsetof(ARBlueprintLibrary_CalculateAlignmentTransform, TransformInFirstCoordinateSystem) == 0x000000, "Member 'ARBlueprintLibrary_CalculateAlignmentTransform::TransformInFirstCoordinateSystem' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_CalculateAlignmentTransform, TransformInSecondCoordinateSystem) == 0x000060, "Member 'ARBlueprintLibrary_CalculateAlignmentTransform::TransformInSecondCoordinateSystem' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_CalculateAlignmentTransform, AlignmentTransform) == 0x0000C0, "Member 'ARBlueprintLibrary_CalculateAlignmentTransform::AlignmentTransform' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.CalculateClosestIntersection
// 0x0038 (0x0038 - 0x0000)
struct ARBlueprintLibrary_CalculateClosestIntersection final
{
public:
	TArray<struct FVector>                        StartPoints;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        EndPoints;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                ClosestIntersection;                               // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_CalculateClosestIntersection) == 0x000008, "Wrong alignment on ARBlueprintLibrary_CalculateClosestIntersection");
static_assert(sizeof(ARBlueprintLibrary_CalculateClosestIntersection) == 0x000038, "Wrong size on ARBlueprintLibrary_CalculateClosestIntersection");
static_assert(offsetof(ARBlueprintLibrary_CalculateClosestIntersection, StartPoints) == 0x000000, "Member 'ARBlueprintLibrary_CalculateClosestIntersection::StartPoints' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_CalculateClosestIntersection, EndPoints) == 0x000010, "Member 'ARBlueprintLibrary_CalculateClosestIntersection::EndPoints' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_CalculateClosestIntersection, ClosestIntersection) == 0x000020, "Member 'ARBlueprintLibrary_CalculateClosestIntersection::ClosestIntersection' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawPin
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawPin final
{
public:
	class UARPin*                                 ARPin;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_DebugDrawPin) == 0x000008, "Wrong alignment on ARBlueprintLibrary_DebugDrawPin");
static_assert(sizeof(ARBlueprintLibrary_DebugDrawPin) == 0x000028, "Wrong size on ARBlueprintLibrary_DebugDrawPin");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, ARPin) == 0x000000, "Member 'ARBlueprintLibrary_DebugDrawPin::ARPin' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, WorldContextObject) == 0x000008, "Member 'ARBlueprintLibrary_DebugDrawPin::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, Color) == 0x000010, "Member 'ARBlueprintLibrary_DebugDrawPin::Color' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, Scale) == 0x000020, "Member 'ARBlueprintLibrary_DebugDrawPin::Scale' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawPin, PersistForSeconds) == 0x000024, "Member 'ARBlueprintLibrary_DebugDrawPin::PersistForSeconds' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.DebugDrawTrackedGeometry
// 0x0028 (0x0028 - 0x0000)
struct ARBlueprintLibrary_DebugDrawTrackedGeometry final
{
public:
	class UARTrackedGeometry*                     TrackedGeometry;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutlineThickness;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PersistForSeconds;                                 // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_DebugDrawTrackedGeometry) == 0x000008, "Wrong alignment on ARBlueprintLibrary_DebugDrawTrackedGeometry");
static_assert(sizeof(ARBlueprintLibrary_DebugDrawTrackedGeometry) == 0x000028, "Wrong size on ARBlueprintLibrary_DebugDrawTrackedGeometry");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, TrackedGeometry) == 0x000000, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::TrackedGeometry' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, WorldContextObject) == 0x000008, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, Color) == 0x000010, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::Color' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, OutlineThickness) == 0x000020, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::OutlineThickness' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_DebugDrawTrackedGeometry, PersistForSeconds) == 0x000024, "Member 'ARBlueprintLibrary_DebugDrawTrackedGeometry::PersistForSeconds' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.FindTrackedPointsByName
// 0x0020 (0x0020 - 0x0000)
struct ARBlueprintLibrary_FindTrackedPointsByName final
{
public:
	class FString                                 PointName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UARTrackedPoint*>                ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_FindTrackedPointsByName) == 0x000008, "Wrong alignment on ARBlueprintLibrary_FindTrackedPointsByName");
static_assert(sizeof(ARBlueprintLibrary_FindTrackedPointsByName) == 0x000020, "Wrong size on ARBlueprintLibrary_FindTrackedPointsByName");
static_assert(offsetof(ARBlueprintLibrary_FindTrackedPointsByName, PointName) == 0x000000, "Member 'ARBlueprintLibrary_FindTrackedPointsByName::PointName' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_FindTrackedPointsByName, ReturnValue) == 0x000010, "Member 'ARBlueprintLibrary_FindTrackedPointsByName::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAlignmentTransform
// 0x0060 (0x0060 - 0x0000)
struct ARBlueprintLibrary_GetAlignmentTransform final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAlignmentTransform) == 0x000010, "Wrong alignment on ARBlueprintLibrary_GetAlignmentTransform");
static_assert(sizeof(ARBlueprintLibrary_GetAlignmentTransform) == 0x000060, "Wrong size on ARBlueprintLibrary_GetAlignmentTransform");
static_assert(offsetof(ARBlueprintLibrary_GetAlignmentTransform, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAlignmentTransform::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllGeometries
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllGeometries final
{
public:
	TArray<class UARTrackedGeometry*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllGeometries) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllGeometries");
static_assert(sizeof(ARBlueprintLibrary_GetAllGeometries) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllGeometries");
static_assert(offsetof(ARBlueprintLibrary_GetAllGeometries, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllGeometries::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllGeometriesByClass
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetAllGeometriesByClass final
{
public:
	TSubclassOf<class UARTrackedGeometry>         GeometryClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UARTrackedGeometry*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllGeometriesByClass) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllGeometriesByClass");
static_assert(sizeof(ARBlueprintLibrary_GetAllGeometriesByClass) == 0x000018, "Wrong size on ARBlueprintLibrary_GetAllGeometriesByClass");
static_assert(offsetof(ARBlueprintLibrary_GetAllGeometriesByClass, GeometryClass) == 0x000000, "Member 'ARBlueprintLibrary_GetAllGeometriesByClass::GeometryClass' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetAllGeometriesByClass, ReturnValue) == 0x000008, "Member 'ARBlueprintLibrary_GetAllGeometriesByClass::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllPins
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllPins final
{
public:
	TArray<class UARPin*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllPins) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllPins");
static_assert(sizeof(ARBlueprintLibrary_GetAllPins) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllPins");
static_assert(offsetof(ARBlueprintLibrary_GetAllPins, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllPins::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTracked2DPoses
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTracked2DPoses final
{
public:
	TArray<struct FARPose2D>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTracked2DPoses) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTracked2DPoses");
static_assert(sizeof(ARBlueprintLibrary_GetAllTracked2DPoses) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTracked2DPoses");
static_assert(offsetof(ARBlueprintLibrary_GetAllTracked2DPoses, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTracked2DPoses::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedEnvironmentCaptureProbes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes final
{
public:
	TArray<class UAREnvironmentCaptureProbe*>     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedEnvironmentCaptureProbes::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedImages
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedImages final
{
public:
	TArray<class UARTrackedImage*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedImages) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedImages");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedImages) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedImages");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedImages, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedImages::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPlanes
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPlanes final
{
public:
	TArray<class UARPlaneGeometry*>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedPlanes) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedPlanes");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedPlanes) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedPlanes");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedPlanes, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedPlanes::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPoints
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPoints final
{
public:
	TArray<class UARTrackedPoint*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedPoints) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedPoints");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedPoints) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedPoints");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedPoints, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedPoints::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetAllTrackedPoses
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetAllTrackedPoses final
{
public:
	TArray<class UARTrackedPose*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetAllTrackedPoses) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetAllTrackedPoses");
static_assert(sizeof(ARBlueprintLibrary_GetAllTrackedPoses) == 0x000010, "Wrong size on ARBlueprintLibrary_GetAllTrackedPoses");
static_assert(offsetof(ARBlueprintLibrary_GetAllTrackedPoses, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetAllTrackedPoses::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetARSessionStatus
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetARSessionStatus final
{
public:
	struct FARSessionStatus                       ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetARSessionStatus) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetARSessionStatus");
static_assert(sizeof(ARBlueprintLibrary_GetARSessionStatus) == 0x000018, "Wrong size on ARBlueprintLibrary_GetARSessionStatus");
static_assert(offsetof(ARBlueprintLibrary_GetARSessionStatus, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetARSessionStatus::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetARTexture
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetARTexture final
{
public:
	EARTextureType                                TextureType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UARTexture*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetARTexture) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetARTexture");
static_assert(sizeof(ARBlueprintLibrary_GetARTexture) == 0x000010, "Wrong size on ARBlueprintLibrary_GetARTexture");
static_assert(offsetof(ARBlueprintLibrary_GetARTexture, TextureType) == 0x000000, "Member 'ARBlueprintLibrary_GetARTexture::TextureType' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetARTexture, ReturnValue) == 0x000008, "Member 'ARBlueprintLibrary_GetARTexture::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetARWorldScale
// 0x0004 (0x0004 - 0x0000)
struct ARBlueprintLibrary_GetARWorldScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetARWorldScale) == 0x000004, "Wrong alignment on ARBlueprintLibrary_GetARWorldScale");
static_assert(sizeof(ARBlueprintLibrary_GetARWorldScale) == 0x000004, "Wrong size on ARBlueprintLibrary_GetARWorldScale");
static_assert(offsetof(ARBlueprintLibrary_GetARWorldScale, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetARWorldScale::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCameraDepth
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraDepth final
{
public:
	class UARTextureCameraDepth*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCameraDepth) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCameraDepth");
static_assert(sizeof(ARBlueprintLibrary_GetCameraDepth) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCameraDepth");
static_assert(offsetof(ARBlueprintLibrary_GetCameraDepth, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCameraDepth::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCameraImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCameraImage final
{
public:
	class UARTextureCameraImage*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCameraImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCameraImage");
static_assert(sizeof(ARBlueprintLibrary_GetCameraImage) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCameraImage");
static_assert(offsetof(ARBlueprintLibrary_GetCameraImage, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCameraImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCameraIntrinsics
// 0x0030 (0x0030 - 0x0000)
struct ARBlueprintLibrary_GetCameraIntrinsics final
{
public:
	struct FARCameraIntrinsics                    OutCameraIntrinsics;                               // 0x0000(0x0028)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_GetCameraIntrinsics) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCameraIntrinsics");
static_assert(sizeof(ARBlueprintLibrary_GetCameraIntrinsics) == 0x000030, "Wrong size on ARBlueprintLibrary_GetCameraIntrinsics");
static_assert(offsetof(ARBlueprintLibrary_GetCameraIntrinsics, OutCameraIntrinsics) == 0x000000, "Member 'ARBlueprintLibrary_GetCameraIntrinsics::OutCameraIntrinsics' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetCameraIntrinsics, ReturnValue) == 0x000028, "Member 'ARBlueprintLibrary_GetCameraIntrinsics::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetCurrentLightEstimate
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetCurrentLightEstimate final
{
public:
	class UARLightEstimate*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetCurrentLightEstimate) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetCurrentLightEstimate");
static_assert(sizeof(ARBlueprintLibrary_GetCurrentLightEstimate) == 0x000008, "Wrong size on ARBlueprintLibrary_GetCurrentLightEstimate");
static_assert(offsetof(ARBlueprintLibrary_GetCurrentLightEstimate, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetCurrentLightEstimate::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetNumberOfTrackedFacesSupported
// 0x0004 (0x0004 - 0x0000)
struct ARBlueprintLibrary_GetNumberOfTrackedFacesSupported final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetNumberOfTrackedFacesSupported) == 0x000004, "Wrong alignment on ARBlueprintLibrary_GetNumberOfTrackedFacesSupported");
static_assert(sizeof(ARBlueprintLibrary_GetNumberOfTrackedFacesSupported) == 0x000004, "Wrong size on ARBlueprintLibrary_GetNumberOfTrackedFacesSupported");
static_assert(offsetof(ARBlueprintLibrary_GetNumberOfTrackedFacesSupported, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetNumberOfTrackedFacesSupported::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetObjectClassificationAtLocation
// 0x0040 (0x0040 - 0x0000)
struct ARBlueprintLibrary_GetObjectClassificationAtLocation final
{
public:
	struct FVector                                InWorldLocation;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EARObjectClassification                       OutClassification;                                 // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OutClassificationLocation;                         // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxLocationDiff;                                   // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x003C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ARBlueprintLibrary_GetObjectClassificationAtLocation) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetObjectClassificationAtLocation");
static_assert(sizeof(ARBlueprintLibrary_GetObjectClassificationAtLocation) == 0x000040, "Wrong size on ARBlueprintLibrary_GetObjectClassificationAtLocation");
static_assert(offsetof(ARBlueprintLibrary_GetObjectClassificationAtLocation, InWorldLocation) == 0x000000, "Member 'ARBlueprintLibrary_GetObjectClassificationAtLocation::InWorldLocation' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetObjectClassificationAtLocation, OutClassification) == 0x000018, "Member 'ARBlueprintLibrary_GetObjectClassificationAtLocation::OutClassification' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetObjectClassificationAtLocation, OutClassificationLocation) == 0x000020, "Member 'ARBlueprintLibrary_GetObjectClassificationAtLocation::OutClassificationLocation' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetObjectClassificationAtLocation, MaxLocationDiff) == 0x000038, "Member 'ARBlueprintLibrary_GetObjectClassificationAtLocation::MaxLocationDiff' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetObjectClassificationAtLocation, ReturnValue) == 0x00003C, "Member 'ARBlueprintLibrary_GetObjectClassificationAtLocation::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetPersonSegmentationDepthImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetPersonSegmentationDepthImage final
{
public:
	class UARTexture*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetPersonSegmentationDepthImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetPersonSegmentationDepthImage");
static_assert(sizeof(ARBlueprintLibrary_GetPersonSegmentationDepthImage) == 0x000008, "Wrong size on ARBlueprintLibrary_GetPersonSegmentationDepthImage");
static_assert(offsetof(ARBlueprintLibrary_GetPersonSegmentationDepthImage, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetPersonSegmentationDepthImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetPersonSegmentationImage
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetPersonSegmentationImage final
{
public:
	class UARTexture*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetPersonSegmentationImage) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetPersonSegmentationImage");
static_assert(sizeof(ARBlueprintLibrary_GetPersonSegmentationImage) == 0x000008, "Wrong size on ARBlueprintLibrary_GetPersonSegmentationImage");
static_assert(offsetof(ARBlueprintLibrary_GetPersonSegmentationImage, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetPersonSegmentationImage::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetPointCloud
// 0x0010 (0x0010 - 0x0000)
struct ARBlueprintLibrary_GetPointCloud final
{
public:
	TArray<struct FVector>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetPointCloud) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetPointCloud");
static_assert(sizeof(ARBlueprintLibrary_GetPointCloud) == 0x000010, "Wrong size on ARBlueprintLibrary_GetPointCloud");
static_assert(offsetof(ARBlueprintLibrary_GetPointCloud, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetPointCloud::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetSessionConfig
// 0x0008 (0x0008 - 0x0000)
struct ARBlueprintLibrary_GetSessionConfig final
{
public:
	class UARSessionConfig*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetSessionConfig) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetSessionConfig");
static_assert(sizeof(ARBlueprintLibrary_GetSessionConfig) == 0x000008, "Wrong size on ARBlueprintLibrary_GetSessionConfig");
static_assert(offsetof(ARBlueprintLibrary_GetSessionConfig, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetSessionConfig::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetSupportedVideoFormats
// 0x0018 (0x0018 - 0x0000)
struct ARBlueprintLibrary_GetSupportedVideoFormats final
{
public:
	EARSessionType                                SessionType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FARVideoFormat>                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetSupportedVideoFormats) == 0x000008, "Wrong alignment on ARBlueprintLibrary_GetSupportedVideoFormats");
static_assert(sizeof(ARBlueprintLibrary_GetSupportedVideoFormats) == 0x000018, "Wrong size on ARBlueprintLibrary_GetSupportedVideoFormats");
static_assert(offsetof(ARBlueprintLibrary_GetSupportedVideoFormats, SessionType) == 0x000000, "Member 'ARBlueprintLibrary_GetSupportedVideoFormats::SessionType' has a wrong offset!");
static_assert(offsetof(ARBlueprintLibrary_GetSupportedVideoFormats, ReturnValue) == 0x000008, "Member 'ARBlueprintLibrary_GetSupportedVideoFormats::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQuality
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQuality final
{
public:
	EARTrackingQuality                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetTrackingQuality) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetTrackingQuality");
static_assert(sizeof(ARBlueprintLibrary_GetTrackingQuality) == 0x000001, "Wrong size on ARBlueprintLibrary_GetTrackingQuality");
static_assert(offsetof(ARBlueprintLibrary_GetTrackingQuality, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetTrackingQuality::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetTrackingQualityReason
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetTrackingQualityReason final
{
public:
	EARTrackingQualityReason                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetTrackingQualityReason) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetTrackingQualityReason");
static_assert(sizeof(ARBlueprintLibrary_GetTrackingQualityReason) == 0x000001, "Wrong size on ARBlueprintLibrary_GetTrackingQualityReason");
static_assert(offsetof(ARBlueprintLibrary_GetTrackingQualityReason, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetTrackingQualityReason::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.GetWorldMappingStatus
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_GetWorldMappingStatus final
{
public:
	EARWorldMappingState                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_GetWorldMappingStatus) == 0x000001, "Wrong alignment on ARBlueprintLibrary_GetWorldMappingStatus");
static_assert(sizeof(ARBlueprintLibrary_GetWorldMappingStatus) == 0x000001, "Wrong size on ARBlueprintLibrary_GetWorldMappingStatus");
static_assert(offsetof(ARBlueprintLibrary_GetWorldMappingStatus, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_GetWorldMappingStatus::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.IsARPinLocalStoreReady
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARPinLocalStoreReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_IsARPinLocalStoreReady) == 0x000001, "Wrong alignment on ARBlueprintLibrary_IsARPinLocalStoreReady");
static_assert(sizeof(ARBlueprintLibrary_IsARPinLocalStoreReady) == 0x000001, "Wrong size on ARBlueprintLibrary_IsARPinLocalStoreReady");
static_assert(offsetof(ARBlueprintLibrary_IsARPinLocalStoreReady, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_IsARPinLocalStoreReady::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.IsARPinLocalStoreSupported
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARPinLocalStoreSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_IsARPinLocalStoreSupported) == 0x000001, "Wrong alignment on ARBlueprintLibrary_IsARPinLocalStoreSupported");
static_assert(sizeof(ARBlueprintLibrary_IsARPinLocalStoreSupported) == 0x000001, "Wrong size on ARBlueprintLibrary_IsARPinLocalStoreSupported");
static_assert(offsetof(ARBlueprintLibrary_IsARPinLocalStoreSupported, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_IsARPinLocalStoreSupported::ReturnValue' has a wrong offset!");

// Function AugmentedReality.ARBlueprintLibrary.IsARSupported
// 0x0001 (0x0001 - 0x0000)
struct ARBlueprintLibrary_IsARSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ARBlueprintLibrary_IsARSupported) == 0x000001, "Wrong alignment on ARBlueprintLibrary_IsARSupported");
static_assert(sizeof(ARBlueprintLibrary_IsARSupported) == 0x000001, "Wrong size on ARBlueprintLibrary_IsARSupported");
static_assert(offsetof(ARBlueprintLibrary_IsARSupported, ReturnValue) == 0x000000, "Member 'ARBlueprintLibrary_IsARSupported::ReturnValue' has a wrong offset!");

