#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "b1_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"
#include "ReplicationGraph_structs.hpp"
#include "ReplicationGraph_classes.hpp"
#include "UnrealExtent_structs.hpp"
#include "UnrealExtent_classes.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "AkAudio_structs.hpp"
#include "LevelSequence_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MovieScene_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK
{

// Class b1.ActorDataContainer
// 0x0010 (0x00C0 - 0x00B0)
class UActorDataContainer : public UActorComponent
{
public:
	TArray<class UObject*>                        MDatas;                                            // 0x00B0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void AddDataObjInCS(class UObject* Obj);
	void ClearDataObj();
	void InitOnNewInCS();
	void LateECSBeginPlay();
	void OnDestoryInCS();
	void PreECSBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorDataContainer">();
	}
	static class UActorDataContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorDataContainer>();
	}
};
static_assert(alignof(UActorDataContainer) == 0x000008, "Wrong alignment on UActorDataContainer");
static_assert(sizeof(UActorDataContainer) == 0x0000C0, "Wrong size on UActorDataContainer");
static_assert(offsetof(UActorDataContainer, MDatas) == 0x0000B0, "Member 'UActorDataContainer::MDatas' has a wrong offset!");

// Class b1.ActorCompContainer
// 0x0018 (0x00C8 - 0x00B0)
class UActorCompContainer final : public UActorComponent
{
public:
	class UActorDataContainer*                    DataContainer;                                     // 0x00B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                                EventCollection;                                   // 0x00B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         TeamID;                                            // 0x00C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void FillDataContainer(class UActorDataContainer* DataObj);
	void FillEventCollection(class UObject* DataObj);
	void SetTeamID(int32 ID);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorCompContainer">();
	}
	static class UActorCompContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorCompContainer>();
	}
};
static_assert(alignof(UActorCompContainer) == 0x000008, "Wrong alignment on UActorCompContainer");
static_assert(sizeof(UActorCompContainer) == 0x0000C8, "Wrong size on UActorCompContainer");
static_assert(offsetof(UActorCompContainer, DataContainer) == 0x0000B0, "Member 'UActorCompContainer::DataContainer' has a wrong offset!");
static_assert(offsetof(UActorCompContainer, EventCollection) == 0x0000B8, "Member 'UActorCompContainer::EventCollection' has a wrong offset!");
static_assert(offsetof(UActorCompContainer, TeamID) == 0x0000C0, "Member 'UActorCompContainer::TeamID' has a wrong offset!");

// Class b1.BGUCrowdFollowingComponent
// 0x0090 (0x03A8 - 0x0318)
class UBGUCrowdFollowingComponent final : public UGSCrowdFollowingComponent
{
public:
	float                                         RotationSpeed;                                     // 0x0318(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPause;                                            // 0x031C(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DesiredVelocity;                                   // 0x0320(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredAngleDelta;                                 // 0x0338(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RequestedVelocity;                                 // 0x0340(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YawDelta;                                          // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               TerrainRotation;                                   // 0x0360(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SpeedLimit;                                        // 0x0378(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DeltaPosition;                                     // 0x0380(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeedMax;                                  // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeedAcc;                                  // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportFlock;                                     // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCrowdFollowingEnabled(bool bEnabled, bool bIsObstacle);
	void SetCrowdFollowingParam(float FSeparationWeight, float FCollisionQueryRange, float FPathOptimizationRange, int32 IAvoidanceQualityLevel);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUCrowdFollowingComponent">();
	}
	static class UBGUCrowdFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUCrowdFollowingComponent>();
	}
};
static_assert(alignof(UBGUCrowdFollowingComponent) == 0x000008, "Wrong alignment on UBGUCrowdFollowingComponent");
static_assert(sizeof(UBGUCrowdFollowingComponent) == 0x0003A8, "Wrong size on UBGUCrowdFollowingComponent");
static_assert(offsetof(UBGUCrowdFollowingComponent, RotationSpeed) == 0x000318, "Member 'UBGUCrowdFollowingComponent::RotationSpeed' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, bPause) == 0x00031C, "Member 'UBGUCrowdFollowingComponent::bPause' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, DesiredVelocity) == 0x000320, "Member 'UBGUCrowdFollowingComponent::DesiredVelocity' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, DesiredAngleDelta) == 0x000338, "Member 'UBGUCrowdFollowingComponent::DesiredAngleDelta' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, RequestedVelocity) == 0x000340, "Member 'UBGUCrowdFollowingComponent::RequestedVelocity' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, YawDelta) == 0x000358, "Member 'UBGUCrowdFollowingComponent::YawDelta' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, TerrainRotation) == 0x000360, "Member 'UBGUCrowdFollowingComponent::TerrainRotation' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, SpeedLimit) == 0x000378, "Member 'UBGUCrowdFollowingComponent::SpeedLimit' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, DeltaPosition) == 0x000380, "Member 'UBGUCrowdFollowingComponent::DeltaPosition' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, RotationSpeedMax) == 0x000398, "Member 'UBGUCrowdFollowingComponent::RotationSpeedMax' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, RotationSpeedAcc) == 0x00039C, "Member 'UBGUCrowdFollowingComponent::RotationSpeedAcc' has a wrong offset!");
static_assert(offsetof(UBGUCrowdFollowingComponent, bSupportFlock) == 0x0003A0, "Member 'UBGUCrowdFollowingComponent::bSupportFlock' has a wrong offset!");

// Class b1.AnimNotifyFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAnimNotifyFuncLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void DeleteAnimNotifyAndAnimNotifyState(class UAnimMontage* AnimMontage, const TArray<EGsEnAnimN>& NotifyTypeList, const TArray<EGsEnAnimNS>& NotifyStateTypeList);
	static void GetAllAnimNotifySoftAsset(class UAnimSequenceBase* AnimBase, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* OutNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* OutNotifyStateRefs);
	static void PrepareAnimationsNotifySoftAsset(const TArray<class UAnimSequenceBase*>& AnimBases, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* OutNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* OutNotifyStateRefs);
	static void PrepareAnimNotifySoftAsset(class UAnimSequenceBase* AnimBase, TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs>* OutNotifyRefs, TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs>* OutNotifyStateRefs);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyFuncLibrary">();
	}
	static class UAnimNotifyFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyFuncLibrary>();
	}
};
static_assert(alignof(UAnimNotifyFuncLibrary) == 0x000008, "Wrong alignment on UAnimNotifyFuncLibrary");
static_assert(sizeof(UAnimNotifyFuncLibrary) == 0x000028, "Wrong size on UAnimNotifyFuncLibrary");

// Class b1.BGUDataComp
// 0x0010 (0x00D0 - 0x00C0)
class UBGUDataComp : public UActorDataContainer
{
public:
	class UBUC_AIComponent*                       MUBUC_AIComponent;                                 // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBUC_ACharacterComponent*               MUBUC_ACharacterComponent;                         // 0x00C8(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitWithAIController(class ABGUAIController* AIController);
	void InitWithCharacter(class ABGUCharacter* Character);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUDataComp">();
	}
	static class UBGUDataComp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDataComp>();
	}
};
static_assert(alignof(UBGUDataComp) == 0x000008, "Wrong alignment on UBGUDataComp");
static_assert(sizeof(UBGUDataComp) == 0x0000D0, "Wrong size on UBGUDataComp");
static_assert(offsetof(UBGUDataComp, MUBUC_AIComponent) == 0x0000C0, "Member 'UBGUDataComp::MUBUC_AIComponent' has a wrong offset!");
static_assert(offsetof(UBGUDataComp, MUBUC_ACharacterComponent) == 0x0000C8, "Member 'UBGUDataComp::MUBUC_ACharacterComponent' has a wrong offset!");

// Class b1.AnimNotifyState_GSBase
// 0x0018 (0x0048 - 0x0030)
class UAnimNotifyState_GSBase : public UAnimNotifyState
{
public:
	EGsEnAnimNS                                   AnimNSType;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanTriggerEndByCrossMontageBegin;                 // 0x0031(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsCheckAnimInstance;                               // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanBePlacedInASCS;                                 // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CanUseQueuedType;                                  // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsPreload;                                         // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        PreloadedAssets;                                   // 0x0038(0x0010)(BlueprintReadOnly, ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void AddPreloadedAsset(class UObject* Obj) const;
	EGsEnAnimNS GetAnimNSType() const;
	class FString GetJumpableSectionPrefix() const;
	float GetModifySpeedRate() const;
	TArray<class UObject*> GetPreloadedAssets() const;
	TArray<struct FSoftObjectPath> GetSoftReferences() const;
	bool GSAllowCrossSection() const;
	void GSNotifyBeginCS(const struct FUStGSNotifyParam& NotifyParam, float TotalDuration) const;
	int32 GSNotifyDebugPostBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPostTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreBeginCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	int32 GSNotifyDebugPreTickCS(const struct FUStGSNotifyParam& NotifyParam) const;
	void GSNotifyEndCS(const struct FUStGSNotifyParam& NotifyParam) const;
	void GSNotifyTickCS(const struct FUStGSNotifyParam& NotifyParam, float FrameDeltaTime) const;
	void GSOnSectionManuallyChanged(class ABGUCharacter* OwnerChar, float RemainingDuration) const;
	void GSValidateInputCS(class AActor* Actor) const;
	void UpdateDataOnNotifyStateReplace(const class UAnimNotifyState* NewNotifyState) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_GSBase">();
	}
	static class UAnimNotifyState_GSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSBase>();
	}
};
static_assert(alignof(UAnimNotifyState_GSBase) == 0x000008, "Wrong alignment on UAnimNotifyState_GSBase");
static_assert(sizeof(UAnimNotifyState_GSBase) == 0x000048, "Wrong size on UAnimNotifyState_GSBase");
static_assert(offsetof(UAnimNotifyState_GSBase, AnimNSType) == 0x000030, "Member 'UAnimNotifyState_GSBase::AnimNSType' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, bCanTriggerEndByCrossMontageBegin) == 0x000031, "Member 'UAnimNotifyState_GSBase::bCanTriggerEndByCrossMontageBegin' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, IsCheckAnimInstance) == 0x000032, "Member 'UAnimNotifyState_GSBase::IsCheckAnimInstance' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, CanBePlacedInASCS) == 0x000033, "Member 'UAnimNotifyState_GSBase::CanBePlacedInASCS' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, CanUseQueuedType) == 0x000034, "Member 'UAnimNotifyState_GSBase::CanUseQueuedType' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, IsPreload) == 0x000035, "Member 'UAnimNotifyState_GSBase::IsPreload' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSBase, PreloadedAssets) == 0x000038, "Member 'UAnimNotifyState_GSBase::PreloadedAssets' has a wrong offset!");

// Class b1.BGUDebugCircleComponent
// 0x0010 (0x0580 - 0x0570)
class UBGUDebugCircleComponent final : public UShapeComponent
{
public:
	float                                         CircleRadius;                                      // 0x0570(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         CircleThickness;                                   // 0x0574(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetCircleRadius(float InCircleRadius);

	float GetScaledCircleRadius() const;
	float GetShapeScale() const;
	float GetUnscaledCircleRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUDebugCircleComponent">();
	}
	static class UBGUDebugCircleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDebugCircleComponent>();
	}
};
static_assert(alignof(UBGUDebugCircleComponent) == 0x000010, "Wrong alignment on UBGUDebugCircleComponent");
static_assert(sizeof(UBGUDebugCircleComponent) == 0x000580, "Wrong size on UBGUDebugCircleComponent");
static_assert(offsetof(UBGUDebugCircleComponent, CircleRadius) == 0x000570, "Member 'UBGUDebugCircleComponent::CircleRadius' has a wrong offset!");
static_assert(offsetof(UBGUDebugCircleComponent, CircleThickness) == 0x000574, "Member 'UBGUDebugCircleComponent::CircleThickness' has a wrong offset!");

// Class b1.AnimNotifyState_GSDevLineHit
// 0x0018 (0x0060 - 0x0048)
class UAnimNotifyState_GSDevLineHit : public UAnimNotifyState_GSBase
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0048(0x0001)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESweepCheckHitFilterType                      ResultFilterType;                                  // 0x0049(0x0001)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HitVEffectID;                                      // 0x004C(0x0004)(BlueprintReadOnly, ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHitFromActorLocation : 1;                         // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HitCheckRadius;                                    // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRenderDebugShape : 1;                             // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (BlueprintReadOnly, Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_GSDevLineHit">();
	}
	static class UAnimNotifyState_GSDevLineHit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSDevLineHit>();
	}
};
static_assert(alignof(UAnimNotifyState_GSDevLineHit) == 0x000008, "Wrong alignment on UAnimNotifyState_GSDevLineHit");
static_assert(sizeof(UAnimNotifyState_GSDevLineHit) == 0x000060, "Wrong size on UAnimNotifyState_GSDevLineHit");
static_assert(offsetof(UAnimNotifyState_GSDevLineHit, CollisionChannel) == 0x000048, "Member 'UAnimNotifyState_GSDevLineHit::CollisionChannel' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSDevLineHit, ResultFilterType) == 0x000049, "Member 'UAnimNotifyState_GSDevLineHit::ResultFilterType' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSDevLineHit, HitVEffectID) == 0x00004C, "Member 'UAnimNotifyState_GSDevLineHit::HitVEffectID' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSDevLineHit, HitCheckRadius) == 0x000054, "Member 'UAnimNotifyState_GSDevLineHit::HitCheckRadius' has a wrong offset!");

// Class b1.BGUDebugSectorComponent
// 0x0010 (0x0580 - 0x0570)
class UBGUDebugSectorComponent final : public UShapeComponent
{
public:
	float                                         SectorRadius;                                      // 0x0570(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorMinAngle;                                    // 0x0574(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorMaxAngle;                                    // 0x0578(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SectorThickness;                                   // 0x057C(0x0004)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetSectorMaxAngle(float InMaxAngle);
	void SetSectorMinAngle(float InMinAngle);
	void SetSectorRadius(float InSectorRadius);

	float GetScaledSectorRadius() const;
	float GetShapeScale() const;
	float GetUnscaledSectorRadius() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUDebugSectorComponent">();
	}
	static class UBGUDebugSectorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUDebugSectorComponent>();
	}
};
static_assert(alignof(UBGUDebugSectorComponent) == 0x000010, "Wrong alignment on UBGUDebugSectorComponent");
static_assert(sizeof(UBGUDebugSectorComponent) == 0x000580, "Wrong size on UBGUDebugSectorComponent");
static_assert(offsetof(UBGUDebugSectorComponent, SectorRadius) == 0x000570, "Member 'UBGUDebugSectorComponent::SectorRadius' has a wrong offset!");
static_assert(offsetof(UBGUDebugSectorComponent, SectorMinAngle) == 0x000574, "Member 'UBGUDebugSectorComponent::SectorMinAngle' has a wrong offset!");
static_assert(offsetof(UBGUDebugSectorComponent, SectorMaxAngle) == 0x000578, "Member 'UBGUDebugSectorComponent::SectorMaxAngle' has a wrong offset!");
static_assert(offsetof(UBGUDebugSectorComponent, SectorThickness) == 0x00057C, "Member 'UBGUDebugSectorComponent::SectorThickness' has a wrong offset!");

// Class b1.AnimNotifyState_GSEditorHelper
// 0x0000 (0x0048 - 0x0048)
class UAnimNotifyState_GSEditorHelper : public UAnimNotifyState_GSBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_GSEditorHelper">();
	}
	static class UAnimNotifyState_GSEditorHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSEditorHelper>();
	}
};
static_assert(alignof(UAnimNotifyState_GSEditorHelper) == 0x000008, "Wrong alignment on UAnimNotifyState_GSEditorHelper");
static_assert(sizeof(UAnimNotifyState_GSEditorHelper) == 0x000048, "Wrong size on UAnimNotifyState_GSEditorHelper");

// Class b1.BGUEditorTickableActor
// 0x0018 (0x0290 - 0x0278)
class ABGUEditorTickableActor final : public AActor
{
public:
	uint8                                         Pad_278[0x18];                                     // 0x0278(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetViewportCameraLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUEditorTickableActor">();
	}
	static class ABGUEditorTickableActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABGUEditorTickableActor>();
	}
};
static_assert(alignof(ABGUEditorTickableActor) == 0x000008, "Wrong alignment on ABGUEditorTickableActor");
static_assert(sizeof(ABGUEditorTickableActor) == 0x000290, "Wrong size on ABGUEditorTickableActor");

// Class b1.AnimNotifyState_GSHeadLock
// 0x0008 (0x0050 - 0x0048)
class UAnimNotifyState_GSHeadLock : public UAnimNotifyState_GSBase
{
public:
	float                                         ReduceHeadLockAlphaScale;                          // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_GSHeadLock">();
	}
	static class UAnimNotifyState_GSHeadLock* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSHeadLock>();
	}
};
static_assert(alignof(UAnimNotifyState_GSHeadLock) == 0x000008, "Wrong alignment on UAnimNotifyState_GSHeadLock");
static_assert(sizeof(UAnimNotifyState_GSHeadLock) == 0x000050, "Wrong size on UAnimNotifyState_GSHeadLock");
static_assert(offsetof(UAnimNotifyState_GSHeadLock, ReduceHeadLockAlphaScale) == 0x000048, "Member 'UAnimNotifyState_GSHeadLock::ReduceHeadLockAlphaScale' has a wrong offset!");

// Class b1.BGUEQSObject
// 0x00D8 (0x0100 - 0x0028)
class UBGUEQSObject final : public UObject
{
public:
	class UEnvQuery*                              EnvQuery;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FEnvQueryRequest                       EvnQueryReq;                                       // 0x0030(0x0068)(NativeAccessSpecifierPrivate)
	class AActor*                                 QuerierObject;                                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<int32, struct FGSEQSExParam>             Req_ExParamMap;                                    // 0x00A0(0x0050)(NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_             FBUE_RunEQSFinish;                                 // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	int32 EQSObjRun(const class UEnvQuery* EnvQueryObj, class AActor* Querier, EBGURunEQSObjReason Reason, const struct FGSEQSExParam& _ExParam);
	void EQSObjRunInstant(const class UEnvQuery* EnvQueryObj, class AActor* Querier, TArray<struct FVector>* Locations, TArray<float>* Scores);
	void EQSObjRunInstantWithCustomParams(const class UEnvQuery* EnvQueryObj, class AActor* Querier, const TArray<struct FGSEnvNamedValue>& NamedParams, TArray<struct FVector>* Locations, TArray<float>* Scores);
	int32 EQSObjRunWithCustomParams(const class UEnvQuery* EnvQueryObj, class AActor* Querier, EBGURunEQSObjReason Reason, const TArray<struct FGSEnvNamedValue>& NamedParams);
	int32 EQSRun(const class FString& EQSPath, class AActor* Querier, EBGURunEQSObjReason Reason, const struct FGSEQSExParam& _ExParam);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUEQSObject">();
	}
	static class UBGUEQSObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUEQSObject>();
	}
};
static_assert(alignof(UBGUEQSObject) == 0x000008, "Wrong alignment on UBGUEQSObject");
static_assert(sizeof(UBGUEQSObject) == 0x000100, "Wrong size on UBGUEQSObject");
static_assert(offsetof(UBGUEQSObject, EnvQuery) == 0x000028, "Member 'UBGUEQSObject::EnvQuery' has a wrong offset!");
static_assert(offsetof(UBGUEQSObject, EvnQueryReq) == 0x000030, "Member 'UBGUEQSObject::EvnQueryReq' has a wrong offset!");
static_assert(offsetof(UBGUEQSObject, QuerierObject) == 0x000098, "Member 'UBGUEQSObject::QuerierObject' has a wrong offset!");
static_assert(offsetof(UBGUEQSObject, Req_ExParamMap) == 0x0000A0, "Member 'UBGUEQSObject::Req_ExParamMap' has a wrong offset!");
static_assert(offsetof(UBGUEQSObject, FBUE_RunEQSFinish) == 0x0000F0, "Member 'UBGUEQSObject::FBUE_RunEQSFinish' has a wrong offset!");

// Class b1.AnimNotifyState_GSLockHandFoot
// 0x0008 (0x0050 - 0x0048)
class UAnimNotifyState_GSLockHandFoot : public UAnimNotifyState_GSBase
{
public:
	EBUHandFootType                               NeedLockType;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BeginReduceScale;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotifyState_GSLockHandFoot">();
	}
	static class UAnimNotifyState_GSLockHandFoot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotifyState_GSLockHandFoot>();
	}
};
static_assert(alignof(UAnimNotifyState_GSLockHandFoot) == 0x000008, "Wrong alignment on UAnimNotifyState_GSLockHandFoot");
static_assert(sizeof(UAnimNotifyState_GSLockHandFoot) == 0x000050, "Wrong size on UAnimNotifyState_GSLockHandFoot");
static_assert(offsetof(UAnimNotifyState_GSLockHandFoot, NeedLockType) == 0x000048, "Member 'UAnimNotifyState_GSLockHandFoot::NeedLockType' has a wrong offset!");
static_assert(offsetof(UAnimNotifyState_GSLockHandFoot, BeginReduceScale) == 0x00004C, "Member 'UAnimNotifyState_GSLockHandFoot::BeginReduceScale' has a wrong offset!");

// Class b1.BGUFluid2DComponent
// 0x0218 (0x02C8 - 0x00B0)
class UBGUFluid2DComponent final : public UActorComponent
{
public:
	bool                                          ToggleSim;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPostProcessCollisionData;                         // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          blueprintDrivenParameters;                         // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMovedCheck;                                       // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          blocationCheck;                                    // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLocalSim;                                         // 0x00B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHighQualitySim;                                   // 0x00B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSimAreaClamp;                                     // 0x00B7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MaxIteration;                                      // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SimulationResX;                                    // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SimulationResY;                                    // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimAreaSizeInCM;                                   // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   SnappedPosParameterName;                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialParameterCollection*           DynamicSDFMpc;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldOffsetThreshold;                              // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MoveThreadhold;                                    // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EdgeExtendSize;                                    // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportVeloDensity;                                // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExportPressureDivergence;                         // 0x00E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 VeloDensityOutput;                                 // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 PressureDivergenceOutput;                          // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     CollisionQueryMaterial;                            // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PPCollisionQueryMaterial;                          // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     CompositeMaterial;                                 // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     AdvectMaterial;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DivergenceMaterial;                                // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PressureStep1Material;                             // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     PressureStep2Material;                             // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushPuncture;                                     // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoise;                                      // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Speed;                                             // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloFromSimAreaMotion;                             // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SimEdgeBouncyness;                                 // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FadeDensityAtSimEdge;                              // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoiseSize;                                  // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloDirNoiseSpeed;                                 // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloOffsetX;                                       // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloOffsetY;                                       // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloFromBrushMotion;                               // 0x0158(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloStrength;                                      // 0x015C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloRotate;                                        // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloAmpNoise;                                      // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InputFeedback;                                     // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         FlowFeedback;                                      // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Divergence;                                        // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushSize;                                         // 0x0174(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushStrength;                                     // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EraserMode;                                        // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushHardness;                                     // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             DensityTemplate;                                   // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             VelocityTemplate;                                  // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VelocityOffsetSpeed;                               // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EdgeMaskWidth;                                     // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtMult;                                    // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtScale;                                   // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtOffsetX;                                 // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityTxtOffsetY;                                 // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushNoise;                                        // 0x01B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         VeloInputTile;                                     // 0x01B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseAmp;                              // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseOffset;                           // 0x01BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DensityInputNoiseTile;                             // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BrushRnd;                                          // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldOffsetX;                                      // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         WorldOffsetY;                                      // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1D0[0x90];                                     // 0x01D0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RT_CollisionResult;                                // 0x0260(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PPCollisionResult;                              // 0x0268(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_Advection;                                      // 0x0270(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PressureDivergence;                             // 0x0278(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_Composite;                                      // 0x0280(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTextureRenderTarget2D*                 RT_PressureDivergenceTemp;                         // 0x0288(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CollisionQueryMaterialInstance;                    // 0x0290(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PPCollisionQueryMaterialInstance;                  // 0x0298(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               CompositeMaterialInstance;                         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               AdvectMaterialInstance;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               DivergenceMaterialInstance;                        // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PressureStep1MaterialInstance;                     // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInstanceDynamic*               PressureStep2MaterialInstance;                     // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UTextureRenderTarget2D* GetPressureDivergenceTexture();
	class UTextureRenderTarget2D* GetVeloDensityTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUFluid2DComponent">();
	}
	static class UBGUFluid2DComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUFluid2DComponent>();
	}
};
static_assert(alignof(UBGUFluid2DComponent) == 0x000008, "Wrong alignment on UBGUFluid2DComponent");
static_assert(sizeof(UBGUFluid2DComponent) == 0x0002C8, "Wrong size on UBGUFluid2DComponent");
static_assert(offsetof(UBGUFluid2DComponent, ToggleSim) == 0x0000B0, "Member 'UBGUFluid2DComponent::ToggleSim' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bPostProcessCollisionData) == 0x0000B1, "Member 'UBGUFluid2DComponent::bPostProcessCollisionData' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, blueprintDrivenParameters) == 0x0000B2, "Member 'UBGUFluid2DComponent::blueprintDrivenParameters' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bMovedCheck) == 0x0000B3, "Member 'UBGUFluid2DComponent::bMovedCheck' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, blocationCheck) == 0x0000B4, "Member 'UBGUFluid2DComponent::blocationCheck' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bLocalSim) == 0x0000B5, "Member 'UBGUFluid2DComponent::bLocalSim' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bHighQualitySim) == 0x0000B6, "Member 'UBGUFluid2DComponent::bHighQualitySim' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bSimAreaClamp) == 0x0000B7, "Member 'UBGUFluid2DComponent::bSimAreaClamp' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, MaxIteration) == 0x0000B8, "Member 'UBGUFluid2DComponent::MaxIteration' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, SimulationResX) == 0x0000BC, "Member 'UBGUFluid2DComponent::SimulationResX' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, SimulationResY) == 0x0000C0, "Member 'UBGUFluid2DComponent::SimulationResY' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, SimAreaSizeInCM) == 0x0000C4, "Member 'UBGUFluid2DComponent::SimAreaSizeInCM' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, SnappedPosParameterName) == 0x0000C8, "Member 'UBGUFluid2DComponent::SnappedPosParameterName' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, DynamicSDFMpc) == 0x0000D0, "Member 'UBGUFluid2DComponent::DynamicSDFMpc' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, WorldOffsetThreshold) == 0x0000D8, "Member 'UBGUFluid2DComponent::WorldOffsetThreshold' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, MoveThreadhold) == 0x0000DC, "Member 'UBGUFluid2DComponent::MoveThreadhold' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, EdgeExtendSize) == 0x0000E0, "Member 'UBGUFluid2DComponent::EdgeExtendSize' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bExportVeloDensity) == 0x0000E4, "Member 'UBGUFluid2DComponent::bExportVeloDensity' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, bExportPressureDivergence) == 0x0000E5, "Member 'UBGUFluid2DComponent::bExportPressureDivergence' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloDensityOutput) == 0x0000E8, "Member 'UBGUFluid2DComponent::VeloDensityOutput' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, PressureDivergenceOutput) == 0x0000F0, "Member 'UBGUFluid2DComponent::PressureDivergenceOutput' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, CollisionQueryMaterial) == 0x0000F8, "Member 'UBGUFluid2DComponent::CollisionQueryMaterial' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, PPCollisionQueryMaterial) == 0x000100, "Member 'UBGUFluid2DComponent::PPCollisionQueryMaterial' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, CompositeMaterial) == 0x000108, "Member 'UBGUFluid2DComponent::CompositeMaterial' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, AdvectMaterial) == 0x000110, "Member 'UBGUFluid2DComponent::AdvectMaterial' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, DivergenceMaterial) == 0x000118, "Member 'UBGUFluid2DComponent::DivergenceMaterial' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, PressureStep1Material) == 0x000120, "Member 'UBGUFluid2DComponent::PressureStep1Material' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, PressureStep2Material) == 0x000128, "Member 'UBGUFluid2DComponent::PressureStep2Material' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, BrushPuncture) == 0x000130, "Member 'UBGUFluid2DComponent::BrushPuncture' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloDirNoise) == 0x000134, "Member 'UBGUFluid2DComponent::VeloDirNoise' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, Speed) == 0x000138, "Member 'UBGUFluid2DComponent::Speed' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloFromSimAreaMotion) == 0x00013C, "Member 'UBGUFluid2DComponent::VeloFromSimAreaMotion' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, SimEdgeBouncyness) == 0x000140, "Member 'UBGUFluid2DComponent::SimEdgeBouncyness' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, FadeDensityAtSimEdge) == 0x000144, "Member 'UBGUFluid2DComponent::FadeDensityAtSimEdge' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloDirNoiseSize) == 0x000148, "Member 'UBGUFluid2DComponent::VeloDirNoiseSize' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloDirNoiseSpeed) == 0x00014C, "Member 'UBGUFluid2DComponent::VeloDirNoiseSpeed' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloOffsetX) == 0x000150, "Member 'UBGUFluid2DComponent::VeloOffsetX' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloOffsetY) == 0x000154, "Member 'UBGUFluid2DComponent::VeloOffsetY' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloFromBrushMotion) == 0x000158, "Member 'UBGUFluid2DComponent::VeloFromBrushMotion' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloStrength) == 0x00015C, "Member 'UBGUFluid2DComponent::VeloStrength' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloRotate) == 0x000160, "Member 'UBGUFluid2DComponent::VeloRotate' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, VeloAmpNoise) == 0x000164, "Member 'UBGUFluid2DComponent::VeloAmpNoise' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, InputFeedback) == 0x000168, "Member 'UBGUFluid2DComponent::InputFeedback' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, FlowFeedback) == 0x00016C, "Member 'UBGUFluid2DComponent::FlowFeedback' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, Divergence) == 0x000170, "Member 'UBGUFluid2DComponent::Divergence' has a wrong offset!");
static_assert(offsetof(UBGUFluid2DComponent, BrushSize) == 0x000174, "Member 'UBGUFluid2DComponent::BrushSize' has a wrong offset!");
