#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1

#include "Basic.hpp"

#include "b1_structs.hpp"
#include "AIModule_structs.hpp"
#include "ProceduralMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Calliope_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UnrealExtent_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "NetCore_structs.hpp"


namespace SDK::Params
{

// Function b1.ActorDataContainer.AddDataObjInCS
// 0x0008 (0x0008 - 0x0000)
struct ActorDataContainer_AddDataObjInCS final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorDataContainer_AddDataObjInCS) == 0x000008, "Wrong alignment on ActorDataContainer_AddDataObjInCS");
static_assert(sizeof(ActorDataContainer_AddDataObjInCS) == 0x000008, "Wrong size on ActorDataContainer_AddDataObjInCS");
static_assert(offsetof(ActorDataContainer_AddDataObjInCS, Obj) == 0x000000, "Member 'ActorDataContainer_AddDataObjInCS::Obj' has a wrong offset!");

// Function b1.ActorCompContainer.FillDataContainer
// 0x0008 (0x0008 - 0x0000)
struct ActorCompContainer_FillDataContainer final
{
public:
	class UActorDataContainer*                    DataObj;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorCompContainer_FillDataContainer) == 0x000008, "Wrong alignment on ActorCompContainer_FillDataContainer");
static_assert(sizeof(ActorCompContainer_FillDataContainer) == 0x000008, "Wrong size on ActorCompContainer_FillDataContainer");
static_assert(offsetof(ActorCompContainer_FillDataContainer, DataObj) == 0x000000, "Member 'ActorCompContainer_FillDataContainer::DataObj' has a wrong offset!");

// Function b1.ActorCompContainer.FillEventCollection
// 0x0008 (0x0008 - 0x0000)
struct ActorCompContainer_FillEventCollection final
{
public:
	class UObject*                                DataObj;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorCompContainer_FillEventCollection) == 0x000008, "Wrong alignment on ActorCompContainer_FillEventCollection");
static_assert(sizeof(ActorCompContainer_FillEventCollection) == 0x000008, "Wrong size on ActorCompContainer_FillEventCollection");
static_assert(offsetof(ActorCompContainer_FillEventCollection, DataObj) == 0x000000, "Member 'ActorCompContainer_FillEventCollection::DataObj' has a wrong offset!");

// Function b1.ActorCompContainer.SetTeamID
// 0x0004 (0x0004 - 0x0000)
struct ActorCompContainer_SetTeamID final
{
public:
	int32                                         ID;                                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ActorCompContainer_SetTeamID) == 0x000004, "Wrong alignment on ActorCompContainer_SetTeamID");
static_assert(sizeof(ActorCompContainer_SetTeamID) == 0x000004, "Wrong size on ActorCompContainer_SetTeamID");
static_assert(offsetof(ActorCompContainer_SetTeamID, ID) == 0x000000, "Member 'ActorCompContainer_SetTeamID::ID' has a wrong offset!");

// Function b1.BGUCrowdFollowingComponent.SetCrowdFollowingEnabled
// 0x0002 (0x0002 - 0x0000)
struct BGUCrowdFollowingComponent_SetCrowdFollowingEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsObstacle;                                       // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUCrowdFollowingComponent_SetCrowdFollowingEnabled) == 0x000001, "Wrong alignment on BGUCrowdFollowingComponent_SetCrowdFollowingEnabled");
static_assert(sizeof(BGUCrowdFollowingComponent_SetCrowdFollowingEnabled) == 0x000002, "Wrong size on BGUCrowdFollowingComponent_SetCrowdFollowingEnabled");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingEnabled, bEnabled) == 0x000000, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingEnabled::bEnabled' has a wrong offset!");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingEnabled, bIsObstacle) == 0x000001, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingEnabled::bIsObstacle' has a wrong offset!");

// Function b1.BGUCrowdFollowingComponent.SetCrowdFollowingParam
// 0x0010 (0x0010 - 0x0000)
struct BGUCrowdFollowingComponent_SetCrowdFollowingParam final
{
public:
	float                                         FSeparationWeight;                                 // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FCollisionQueryRange;                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FPathOptimizationRange;                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IAvoidanceQualityLevel;                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUCrowdFollowingComponent_SetCrowdFollowingParam) == 0x000004, "Wrong alignment on BGUCrowdFollowingComponent_SetCrowdFollowingParam");
static_assert(sizeof(BGUCrowdFollowingComponent_SetCrowdFollowingParam) == 0x000010, "Wrong size on BGUCrowdFollowingComponent_SetCrowdFollowingParam");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingParam, FSeparationWeight) == 0x000000, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingParam::FSeparationWeight' has a wrong offset!");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingParam, FCollisionQueryRange) == 0x000004, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingParam::FCollisionQueryRange' has a wrong offset!");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingParam, FPathOptimizationRange) == 0x000008, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingParam::FPathOptimizationRange' has a wrong offset!");
static_assert(offsetof(BGUCrowdFollowingComponent_SetCrowdFollowingParam, IAvoidanceQualityLevel) == 0x00000C, "Member 'BGUCrowdFollowingComponent_SetCrowdFollowingParam::IAvoidanceQualityLevel' has a wrong offset!");

// Function b1.AnimNotifyFuncLibrary.DeleteAnimNotifyAndAnimNotifyState
// 0x0028 (0x0028 - 0x0000)
struct AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EGsEnAnimN>                            NotifyTypeList;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EGsEnAnimNS>                           NotifyStateTypeList;                               // 0x0018(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState) == 0x000008, "Wrong alignment on AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState");
static_assert(sizeof(AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState) == 0x000028, "Wrong size on AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState");
static_assert(offsetof(AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState, AnimMontage) == 0x000000, "Member 'AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState::AnimMontage' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState, NotifyTypeList) == 0x000008, "Member 'AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState::NotifyTypeList' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState, NotifyStateTypeList) == 0x000018, "Member 'AnimNotifyFuncLibrary_DeleteAnimNotifyAndAnimNotifyState::NotifyStateTypeList' has a wrong offset!");

// Function b1.AnimNotifyFuncLibrary.GetAllAnimNotifySoftAsset
// 0x00A8 (0x00A8 - 0x0000)
struct AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset final
{
public:
	class UAnimSequenceBase*                      AnimBase;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> OutNotifyRefs;                                     // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> OutNotifyStateRefs;                                // 0x0058(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset) == 0x000008, "Wrong alignment on AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset");
static_assert(sizeof(AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset) == 0x0000A8, "Wrong size on AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset");
static_assert(offsetof(AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset, AnimBase) == 0x000000, "Member 'AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset::AnimBase' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset, OutNotifyRefs) == 0x000008, "Member 'AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset::OutNotifyRefs' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset, OutNotifyStateRefs) == 0x000058, "Member 'AnimNotifyFuncLibrary_GetAllAnimNotifySoftAsset::OutNotifyStateRefs' has a wrong offset!");

// Function b1.AnimNotifyFuncLibrary.PrepareAnimationsNotifySoftAsset
// 0x00B0 (0x00B0 - 0x0000)
struct AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset final
{
public:
	TArray<class UAnimSequenceBase*>              AnimBases;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> OutNotifyRefs;                                     // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> OutNotifyStateRefs;                                // 0x0060(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset) == 0x000008, "Wrong alignment on AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset");
static_assert(sizeof(AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset) == 0x0000B0, "Wrong size on AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset, AnimBases) == 0x000000, "Member 'AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset::AnimBases' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset, OutNotifyRefs) == 0x000010, "Member 'AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset::OutNotifyRefs' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset, OutNotifyStateRefs) == 0x000060, "Member 'AnimNotifyFuncLibrary_PrepareAnimationsNotifySoftAsset::OutNotifyStateRefs' has a wrong offset!");

// Function b1.AnimNotifyFuncLibrary.PrepareAnimNotifySoftAsset
// 0x00A8 (0x00A8 - 0x0000)
struct AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset final
{
public:
	class UAnimSequenceBase*                      AnimBase;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UAnimNotify_GSBase*, struct FNotifySoftRefs> OutNotifyRefs;                                     // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	TMap<class UAnimNotifyState_GSBase*, struct FNotifySoftRefs> OutNotifyStateRefs;                                // 0x0058(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset) == 0x000008, "Wrong alignment on AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset");
static_assert(sizeof(AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset) == 0x0000A8, "Wrong size on AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset, AnimBase) == 0x000000, "Member 'AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset::AnimBase' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset, OutNotifyRefs) == 0x000008, "Member 'AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset::OutNotifyRefs' has a wrong offset!");
static_assert(offsetof(AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset, OutNotifyStateRefs) == 0x000058, "Member 'AnimNotifyFuncLibrary_PrepareAnimNotifySoftAsset::OutNotifyStateRefs' has a wrong offset!");

// Function b1.BGUDataComp.InitWithAIController
// 0x0008 (0x0008 - 0x0000)
struct BGUDataComp_InitWithAIController final
{
public:
	class ABGUAIController*                       AIController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDataComp_InitWithAIController) == 0x000008, "Wrong alignment on BGUDataComp_InitWithAIController");
static_assert(sizeof(BGUDataComp_InitWithAIController) == 0x000008, "Wrong size on BGUDataComp_InitWithAIController");
static_assert(offsetof(BGUDataComp_InitWithAIController, AIController) == 0x000000, "Member 'BGUDataComp_InitWithAIController::AIController' has a wrong offset!");

// Function b1.BGUDataComp.InitWithCharacter
// 0x0008 (0x0008 - 0x0000)
struct BGUDataComp_InitWithCharacter final
{
public:
	class ABGUCharacter*                          Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDataComp_InitWithCharacter) == 0x000008, "Wrong alignment on BGUDataComp_InitWithCharacter");
static_assert(sizeof(BGUDataComp_InitWithCharacter) == 0x000008, "Wrong size on BGUDataComp_InitWithCharacter");
static_assert(offsetof(BGUDataComp_InitWithCharacter, Character) == 0x000000, "Member 'BGUDataComp_InitWithCharacter::Character' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.AddPreloadedAsset
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_AddPreloadedAsset final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_AddPreloadedAsset) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_AddPreloadedAsset");
static_assert(sizeof(AnimNotifyState_GSBase_AddPreloadedAsset) == 0x000008, "Wrong size on AnimNotifyState_GSBase_AddPreloadedAsset");
static_assert(offsetof(AnimNotifyState_GSBase_AddPreloadedAsset, Obj) == 0x000000, "Member 'AnimNotifyState_GSBase_AddPreloadedAsset::Obj' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GetAnimNSType
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyState_GSBase_GetAnimNSType final
{
public:
	EGsEnAnimNS                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GetAnimNSType) == 0x000001, "Wrong alignment on AnimNotifyState_GSBase_GetAnimNSType");
static_assert(sizeof(AnimNotifyState_GSBase_GetAnimNSType) == 0x000001, "Wrong size on AnimNotifyState_GSBase_GetAnimNSType");
static_assert(offsetof(AnimNotifyState_GSBase_GetAnimNSType, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GetAnimNSType::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GetJumpableSectionPrefix
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetJumpableSectionPrefix final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GetJumpableSectionPrefix) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GetJumpableSectionPrefix");
static_assert(sizeof(AnimNotifyState_GSBase_GetJumpableSectionPrefix) == 0x000010, "Wrong size on AnimNotifyState_GSBase_GetJumpableSectionPrefix");
static_assert(offsetof(AnimNotifyState_GSBase_GetJumpableSectionPrefix, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GetJumpableSectionPrefix::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GetModifySpeedRate
// 0x0004 (0x0004 - 0x0000)
struct AnimNotifyState_GSBase_GetModifySpeedRate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GetModifySpeedRate) == 0x000004, "Wrong alignment on AnimNotifyState_GSBase_GetModifySpeedRate");
static_assert(sizeof(AnimNotifyState_GSBase_GetModifySpeedRate) == 0x000004, "Wrong size on AnimNotifyState_GSBase_GetModifySpeedRate");
static_assert(offsetof(AnimNotifyState_GSBase_GetModifySpeedRate, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GetModifySpeedRate::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GetPreloadedAssets
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetPreloadedAssets final
{
public:
	TArray<class UObject*>                        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GetPreloadedAssets) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GetPreloadedAssets");
static_assert(sizeof(AnimNotifyState_GSBase_GetPreloadedAssets) == 0x000010, "Wrong size on AnimNotifyState_GSBase_GetPreloadedAssets");
static_assert(offsetof(AnimNotifyState_GSBase_GetPreloadedAssets, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GetPreloadedAssets::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GetSoftReferences) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GetSoftReferences");
static_assert(sizeof(AnimNotifyState_GSBase_GetSoftReferences) == 0x000010, "Wrong size on AnimNotifyState_GSBase_GetSoftReferences");
static_assert(offsetof(AnimNotifyState_GSBase_GetSoftReferences, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GetSoftReferences::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSAllowCrossSection
// 0x0001 (0x0001 - 0x0000)
struct AnimNotifyState_GSBase_GSAllowCrossSection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GSAllowCrossSection) == 0x000001, "Wrong alignment on AnimNotifyState_GSBase_GSAllowCrossSection");
static_assert(sizeof(AnimNotifyState_GSBase_GSAllowCrossSection) == 0x000001, "Wrong size on AnimNotifyState_GSBase_GSAllowCrossSection");
static_assert(offsetof(AnimNotifyState_GSBase_GSAllowCrossSection, ReturnValue) == 0x000000, "Member 'AnimNotifyState_GSBase_GSAllowCrossSection::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyBeginCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         TotalDuration;                                     // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyBeginCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyBeginCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyBeginCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyBeginCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyBeginCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyBeginCS, TotalDuration) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyBeginCS::TotalDuration' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostBeginCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostBeginCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostEndCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPostEndCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPostEndCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPostEndCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPostEndCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostEndCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostEndCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostEndCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostEndCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPostTickCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPostTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPostTickCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPostTickCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPostTickCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPostTickCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostTickCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostTickCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPostTickCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPostTickCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreBeginCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreBeginCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreEndCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPreEndCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPreEndCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPreEndCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPreEndCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreEndCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreEndCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreEndCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreEndCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyDebugPreTickCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyDebugPreTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyDebugPreTickCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyDebugPreTickCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyDebugPreTickCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyDebugPreTickCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreTickCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreTickCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyDebugPreTickCS, ReturnValue) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyDebugPreTickCS::ReturnValue' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyEndCS
// 0x0040 (0x0040 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyEndCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyEndCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyEndCS) == 0x000040, "Wrong size on AnimNotifyState_GSBase_GSNotifyEndCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyEndCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyEndCS::NotifyParam' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSNotifyTickCS
// 0x0048 (0x0048 - 0x0000)
struct AnimNotifyState_GSBase_GSNotifyTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                         FrameDeltaTime;                                    // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSNotifyTickCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSNotifyTickCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSNotifyTickCS) == 0x000048, "Wrong size on AnimNotifyState_GSBase_GSNotifyTickCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyTickCS, NotifyParam) == 0x000000, "Member 'AnimNotifyState_GSBase_GSNotifyTickCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSNotifyTickCS, FrameDeltaTime) == 0x000040, "Member 'AnimNotifyState_GSBase_GSNotifyTickCS::FrameDeltaTime' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSOnSectionManuallyChanged
// 0x0010 (0x0010 - 0x0000)
struct AnimNotifyState_GSBase_GSOnSectionManuallyChanged final
{
public:
	class ABGUCharacter*                          OwnerChar;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RemainingDuration;                                 // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AnimNotifyState_GSBase_GSOnSectionManuallyChanged) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSOnSectionManuallyChanged");
static_assert(sizeof(AnimNotifyState_GSBase_GSOnSectionManuallyChanged) == 0x000010, "Wrong size on AnimNotifyState_GSBase_GSOnSectionManuallyChanged");
static_assert(offsetof(AnimNotifyState_GSBase_GSOnSectionManuallyChanged, OwnerChar) == 0x000000, "Member 'AnimNotifyState_GSBase_GSOnSectionManuallyChanged::OwnerChar' has a wrong offset!");
static_assert(offsetof(AnimNotifyState_GSBase_GSOnSectionManuallyChanged, RemainingDuration) == 0x000008, "Member 'AnimNotifyState_GSBase_GSOnSectionManuallyChanged::RemainingDuration' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.GSValidateInputCS
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_GSValidateInputCS final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_GSValidateInputCS) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_GSValidateInputCS");
static_assert(sizeof(AnimNotifyState_GSBase_GSValidateInputCS) == 0x000008, "Wrong size on AnimNotifyState_GSBase_GSValidateInputCS");
static_assert(offsetof(AnimNotifyState_GSBase_GSValidateInputCS, Actor) == 0x000000, "Member 'AnimNotifyState_GSBase_GSValidateInputCS::Actor' has a wrong offset!");

// Function b1.AnimNotifyState_GSBase.UpdateDataOnNotifyStateReplace
// 0x0008 (0x0008 - 0x0000)
struct AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace final
{
public:
	const class UAnimNotifyState*                 NewNotifyState;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace) == 0x000008, "Wrong alignment on AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace");
static_assert(sizeof(AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace) == 0x000008, "Wrong size on AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace");
static_assert(offsetof(AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace, NewNotifyState) == 0x000000, "Member 'AnimNotifyState_GSBase_UpdateDataOnNotifyStateReplace::NewNotifyState' has a wrong offset!");

// Function b1.BGUDebugCircleComponent.SetCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_SetCircleRadius final
{
public:
	float                                         InCircleRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugCircleComponent_SetCircleRadius) == 0x000004, "Wrong alignment on BGUDebugCircleComponent_SetCircleRadius");
static_assert(sizeof(BGUDebugCircleComponent_SetCircleRadius) == 0x000004, "Wrong size on BGUDebugCircleComponent_SetCircleRadius");
static_assert(offsetof(BGUDebugCircleComponent_SetCircleRadius, InCircleRadius) == 0x000000, "Member 'BGUDebugCircleComponent_SetCircleRadius::InCircleRadius' has a wrong offset!");

// Function b1.BGUDebugCircleComponent.GetScaledCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetScaledCircleRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugCircleComponent_GetScaledCircleRadius) == 0x000004, "Wrong alignment on BGUDebugCircleComponent_GetScaledCircleRadius");
static_assert(sizeof(BGUDebugCircleComponent_GetScaledCircleRadius) == 0x000004, "Wrong size on BGUDebugCircleComponent_GetScaledCircleRadius");
static_assert(offsetof(BGUDebugCircleComponent_GetScaledCircleRadius, ReturnValue) == 0x000000, "Member 'BGUDebugCircleComponent_GetScaledCircleRadius::ReturnValue' has a wrong offset!");

// Function b1.BGUDebugCircleComponent.GetShapeScale
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetShapeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugCircleComponent_GetShapeScale) == 0x000004, "Wrong alignment on BGUDebugCircleComponent_GetShapeScale");
static_assert(sizeof(BGUDebugCircleComponent_GetShapeScale) == 0x000004, "Wrong size on BGUDebugCircleComponent_GetShapeScale");
static_assert(offsetof(BGUDebugCircleComponent_GetShapeScale, ReturnValue) == 0x000000, "Member 'BGUDebugCircleComponent_GetShapeScale::ReturnValue' has a wrong offset!");

// Function b1.BGUDebugCircleComponent.GetUnscaledCircleRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugCircleComponent_GetUnscaledCircleRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugCircleComponent_GetUnscaledCircleRadius) == 0x000004, "Wrong alignment on BGUDebugCircleComponent_GetUnscaledCircleRadius");
static_assert(sizeof(BGUDebugCircleComponent_GetUnscaledCircleRadius) == 0x000004, "Wrong size on BGUDebugCircleComponent_GetUnscaledCircleRadius");
static_assert(offsetof(BGUDebugCircleComponent_GetUnscaledCircleRadius, ReturnValue) == 0x000000, "Member 'BGUDebugCircleComponent_GetUnscaledCircleRadius::ReturnValue' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.SetSectorMaxAngle
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorMaxAngle final
{
public:
	float                                         InMaxAngle;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_SetSectorMaxAngle) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_SetSectorMaxAngle");
static_assert(sizeof(BGUDebugSectorComponent_SetSectorMaxAngle) == 0x000004, "Wrong size on BGUDebugSectorComponent_SetSectorMaxAngle");
static_assert(offsetof(BGUDebugSectorComponent_SetSectorMaxAngle, InMaxAngle) == 0x000000, "Member 'BGUDebugSectorComponent_SetSectorMaxAngle::InMaxAngle' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.SetSectorMinAngle
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorMinAngle final
{
public:
	float                                         InMinAngle;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_SetSectorMinAngle) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_SetSectorMinAngle");
static_assert(sizeof(BGUDebugSectorComponent_SetSectorMinAngle) == 0x000004, "Wrong size on BGUDebugSectorComponent_SetSectorMinAngle");
static_assert(offsetof(BGUDebugSectorComponent_SetSectorMinAngle, InMinAngle) == 0x000000, "Member 'BGUDebugSectorComponent_SetSectorMinAngle::InMinAngle' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.SetSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_SetSectorRadius final
{
public:
	float                                         InSectorRadius;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_SetSectorRadius) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_SetSectorRadius");
static_assert(sizeof(BGUDebugSectorComponent_SetSectorRadius) == 0x000004, "Wrong size on BGUDebugSectorComponent_SetSectorRadius");
static_assert(offsetof(BGUDebugSectorComponent_SetSectorRadius, InSectorRadius) == 0x000000, "Member 'BGUDebugSectorComponent_SetSectorRadius::InSectorRadius' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.GetScaledSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetScaledSectorRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_GetScaledSectorRadius) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_GetScaledSectorRadius");
static_assert(sizeof(BGUDebugSectorComponent_GetScaledSectorRadius) == 0x000004, "Wrong size on BGUDebugSectorComponent_GetScaledSectorRadius");
static_assert(offsetof(BGUDebugSectorComponent_GetScaledSectorRadius, ReturnValue) == 0x000000, "Member 'BGUDebugSectorComponent_GetScaledSectorRadius::ReturnValue' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.GetShapeScale
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetShapeScale final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_GetShapeScale) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_GetShapeScale");
static_assert(sizeof(BGUDebugSectorComponent_GetShapeScale) == 0x000004, "Wrong size on BGUDebugSectorComponent_GetShapeScale");
static_assert(offsetof(BGUDebugSectorComponent_GetShapeScale, ReturnValue) == 0x000000, "Member 'BGUDebugSectorComponent_GetShapeScale::ReturnValue' has a wrong offset!");

// Function b1.BGUDebugSectorComponent.GetUnscaledSectorRadius
// 0x0004 (0x0004 - 0x0000)
struct BGUDebugSectorComponent_GetUnscaledSectorRadius final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUDebugSectorComponent_GetUnscaledSectorRadius) == 0x000004, "Wrong alignment on BGUDebugSectorComponent_GetUnscaledSectorRadius");
static_assert(sizeof(BGUDebugSectorComponent_GetUnscaledSectorRadius) == 0x000004, "Wrong size on BGUDebugSectorComponent_GetUnscaledSectorRadius");
static_assert(offsetof(BGUDebugSectorComponent_GetUnscaledSectorRadius, ReturnValue) == 0x000000, "Member 'BGUDebugSectorComponent_GetUnscaledSectorRadius::ReturnValue' has a wrong offset!");

// Function b1.BGUEditorTickableActor.GetViewportCameraLocation
// 0x0018 (0x0018 - 0x0000)
struct BGUEditorTickableActor_GetViewportCameraLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUEditorTickableActor_GetViewportCameraLocation) == 0x000008, "Wrong alignment on BGUEditorTickableActor_GetViewportCameraLocation");
static_assert(sizeof(BGUEditorTickableActor_GetViewportCameraLocation) == 0x000018, "Wrong size on BGUEditorTickableActor_GetViewportCameraLocation");
static_assert(offsetof(BGUEditorTickableActor_GetViewportCameraLocation, ReturnValue) == 0x000000, "Member 'BGUEditorTickableActor_GetViewportCameraLocation::ReturnValue' has a wrong offset!");

// Function b1.BGUEQSObject.EQSObjRun
// 0x0028 (0x0028 - 0x0000)
struct BGUEQSObject_EQSObjRun final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSEQSExParam                          _ExParam;                                          // 0x0014(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BGUEQSObject_EQSObjRun) == 0x000008, "Wrong alignment on BGUEQSObject_EQSObjRun");
static_assert(sizeof(BGUEQSObject_EQSObjRun) == 0x000028, "Wrong size on BGUEQSObject_EQSObjRun");
static_assert(offsetof(BGUEQSObject_EQSObjRun, EnvQueryObj) == 0x000000, "Member 'BGUEQSObject_EQSObjRun::EnvQueryObj' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRun, Querier) == 0x000008, "Member 'BGUEQSObject_EQSObjRun::Querier' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRun, Reason) == 0x000010, "Member 'BGUEQSObject_EQSObjRun::Reason' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRun, _ExParam) == 0x000014, "Member 'BGUEQSObject_EQSObjRun::_ExParam' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRun, ReturnValue) == 0x000020, "Member 'BGUEQSObject_EQSObjRun::ReturnValue' has a wrong offset!");

// Function b1.BGUEQSObject.EQSObjRunInstant
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSObjRunInstant final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Locations;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Scores;                                            // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUEQSObject_EQSObjRunInstant) == 0x000008, "Wrong alignment on BGUEQSObject_EQSObjRunInstant");
static_assert(sizeof(BGUEQSObject_EQSObjRunInstant) == 0x000030, "Wrong size on BGUEQSObject_EQSObjRunInstant");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstant, EnvQueryObj) == 0x000000, "Member 'BGUEQSObject_EQSObjRunInstant::EnvQueryObj' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstant, Querier) == 0x000008, "Member 'BGUEQSObject_EQSObjRunInstant::Querier' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstant, Locations) == 0x000010, "Member 'BGUEQSObject_EQSObjRunInstant::Locations' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstant, Scores) == 0x000020, "Member 'BGUEQSObject_EQSObjRunInstant::Scores' has a wrong offset!");

// Function b1.BGUEQSObject.EQSObjRunInstantWithCustomParams
// 0x0040 (0x0040 - 0x0000)
struct BGUEQSObject_EQSObjRunInstantWithCustomParams final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSEnvNamedValue>               NamedParams;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Locations;                                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 Scores;                                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUEQSObject_EQSObjRunInstantWithCustomParams) == 0x000008, "Wrong alignment on BGUEQSObject_EQSObjRunInstantWithCustomParams");
static_assert(sizeof(BGUEQSObject_EQSObjRunInstantWithCustomParams) == 0x000040, "Wrong size on BGUEQSObject_EQSObjRunInstantWithCustomParams");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstantWithCustomParams, EnvQueryObj) == 0x000000, "Member 'BGUEQSObject_EQSObjRunInstantWithCustomParams::EnvQueryObj' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstantWithCustomParams, Querier) == 0x000008, "Member 'BGUEQSObject_EQSObjRunInstantWithCustomParams::Querier' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstantWithCustomParams, NamedParams) == 0x000010, "Member 'BGUEQSObject_EQSObjRunInstantWithCustomParams::NamedParams' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstantWithCustomParams, Locations) == 0x000020, "Member 'BGUEQSObject_EQSObjRunInstantWithCustomParams::Locations' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunInstantWithCustomParams, Scores) == 0x000030, "Member 'BGUEQSObject_EQSObjRunInstantWithCustomParams::Scores' has a wrong offset!");

// Function b1.BGUEQSObject.EQSObjRunWithCustomParams
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSObjRunWithCustomParams final
{
public:
	const class UEnvQuery*                        EnvQueryObj;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGSEnvNamedValue>               NamedParams;                                       // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BGUEQSObject_EQSObjRunWithCustomParams) == 0x000008, "Wrong alignment on BGUEQSObject_EQSObjRunWithCustomParams");
static_assert(sizeof(BGUEQSObject_EQSObjRunWithCustomParams) == 0x000030, "Wrong size on BGUEQSObject_EQSObjRunWithCustomParams");
static_assert(offsetof(BGUEQSObject_EQSObjRunWithCustomParams, EnvQueryObj) == 0x000000, "Member 'BGUEQSObject_EQSObjRunWithCustomParams::EnvQueryObj' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunWithCustomParams, Querier) == 0x000008, "Member 'BGUEQSObject_EQSObjRunWithCustomParams::Querier' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunWithCustomParams, Reason) == 0x000010, "Member 'BGUEQSObject_EQSObjRunWithCustomParams::Reason' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunWithCustomParams, NamedParams) == 0x000018, "Member 'BGUEQSObject_EQSObjRunWithCustomParams::NamedParams' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSObjRunWithCustomParams, ReturnValue) == 0x000028, "Member 'BGUEQSObject_EQSObjRunWithCustomParams::ReturnValue' has a wrong offset!");

// Function b1.BGUEQSObject.EQSRun
// 0x0030 (0x0030 - 0x0000)
struct BGUEQSObject_EQSRun final
{
public:
	class FString                                 EQSPath;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Querier;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBGURunEQSObjReason                           Reason;                                            // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSEQSExParam                          _ExParam;                                          // 0x001C(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(BGUEQSObject_EQSRun) == 0x000008, "Wrong alignment on BGUEQSObject_EQSRun");
static_assert(sizeof(BGUEQSObject_EQSRun) == 0x000030, "Wrong size on BGUEQSObject_EQSRun");
static_assert(offsetof(BGUEQSObject_EQSRun, EQSPath) == 0x000000, "Member 'BGUEQSObject_EQSRun::EQSPath' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSRun, Querier) == 0x000010, "Member 'BGUEQSObject_EQSRun::Querier' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSRun, Reason) == 0x000018, "Member 'BGUEQSObject_EQSRun::Reason' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSRun, _ExParam) == 0x00001C, "Member 'BGUEQSObject_EQSRun::_ExParam' has a wrong offset!");
static_assert(offsetof(BGUEQSObject_EQSRun, ReturnValue) == 0x000028, "Member 'BGUEQSObject_EQSRun::ReturnValue' has a wrong offset!");

// Function b1.BGUFluid2DComponent.GetPressureDivergenceTexture
// 0x0008 (0x0008 - 0x0000)
struct BGUFluid2DComponent_GetPressureDivergenceTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUFluid2DComponent_GetPressureDivergenceTexture) == 0x000008, "Wrong alignment on BGUFluid2DComponent_GetPressureDivergenceTexture");
static_assert(sizeof(BGUFluid2DComponent_GetPressureDivergenceTexture) == 0x000008, "Wrong size on BGUFluid2DComponent_GetPressureDivergenceTexture");
static_assert(offsetof(BGUFluid2DComponent_GetPressureDivergenceTexture, ReturnValue) == 0x000000, "Member 'BGUFluid2DComponent_GetPressureDivergenceTexture::ReturnValue' has a wrong offset!");

// Function b1.BGUFluid2DComponent.GetVeloDensityTexture
// 0x0008 (0x0008 - 0x0000)
struct BGUFluid2DComponent_GetVeloDensityTexture final
{
public:
	class UTextureRenderTarget2D*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BGUFluid2DComponent_GetVeloDensityTexture) == 0x000008, "Wrong alignment on BGUFluid2DComponent_GetVeloDensityTexture");
static_assert(sizeof(BGUFluid2DComponent_GetVeloDensityTexture) == 0x000008, "Wrong size on BGUFluid2DComponent_GetVeloDensityTexture");
static_assert(offsetof(BGUFluid2DComponent_GetVeloDensityTexture, ReturnValue) == 0x000000, "Member 'BGUFluid2DComponent_GetVeloDensityTexture::ReturnValue' has a wrong offset!");

// Function b1.BGUFuncLibData.BGUGetTagEnum
// 0x0018 (0x0018 - 0x0000)
struct BGUFuncLibData_BGUGetTagEnum final
{
public:
	class AActor*                                 Unit;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
