#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: b1MinusManaged

#include "Basic.hpp"

#include "b1_structs.hpp"
#include "b1MinusManaged_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "GSEMinusProtobufDB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Calliope_structs.hpp"
#include "GSInput_structs.hpp"
#include "InputCore_structs.hpp"
#include "AkAudio_structs.hpp"
#include "DonAINavigation_structs.hpp"
#include "AIModule_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "UnrealExtent_structs.hpp"


namespace SDK::Params
{

// Function b1-Managed.DispLib_EditorTestFXToolComp.TickComponentInCS
// 0x0004 (0x0004 - 0x0000)
struct DispLib_EditorTestFXToolComp_TickComponentInCS final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DispLib_EditorTestFXToolComp_TickComponentInCS) == 0x000004, "Wrong alignment on DispLib_EditorTestFXToolComp_TickComponentInCS");
static_assert(sizeof(DispLib_EditorTestFXToolComp_TickComponentInCS) == 0x000004, "Wrong size on DispLib_EditorTestFXToolComp_TickComponentInCS");
static_assert(offsetof(DispLib_EditorTestFXToolComp_TickComponentInCS, DeltaTime) == 0x000000, "Member 'DispLib_EditorTestFXToolComp_TickComponentInCS::DeltaTime' has a wrong offset!");

// Function b1-Managed.DispLib_EditorTestFXToolComp.EndPlayInCS
// 0x0001 (0x0001 - 0x0000)
struct DispLib_EditorTestFXToolComp_EndPlayInCS final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DispLib_EditorTestFXToolComp_EndPlayInCS) == 0x000001, "Wrong alignment on DispLib_EditorTestFXToolComp_EndPlayInCS");
static_assert(sizeof(DispLib_EditorTestFXToolComp_EndPlayInCS) == 0x000001, "Wrong size on DispLib_EditorTestFXToolComp_EndPlayInCS");
static_assert(offsetof(DispLib_EditorTestFXToolComp_EndPlayInCS, EndPlayReason) == 0x000000, "Member 'DispLib_EditorTestFXToolComp_EndPlayInCS::EndPlayReason' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostBeginCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPostBeginCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPostBeginCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPostBeginCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPostBeginCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostBeginCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPostBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostBeginCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPostBeginCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostTickCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPostTickCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPostTickCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPostTickCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPostTickCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostTickCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPostTickCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostTickCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPostTickCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreBeginCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPreBeginCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPreBeginCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPreBeginCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPreBeginCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreBeginCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPreBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreBeginCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPreBeginCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreTickCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreTickCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPreTickCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPreTickCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPreTickCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPreTickCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreTickCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPreTickCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreTickCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPreTickCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPostEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPostEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPostEndCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPostEndCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPostEndCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPostEndCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostEndCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPostEndCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPostEndCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPostEndCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSNotifyDebugPreEndCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSBase_GSNotifyDebugPreEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ReturnValue;                                       // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSNotifyDebugPreEndCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSNotifyDebugPreEndCS");
static_assert(sizeof(BANS_GSBase_GSNotifyDebugPreEndCS) == 0x000048, "Wrong size on BANS_GSBase_GSNotifyDebugPreEndCS");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreEndCS, NotifyParam) == 0x000000, "Member 'BANS_GSBase_GSNotifyDebugPreEndCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSBase_GSNotifyDebugPreEndCS, ReturnValue) == 0x000040, "Member 'BANS_GSBase_GSNotifyDebugPreEndCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BANS_GSBase_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BANS_GSBase_GetSoftReferences) == 0x000008, "Wrong alignment on BANS_GSBase_GetSoftReferences");
static_assert(sizeof(BANS_GSBase_GetSoftReferences) == 0x000010, "Wrong size on BANS_GSBase_GetSoftReferences");
static_assert(offsetof(BANS_GSBase_GetSoftReferences, ReturnValue) == 0x000000, "Member 'BANS_GSBase_GetSoftReferences::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSBase.GSValidateInputCS
// 0x0008 (0x0008 - 0x0000)
struct BANS_GSBase_GSValidateInputCS final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSBase_GSValidateInputCS) == 0x000008, "Wrong alignment on BANS_GSBase_GSValidateInputCS");
static_assert(sizeof(BANS_GSBase_GSValidateInputCS) == 0x000008, "Wrong size on BANS_GSBase_GSValidateInputCS");
static_assert(offsetof(BANS_GSBase_GSValidateInputCS, Actor) == 0x000000, "Member 'BANS_GSBase_GSValidateInputCS::Actor' has a wrong offset!");

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GetSoftReferences
// 0x0010 (0x0010 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GetSoftReferences final
{
public:
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BANS_GSTimedPlayNiagaraFX_GetSoftReferences) == 0x000008, "Wrong alignment on BANS_GSTimedPlayNiagaraFX_GetSoftReferences");
static_assert(sizeof(BANS_GSTimedPlayNiagaraFX_GetSoftReferences) == 0x000010, "Wrong size on BANS_GSTimedPlayNiagaraFX_GetSoftReferences");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_GetSoftReferences, ReturnValue) == 0x000000, "Member 'BANS_GSTimedPlayNiagaraFX_GetSoftReferences::ReturnValue' has a wrong offset!");

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GSNotifyBeginCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TotalDuration;                                     // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS) == 0x000008, "Wrong alignment on BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS");
static_assert(sizeof(BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS) == 0x000048, "Wrong size on BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS, NotifyParam) == 0x000000, "Member 'BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS, TotalDuration) == 0x000040, "Member 'BANS_GSTimedPlayNiagaraFX_GSNotifyBeginCS::TotalDuration' has a wrong offset!");

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX.GSNotifyEndCS
// 0x0040 (0x0040 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS) == 0x000008, "Wrong alignment on BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS");
static_assert(sizeof(BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS) == 0x000040, "Wrong size on BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS, NotifyParam) == 0x000000, "Member 'BANS_GSTimedPlayNiagaraFX_GSNotifyEndCS::NotifyParam' has a wrong offset!");

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX_WithCondition.GSNotifyBeginCS
// 0x0048 (0x0048 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TotalDuration;                                     // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS) == 0x000008, "Wrong alignment on BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS");
static_assert(sizeof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS) == 0x000048, "Wrong size on BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS, NotifyParam) == 0x000000, "Member 'BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS::NotifyParam' has a wrong offset!");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS, TotalDuration) == 0x000040, "Member 'BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyBeginCS::TotalDuration' has a wrong offset!");

// Function b1-Managed.BANS_GSTimedPlayNiagaraFX_WithCondition.GSNotifyEndCS
// 0x0040 (0x0040 - 0x0000)
struct BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS final
{
public:
	struct FUStGSNotifyParam                      NotifyParam;                                       // 0x0000(0x0040)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS) == 0x000008, "Wrong alignment on BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS");
static_assert(sizeof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS) == 0x000040, "Wrong size on BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS");
static_assert(offsetof(BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS, NotifyParam) == 0x000000, "Member 'BANS_GSTimedPlayNiagaraFX_WithCondition_GSNotifyEndCS::NotifyParam' has a wrong offset!");

// Function b1-Managed.DispLib_EditorTreeLODTools.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DispLib_EditorTreeLODTools_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DispLib_EditorTreeLODTools_ReceiveTick) == 0x000004, "Wrong alignment on DispLib_EditorTreeLODTools_ReceiveTick");
static_assert(sizeof(DispLib_EditorTreeLODTools_ReceiveTick) == 0x000004, "Wrong size on DispLib_EditorTreeLODTools_ReceiveTick");
static_assert(offsetof(DispLib_EditorTreeLODTools_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DispLib_EditorTreeLODTools_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function b1-Managed.DispLib_EditorTreeLODTools.SetAllTreeActorVisibility
// 0x0001 (0x0001 - 0x0000)
struct DispLib_EditorTreeLODTools_SetAllTreeActorVisibility final
{
public:
	uint8                                         Visibility : 1;                                    // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(DispLib_EditorTreeLODTools_SetAllTreeActorVisibility) == 0x000001, "Wrong alignment on DispLib_EditorTreeLODTools_SetAllTreeActorVisibility");
static_assert(sizeof(DispLib_EditorTreeLODTools_SetAllTreeActorVisibility) == 0x000001, "Wrong size on DispLib_EditorTreeLODTools_SetAllTreeActorVisibility");

// Function b1-Managed.BGUFuncLibInput.OpenAcceptNavigationAction
// 0x0001 (0x0001 - 0x0000)
struct BGUFuncLibInput_OpenAcceptNavigationAction final
{
public:
	uint8                                         bOpen : 1;                                         // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BGUFuncLibInput_OpenAcceptNavigationAction) == 0x000001, "Wrong alignment on BGUFuncLibInput_OpenAcceptNavigationAction");
static_assert(sizeof(BGUFuncLibInput_OpenAcceptNavigationAction) == 0x000001, "Wrong size on BGUFuncLibInput_OpenAcceptNavigationAction");

// Function b1-Managed.BGUFuncLibInput.SetSuperUserInputMode
// 0x0010 (0x0010 - 0x0000)
struct BGUFuncLibInput_SetSuperUserInputMode final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         IsOpen : 1;                                        // 0x0008(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
	EGSInputModeChangeReason                      ChangeReason;                                      // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGUFuncLibInput_SetSuperUserInputMode) == 0x000008, "Wrong alignment on BGUFuncLibInput_SetSuperUserInputMode");
static_assert(sizeof(BGUFuncLibInput_SetSuperUserInputMode) == 0x000010, "Wrong size on BGUFuncLibInput_SetSuperUserInputMode");
static_assert(offsetof(BGUFuncLibInput_SetSuperUserInputMode, WorldContext) == 0x000000, "Member 'BGUFuncLibInput_SetSuperUserInputMode::WorldContext' has a wrong offset!");
static_assert(offsetof(BGUFuncLibInput_SetSuperUserInputMode, ChangeReason) == 0x000009, "Member 'BGUFuncLibInput_SetSuperUserInputMode::ChangeReason' has a wrong offset!");

// Function b1-Managed.BGUFuncLibInput.IsGamepadType
// 0x0001 (0x0001 - 0x0000)
struct BGUFuncLibInput_IsGamepadType final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BGUFuncLibInput_IsGamepadType) == 0x000001, "Wrong alignment on BGUFuncLibInput_IsGamepadType");
static_assert(sizeof(BGUFuncLibInput_IsGamepadType) == 0x000001, "Wrong size on BGUFuncLibInput_IsGamepadType");

// Function b1-Managed.BED_CalliopeNodeBae.GetBranchGraphToEditInCS
// 0x0018 (0x0018 - 0x0000)
struct BED_CalliopeNodeBae_GetBranchGraphToEditInCS final
{
public:
	class FString                                 OutBranchGraphIdentifier;                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_CalliopeNodeBae_GetBranchGraphToEditInCS) == 0x000008, "Wrong alignment on BED_CalliopeNodeBae_GetBranchGraphToEditInCS");
static_assert(sizeof(BED_CalliopeNodeBae_GetBranchGraphToEditInCS) == 0x000018, "Wrong size on BED_CalliopeNodeBae_GetBranchGraphToEditInCS");
static_assert(offsetof(BED_CalliopeNodeBae_GetBranchGraphToEditInCS, OutBranchGraphIdentifier) == 0x000000, "Member 'BED_CalliopeNodeBae_GetBranchGraphToEditInCS::OutBranchGraphIdentifier' has a wrong offset!");

// Function b1-Managed.BED_CalliopeNodeBae.IsBranchGraphNode
// 0x0001 (0x0001 - 0x0000)
struct BED_CalliopeNodeBae_IsBranchGraphNode final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_CalliopeNodeBae_IsBranchGraphNode) == 0x000001, "Wrong alignment on BED_CalliopeNodeBae_IsBranchGraphNode");
static_assert(sizeof(BED_CalliopeNodeBae_IsBranchGraphNode) == 0x000001, "Wrong size on BED_CalliopeNodeBae_IsBranchGraphNode");

// Function b1-Managed.BED_CalliopeNodeBae.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_CalliopeNodeBae_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_CalliopeNodeBae_IsSupportViewType) == 0x000001, "Wrong alignment on BED_CalliopeNodeBae_IsSupportViewType");
static_assert(sizeof(BED_CalliopeNodeBae_IsSupportViewType) == 0x000002, "Wrong size on BED_CalliopeNodeBae_IsSupportViewType");
static_assert(offsetof(BED_CalliopeNodeBae_IsSupportViewType, InViewType) == 0x000000, "Member 'BED_CalliopeNodeBae_IsSupportViewType::InViewType' has a wrong offset!");

// Function b1-Managed.BED_CalliopeNodeBae.GetGuid
// 0x0010 (0x0010 - 0x0000)
struct BED_CalliopeNodeBae_GetGuid final
{
public:
	struct FCalliopeGuid                          ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BED_CalliopeNodeBae_GetGuid) == 0x000004, "Wrong alignment on BED_CalliopeNodeBae_GetGuid");
static_assert(sizeof(BED_CalliopeNodeBae_GetGuid) == 0x000010, "Wrong size on BED_CalliopeNodeBae_GetGuid");
static_assert(offsetof(BED_CalliopeNodeBae_GetGuid, ReturnValue) == 0x000000, "Member 'BED_CalliopeNodeBae_GetGuid::ReturnValue' has a wrong offset!");

// Function b1-Managed.BED_CalliopeNodeBae.GetActorGuidOptions
// 0x0028 (0x0028 - 0x0000)
struct BED_CalliopeNodeBae_GetActorGuidOptions final
{
public:
	class FString                                 PropertyName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FActorGuidOption>               OutOptions;                                        // 0x0010(0x0010)(Parm, OutParm)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BED_CalliopeNodeBae_GetActorGuidOptions) == 0x000008, "Wrong alignment on BED_CalliopeNodeBae_GetActorGuidOptions");
static_assert(sizeof(BED_CalliopeNodeBae_GetActorGuidOptions) == 0x000028, "Wrong size on BED_CalliopeNodeBae_GetActorGuidOptions");
static_assert(offsetof(BED_CalliopeNodeBae_GetActorGuidOptions, PropertyName) == 0x000000, "Member 'BED_CalliopeNodeBae_GetActorGuidOptions::PropertyName' has a wrong offset!");
static_assert(offsetof(BED_CalliopeNodeBae_GetActorGuidOptions, OutOptions) == 0x000010, "Member 'BED_CalliopeNodeBae_GetActorGuidOptions::OutOptions' has a wrong offset!");
static_assert(offsetof(BED_CalliopeNodeBae_GetActorGuidOptions, ReturnValue) == 0x000020, "Member 'BED_CalliopeNodeBae_GetActorGuidOptions::ReturnValue' has a wrong offset!");

// Function b1-Managed.BED_CalliopeNodeBae.CanManageStates
// 0x0001 (0x0001 - 0x0000)
struct BED_CalliopeNodeBae_CanManageStates final
{
public:
	uint8                                         ReturnValue : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_CalliopeNodeBae_CanManageStates) == 0x000001, "Wrong alignment on BED_CalliopeNodeBae_CanManageStates");
static_assert(sizeof(BED_CalliopeNodeBae_CanManageStates) == 0x000001, "Wrong size on BED_CalliopeNodeBae_CanManageStates");

// Function b1-Managed.BED_CalliopeNodeBae.GetActorGuid
// 0x0020 (0x0020 - 0x0000)
struct BED_CalliopeNodeBae_GetActorGuid final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OutActorGuid;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_CalliopeNodeBae_GetActorGuid) == 0x000008, "Wrong alignment on BED_CalliopeNodeBae_GetActorGuid");
static_assert(sizeof(BED_CalliopeNodeBae_GetActorGuid) == 0x000020, "Wrong size on BED_CalliopeNodeBae_GetActorGuid");
static_assert(offsetof(BED_CalliopeNodeBae_GetActorGuid, InActor) == 0x000000, "Member 'BED_CalliopeNodeBae_GetActorGuid::InActor' has a wrong offset!");
static_assert(offsetof(BED_CalliopeNodeBae_GetActorGuid, OutActorGuid) == 0x000008, "Member 'BED_CalliopeNodeBae_GetActorGuid::OutActorGuid' has a wrong offset!");

// Function b1-Managed.BED_MovieNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_MovieNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_MovieNode_IsSupportViewType) == 0x000001, "Wrong alignment on BED_MovieNode_IsSupportViewType");
static_assert(sizeof(BED_MovieNode_IsSupportViewType) == 0x000002, "Wrong size on BED_MovieNode_IsSupportViewType");
static_assert(offsetof(BED_MovieNode_IsSupportViewType, InViewType) == 0x000000, "Member 'BED_MovieNode_IsSupportViewType::InViewType' has a wrong offset!");

// Function b1-Managed.BED_MovieNode_PreRoll.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_MovieNode_PreRoll_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BED_MovieNode_PreRoll_GetNodeDescriptionInCS) == 0x000008, "Wrong alignment on BED_MovieNode_PreRoll_GetNodeDescriptionInCS");
static_assert(sizeof(BED_MovieNode_PreRoll_GetNodeDescriptionInCS) == 0x000010, "Wrong size on BED_MovieNode_PreRoll_GetNodeDescriptionInCS");
static_assert(offsetof(BED_MovieNode_PreRoll_GetNodeDescriptionInCS, ReturnValue) == 0x000000, "Member 'BED_MovieNode_PreRoll_GetNodeDescriptionInCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.QuestOverlapCompFunctionBinder.OnCollisionBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         bFromSweep : 1;                                    // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap) == 0x000008, "Wrong alignment on QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap");
static_assert(sizeof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap) == 0x000108, "Wrong size on QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap, OverlappedComponent) == 0x000000, "Member 'QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap, OtherActor) == 0x000008, "Member 'QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap, OtherComp) == 0x000010, "Member 'QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap, OtherBodyIndex) == 0x000018, "Member 'QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap, SweepResult) == 0x000020, "Member 'QuestOverlapCompFunctionBinder_OnCollisionBeginOverlap::SweepResult' has a wrong offset!");

// Function b1-Managed.QuestOverlapCompFunctionBinder.OnCollisionEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct QuestOverlapCompFunctionBinder_OnCollisionEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(ExportObject, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap) == 0x000008, "Wrong alignment on QuestOverlapCompFunctionBinder_OnCollisionEndOverlap");
static_assert(sizeof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap) == 0x000020, "Wrong size on QuestOverlapCompFunctionBinder_OnCollisionEndOverlap");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap, OverlappedComponent) == 0x000000, "Member 'QuestOverlapCompFunctionBinder_OnCollisionEndOverlap::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap, OtherActor) == 0x000008, "Member 'QuestOverlapCompFunctionBinder_OnCollisionEndOverlap::OtherActor' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap, OtherComp) == 0x000010, "Member 'QuestOverlapCompFunctionBinder_OnCollisionEndOverlap::OtherComp' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnCollisionEndOverlap, OtherBodyIndex) == 0x000018, "Member 'QuestOverlapCompFunctionBinder_OnCollisionEndOverlap::OtherBodyIndex' has a wrong offset!");

// Function b1-Managed.QuestOverlapCompFunctionBinder.OnActorLeave
// 0x0010 (0x0010 - 0x0000)
struct QuestOverlapCompFunctionBinder_OnActorLeave final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestOverlapCompFunctionBinder_OnActorLeave) == 0x000008, "Wrong alignment on QuestOverlapCompFunctionBinder_OnActorLeave");
static_assert(sizeof(QuestOverlapCompFunctionBinder_OnActorLeave) == 0x000010, "Wrong size on QuestOverlapCompFunctionBinder_OnActorLeave");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnActorLeave, OverlappedActor) == 0x000000, "Member 'QuestOverlapCompFunctionBinder_OnActorLeave::OverlappedActor' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnActorLeave, OtherActor) == 0x000008, "Member 'QuestOverlapCompFunctionBinder_OnActorLeave::OtherActor' has a wrong offset!");

// Function b1-Managed.QuestOverlapCompFunctionBinder.OnActorEnter
// 0x0010 (0x0010 - 0x0000)
struct QuestOverlapCompFunctionBinder_OnActorEnter final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestOverlapCompFunctionBinder_OnActorEnter) == 0x000008, "Wrong alignment on QuestOverlapCompFunctionBinder_OnActorEnter");
static_assert(sizeof(QuestOverlapCompFunctionBinder_OnActorEnter) == 0x000010, "Wrong size on QuestOverlapCompFunctionBinder_OnActorEnter");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnActorEnter, OverlappedActor) == 0x000000, "Member 'QuestOverlapCompFunctionBinder_OnActorEnter::OverlappedActor' has a wrong offset!");
static_assert(offsetof(QuestOverlapCompFunctionBinder_OnActorEnter, OtherActor) == 0x000008, "Member 'QuestOverlapCompFunctionBinder_OnActorEnter::OtherActor' has a wrong offset!");

// Function b1-Managed.BGUSimpleActorBaseCS.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BGUSimpleActorBaseCS_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGUSimpleActorBaseCS_ReceiveEndPlay) == 0x000001, "Wrong alignment on BGUSimpleActorBaseCS_ReceiveEndPlay");
static_assert(sizeof(BGUSimpleActorBaseCS_ReceiveEndPlay) == 0x000001, "Wrong size on BGUSimpleActorBaseCS_ReceiveEndPlay");
static_assert(offsetof(BGUSimpleActorBaseCS_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BGUSimpleActorBaseCS_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function b1-Managed.BGUActorBaseCS.OnConstructionCS
// 0x0060 (0x0060 - 0x0000)
struct BGUActorBaseCS_OnConstructionCS final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGUActorBaseCS_OnConstructionCS) == 0x000010, "Wrong alignment on BGUActorBaseCS_OnConstructionCS");
static_assert(sizeof(BGUActorBaseCS_OnConstructionCS) == 0x000060, "Wrong size on BGUActorBaseCS_OnConstructionCS");
static_assert(offsetof(BGUActorBaseCS_OnConstructionCS, Transform) == 0x000000, "Member 'BGUActorBaseCS_OnConstructionCS::Transform' has a wrong offset!");

// Function b1-Managed.BGUActorBaseCS.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BGUActorBaseCS_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGUActorBaseCS_ReceiveEndPlay) == 0x000001, "Wrong alignment on BGUActorBaseCS_ReceiveEndPlay");
static_assert(sizeof(BGUActorBaseCS_ReceiveEndPlay) == 0x000001, "Wrong size on BGUActorBaseCS_ReceiveEndPlay");
static_assert(offsetof(BGUActorBaseCS_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BGUActorBaseCS_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function b1-Managed.BGUActorBaseCS.GetActorGuidCS
// 0x0018 (0x0018 - 0x0000)
struct BGUActorBaseCS_GetActorGuidCS final
{
public:
	class FString                                 OutActorGuid;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0010(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BGUActorBaseCS_GetActorGuidCS) == 0x000008, "Wrong alignment on BGUActorBaseCS_GetActorGuidCS");
static_assert(sizeof(BGUActorBaseCS_GetActorGuidCS) == 0x000018, "Wrong size on BGUActorBaseCS_GetActorGuidCS");
static_assert(offsetof(BGUActorBaseCS_GetActorGuidCS, OutActorGuid) == 0x000000, "Member 'BGUActorBaseCS_GetActorGuidCS::OutActorGuid' has a wrong offset!");

// Function b1-Managed.BGUProceduralSpawnCharacterBase.OnConstructionCS
// 0x0060 (0x0060 - 0x0000)
struct BGUProceduralSpawnCharacterBase_OnConstructionCS final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGUProceduralSpawnCharacterBase_OnConstructionCS) == 0x000010, "Wrong alignment on BGUProceduralSpawnCharacterBase_OnConstructionCS");
static_assert(sizeof(BGUProceduralSpawnCharacterBase_OnConstructionCS) == 0x000060, "Wrong size on BGUProceduralSpawnCharacterBase_OnConstructionCS");
static_assert(offsetof(BGUProceduralSpawnCharacterBase_OnConstructionCS, Transform) == 0x000000, "Member 'BGUProceduralSpawnCharacterBase_OnConstructionCS::Transform' has a wrong offset!");

// Function b1-Managed.BGUInteractiveActorBase.OnConstructionCS
// 0x0060 (0x0060 - 0x0000)
struct BGUInteractiveActorBase_OnConstructionCS final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGUInteractiveActorBase_OnConstructionCS) == 0x000010, "Wrong alignment on BGUInteractiveActorBase_OnConstructionCS");
static_assert(sizeof(BGUInteractiveActorBase_OnConstructionCS) == 0x000060, "Wrong size on BGUInteractiveActorBase_OnConstructionCS");
static_assert(offsetof(BGUInteractiveActorBase_OnConstructionCS, Transform) == 0x000000, "Member 'BGUInteractiveActorBase_OnConstructionCS::Transform' has a wrong offset!");

// Function b1-Managed.BGUInteractiveActorBase.OnDestroyDestructible
// 0x0038 (0x0038 - 0x0000)
struct BGUInteractiveActorBase_OnDestroyDestructible final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseDir;                                        // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGUInteractiveActorBase_OnDestroyDestructible) == 0x000008, "Wrong alignment on BGUInteractiveActorBase_OnDestroyDestructible");
static_assert(sizeof(BGUInteractiveActorBase_OnDestroyDestructible) == 0x000038, "Wrong size on BGUInteractiveActorBase_OnDestroyDestructible");
static_assert(offsetof(BGUInteractiveActorBase_OnDestroyDestructible, HitLocation) == 0x000000, "Member 'BGUInteractiveActorBase_OnDestroyDestructible::HitLocation' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnDestroyDestructible, ImpulseDir) == 0x000018, "Member 'BGUInteractiveActorBase_OnDestroyDestructible::ImpulseDir' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnDestroyDestructible, ImpulseStrength) == 0x000030, "Member 'BGUInteractiveActorBase_OnDestroyDestructible::ImpulseStrength' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnDestroyDestructible, Damage) == 0x000034, "Member 'BGUInteractiveActorBase_OnDestroyDestructible::Damage' has a wrong offset!");

// Function b1-Managed.BGUInteractiveActorBase.OnResetDestructible
// 0x0001 (0x0001 - 0x0000)
struct BGUInteractiveActorBase_OnResetDestructible final
{
public:
	uint8                                         IsDestroyed : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BGUInteractiveActorBase_OnResetDestructible) == 0x000001, "Wrong alignment on BGUInteractiveActorBase_OnResetDestructible");
static_assert(sizeof(BGUInteractiveActorBase_OnResetDestructible) == 0x000001, "Wrong size on BGUInteractiveActorBase_OnResetDestructible");

// Function b1-Managed.BGUInteractiveActorBase.OnHitDestructible
// 0x0038 (0x0038 - 0x0000)
struct BGUInteractiveActorBase_OnHitDestructible final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseDir;                                        // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ImpulseStrength;                                   // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BGUInteractiveActorBase_OnHitDestructible) == 0x000008, "Wrong alignment on BGUInteractiveActorBase_OnHitDestructible");
static_assert(sizeof(BGUInteractiveActorBase_OnHitDestructible) == 0x000038, "Wrong size on BGUInteractiveActorBase_OnHitDestructible");
static_assert(offsetof(BGUInteractiveActorBase_OnHitDestructible, HitLocation) == 0x000000, "Member 'BGUInteractiveActorBase_OnHitDestructible::HitLocation' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnHitDestructible, ImpulseDir) == 0x000018, "Member 'BGUInteractiveActorBase_OnHitDestructible::ImpulseDir' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnHitDestructible, ImpulseStrength) == 0x000030, "Member 'BGUInteractiveActorBase_OnHitDestructible::ImpulseStrength' has a wrong offset!");
static_assert(offsetof(BGUInteractiveActorBase_OnHitDestructible, Damage) == 0x000034, "Member 'BGUInteractiveActorBase_OnHitDestructible::Damage' has a wrong offset!");

// Function b1-Managed.BGUTriggerObjBase.OnConstructionCS
// 0x0060 (0x0060 - 0x0000)
struct BGUTriggerObjBase_OnConstructionCS final
{
public:
	struct FTransform                             Transform;                                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BGUTriggerObjBase_OnConstructionCS) == 0x000010, "Wrong alignment on BGUTriggerObjBase_OnConstructionCS");
static_assert(sizeof(BGUTriggerObjBase_OnConstructionCS) == 0x000060, "Wrong size on BGUTriggerObjBase_OnConstructionCS");
static_assert(offsetof(BGUTriggerObjBase_OnConstructionCS, Transform) == 0x000000, "Member 'BGUTriggerObjBase_OnConstructionCS::Transform' has a wrong offset!");

// Function b1-Managed.HelloUFromUSharp.CallMe
// 0x0010 (0x0010 - 0x0000)
struct HelloUFromUSharp_CallMe final
{
public:
	class FString                                 Arg1;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(HelloUFromUSharp_CallMe) == 0x000008, "Wrong alignment on HelloUFromUSharp_CallMe");
static_assert(sizeof(HelloUFromUSharp_CallMe) == 0x000010, "Wrong size on HelloUFromUSharp_CallMe");
static_assert(offsetof(HelloUFromUSharp_CallMe, Arg1) == 0x000000, "Member 'HelloUFromUSharp_CallMe::Arg1' has a wrong offset!");

// Function b1-Managed.Bezier_MovementComponentInCS.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Bezier_MovementComponentInCS_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bezier_MovementComponentInCS_ReceiveTick) == 0x000004, "Wrong alignment on Bezier_MovementComponentInCS_ReceiveTick");
static_assert(sizeof(Bezier_MovementComponentInCS_ReceiveTick) == 0x000004, "Wrong size on Bezier_MovementComponentInCS_ReceiveTick");
static_assert(offsetof(Bezier_MovementComponentInCS_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Bezier_MovementComponentInCS_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function b1-Managed.Bezier_MovementComponentInCS.InitMovementParam
// 0x0060 (0x0060 - 0x0000)
struct Bezier_MovementComponentInCS_InitMovementParam final
{
public:
	float                                         _RotateSpeed;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _FlySpeed;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _DestroyTime;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MaxFlySpeed;                                      // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _BezierPathPointNum;                               // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _BezierMoveWeight;                                 // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _AccelerationTime;                                 // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _ApproachDis;                                      // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         _EnableDrawDebugPoint : 1;                         // 0x0020(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, NoDestructor, HasGetValueTypeHash))
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            _SpeedCurve;                                       // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _ControlAdditionPoint1;                            // 0x0030(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _ControlAdditionPoint2;                            // 0x0048(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Bezier_MovementComponentInCS_InitMovementParam) == 0x000008, "Wrong alignment on Bezier_MovementComponentInCS_InitMovementParam");
static_assert(sizeof(Bezier_MovementComponentInCS_InitMovementParam) == 0x000060, "Wrong size on Bezier_MovementComponentInCS_InitMovementParam");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _RotateSpeed) == 0x000000, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_RotateSpeed' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _FlySpeed) == 0x000004, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_FlySpeed' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _DestroyTime) == 0x000008, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_DestroyTime' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _MaxFlySpeed) == 0x00000C, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_MaxFlySpeed' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _BezierPathPointNum) == 0x000010, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_BezierPathPointNum' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _BezierMoveWeight) == 0x000014, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_BezierMoveWeight' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _AccelerationTime) == 0x000018, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_AccelerationTime' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _ApproachDis) == 0x00001C, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_ApproachDis' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _SpeedCurve) == 0x000028, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_SpeedCurve' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _ControlAdditionPoint1) == 0x000030, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_ControlAdditionPoint1' has a wrong offset!");
static_assert(offsetof(Bezier_MovementComponentInCS_InitMovementParam, _ControlAdditionPoint2) == 0x000048, "Member 'Bezier_MovementComponentInCS_InitMovementParam::_ControlAdditionPoint2' has a wrong offset!");

// Function b1-Managed.OldMKSpawnTest.SpawnActorCS
// 0x0010 (0x0010 - 0x0000)
struct OldMKSpawnTest_SpawnActorCS final
{
public:
	class UClass*                                 ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OldMKSpawnTest_SpawnActorCS) == 0x000008, "Wrong alignment on OldMKSpawnTest_SpawnActorCS");
static_assert(sizeof(OldMKSpawnTest_SpawnActorCS) == 0x000010, "Wrong size on OldMKSpawnTest_SpawnActorCS");
static_assert(offsetof(OldMKSpawnTest_SpawnActorCS, ActorClass) == 0x000000, "Member 'OldMKSpawnTest_SpawnActorCS::ActorClass' has a wrong offset!");
static_assert(offsetof(OldMKSpawnTest_SpawnActorCS, ReturnValue) == 0x000008, "Member 'OldMKSpawnTest_SpawnActorCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BED_FSMNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_FSMNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_FSMNode_IsSupportViewType) == 0x000001, "Wrong alignment on BED_FSMNode_IsSupportViewType");
static_assert(sizeof(BED_FSMNode_IsSupportViewType) == 0x000002, "Wrong size on BED_FSMNode_IsSupportViewType");
static_assert(offsetof(BED_FSMNode_IsSupportViewType, InViewType) == 0x000000, "Member 'BED_FSMNode_IsSupportViewType::InViewType' has a wrong offset!");

// Function b1-Managed.BED_FSMNode_GI_Loading_LoadChapterViewLevel.PostPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged) == 0x000008, "Wrong alignment on BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged");
static_assert(sizeof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged) == 0x000020, "Wrong size on BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged");
static_assert(offsetof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged, MemberName) == 0x000000, "Member 'BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged::MemberName' has a wrong offset!");
static_assert(offsetof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged, PropertyName) == 0x000010, "Member 'BED_FSMNode_GI_Loading_LoadChapterViewLevel_PostPropertyChanged::PropertyName' has a wrong offset!");

// Function b1-Managed.BED_FSMNode_GI_Loading_LoadChapterViewLevel.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS) == 0x000008, "Wrong alignment on BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS");
static_assert(sizeof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS) == 0x000010, "Wrong size on BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS");
static_assert(offsetof(BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS, ReturnValue) == 0x000000, "Member 'BED_FSMNode_GI_Loading_LoadChapterViewLevel_GetNodeDescriptionInCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.BED_BehaviorNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_BehaviorNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_BehaviorNode_IsSupportViewType) == 0x000001, "Wrong alignment on BED_BehaviorNode_IsSupportViewType");
static_assert(sizeof(BED_BehaviorNode_IsSupportViewType) == 0x000002, "Wrong size on BED_BehaviorNode_IsSupportViewType");
static_assert(offsetof(BED_BehaviorNode_IsSupportViewType, InViewType) == 0x000000, "Member 'BED_BehaviorNode_IsSupportViewType::InViewType' has a wrong offset!");

// Function b1-Managed.BED_BehaviorNode_ExitPhasePerformance.GetNodeDescriptionInCS
// 0x0010 (0x0010 - 0x0000)
struct BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS) == 0x000008, "Wrong alignment on BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS");
static_assert(sizeof(BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS) == 0x000010, "Wrong size on BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS");
static_assert(offsetof(BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS, ReturnValue) == 0x000000, "Member 'BED_BehaviorNode_ExitPhasePerformance_GetNodeDescriptionInCS::ReturnValue' has a wrong offset!");

// Function b1-Managed.GSDispLib_PostProcessDebugger.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GSDispLib_PostProcessDebugger_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSDispLib_PostProcessDebugger_ReceiveTick) == 0x000004, "Wrong alignment on GSDispLib_PostProcessDebugger_ReceiveTick");
static_assert(sizeof(GSDispLib_PostProcessDebugger_ReceiveTick) == 0x000004, "Wrong size on GSDispLib_PostProcessDebugger_ReceiveTick");
static_assert(offsetof(GSDispLib_PostProcessDebugger_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GSDispLib_PostProcessDebugger_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function b1-Managed.BED_QuestNode.IsSupportViewType
// 0x0002 (0x0002 - 0x0000)
struct BED_QuestNode_IsSupportViewType final
{
public:
	ECalliopeViewType                             InViewType;                                        // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         ReturnValue : 1;                                   // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash))
};
static_assert(alignof(BED_QuestNode_IsSupportViewType) == 0x000001, "Wrong alignment on BED_QuestNode_IsSupportViewType");
