#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AgeTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_AgeTips.BI_AgeTips_C
// 0x0020 (0x04D8 - 0x04B8)
class UBI_AgeTips_C final : public UBUI_Button
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GSAnimPressed;                                     // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStateAnim;                                    // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_AgeTips(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_AgeTips_C">();
	}
	static class UBI_AgeTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_AgeTips_C>();
	}
};
static_assert(alignof(UBI_AgeTips_C) == 0x000008, "Wrong alignment on UBI_AgeTips_C");
static_assert(sizeof(UBI_AgeTips_C) == 0x0004D8, "Wrong size on UBI_AgeTips_C");
static_assert(offsetof(UBI_AgeTips_C, UberGraphFrame) == 0x0004B8, "Member 'UBI_AgeTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_AgeTips_C, GSAnimPressed) == 0x0004C0, "Member 'UBI_AgeTips_C::GSAnimPressed' has a wrong offset!");
static_assert(offsetof(UBI_AgeTips_C, GSAKBStateAnim) == 0x0004C8, "Member 'UBI_AgeTips_C::GSAKBStateAnim' has a wrong offset!");
static_assert(offsetof(UBI_AgeTips_C, InputIcon) == 0x0004D0, "Member 'UBI_AgeTips_C::InputIcon' has a wrong offset!");

}

