#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AttrBase_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_AttrBase_V2.BI_AttrBase_V2_C
// 0x0028 (0x0400 - 0x03D8)
class UBI_AttrBase_V2_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GSAKBTxtColor;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimNumChange;                                     // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgIcon;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtAttrChange;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_AttrBase_V2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent_0(const class FString& EventName);
	void SequenceEvent__ENTRYPOINTBI_AttrBase_V2_0();
	void SequenceEvent__ENTRYPOINTBI_AttrBase_V2_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_AttrBase_V2_C">();
	}
	static class UBI_AttrBase_V2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_AttrBase_V2_C>();
	}
};
static_assert(alignof(UBI_AttrBase_V2_C) == 0x000008, "Wrong alignment on UBI_AttrBase_V2_C");
static_assert(sizeof(UBI_AttrBase_V2_C) == 0x000400, "Wrong size on UBI_AttrBase_V2_C");
static_assert(offsetof(UBI_AttrBase_V2_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_AttrBase_V2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_AttrBase_V2_C, GSAKBTxtColor) == 0x0003E0, "Member 'UBI_AttrBase_V2_C::GSAKBTxtColor' has a wrong offset!");
static_assert(offsetof(UBI_AttrBase_V2_C, AnimNumChange) == 0x0003E8, "Member 'UBI_AttrBase_V2_C::AnimNumChange' has a wrong offset!");
static_assert(offsetof(UBI_AttrBase_V2_C, ImgIcon) == 0x0003F0, "Member 'UBI_AttrBase_V2_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UBI_AttrBase_V2_C, TxtAttrChange) == 0x0003F8, "Member 'UBI_AttrBase_V2_C::TxtAttrChange' has a wrong offset!");

}

