#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_CommTxtTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_CommTxtTab.BI_CommTxtTab_C
// 0x00A8 (0x0560 - 0x04B8)
class UBI_CommTxtTab_C final : public UBUI_Button
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GSAKBStateAnim_1;                                  // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStateAnim_0;                                  // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBActionBlock;                                  // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimLockActived;                                 // 0x04E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimLockFocused;                                 // 0x04E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimLockHovered;                                 // 0x04F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimLockNormal;                                  // 0x04F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimDisable;                                     // 0x0500(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimActived;                                     // 0x0508(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimFocused;                                     // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimHovered;                                     // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimNormal;                                      // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAnimPressed;                                     // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStateAnim;                                    // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGSImage*                               ImgIcon;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLocked;                                         // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgRedPoint;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResizeWidget;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_CommTxtTab(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_CommTxtTab_C">();
	}
	static class UBI_CommTxtTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_CommTxtTab_C>();
	}
};
static_assert(alignof(UBI_CommTxtTab_C) == 0x000008, "Wrong alignment on UBI_CommTxtTab_C");
static_assert(sizeof(UBI_CommTxtTab_C) == 0x000560, "Wrong size on UBI_CommTxtTab_C");
static_assert(offsetof(UBI_CommTxtTab_C, UberGraphFrame) == 0x0004B8, "Member 'UBI_CommTxtTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAKBStateAnim_1) == 0x0004C0, "Member 'UBI_CommTxtTab_C::GSAKBStateAnim_1' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAKBStateAnim_0) == 0x0004C8, "Member 'UBI_CommTxtTab_C::GSAKBStateAnim_0' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAKBActionBlock) == 0x0004D0, "Member 'UBI_CommTxtTab_C::GSAKBActionBlock' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0004D8, "Member 'UBI_CommTxtTab_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimLockActived) == 0x0004E0, "Member 'UBI_CommTxtTab_C::GSAnimLockActived' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimLockFocused) == 0x0004E8, "Member 'UBI_CommTxtTab_C::GSAnimLockFocused' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimLockHovered) == 0x0004F0, "Member 'UBI_CommTxtTab_C::GSAnimLockHovered' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimLockNormal) == 0x0004F8, "Member 'UBI_CommTxtTab_C::GSAnimLockNormal' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimDisable) == 0x000500, "Member 'UBI_CommTxtTab_C::GSAnimDisable' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimActived) == 0x000508, "Member 'UBI_CommTxtTab_C::GSAnimActived' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimFocused) == 0x000510, "Member 'UBI_CommTxtTab_C::GSAnimFocused' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimHovered) == 0x000518, "Member 'UBI_CommTxtTab_C::GSAnimHovered' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimNormal) == 0x000520, "Member 'UBI_CommTxtTab_C::GSAnimNormal' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000528, "Member 'UBI_CommTxtTab_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAnimPressed) == 0x000530, "Member 'UBI_CommTxtTab_C::GSAnimPressed' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, GSAKBStateAnim) == 0x000538, "Member 'UBI_CommTxtTab_C::GSAKBStateAnim' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, ImgIcon) == 0x000540, "Member 'UBI_CommTxtTab_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, ImgLocked) == 0x000548, "Member 'UBI_CommTxtTab_C::ImgLocked' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, ImgRedPoint) == 0x000550, "Member 'UBI_CommTxtTab_C::ImgRedPoint' has a wrong offset!");
static_assert(offsetof(UBI_CommTxtTab_C, ResizeWidget) == 0x000558, "Member 'UBI_CommTxtTab_C::ResizeWidget' has a wrong offset!");

}

