#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ComplexSecRoleAttr

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_ComplexSecRoleAttr.BI_ComplexSecRoleAttr_C
// 0x0038 (0x0410 - 0x03D8)
class UBI_ComplexSecRoleAttr_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AttrStateChange;                                   // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBStateForge;                                     // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_ArrowRoleAttr_C*                    Arrow;                                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               ImgArrow;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBar;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgMarker;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BI_ComplexSecRoleAttr(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_ComplexSecRoleAttr_C">();
	}
	static class UBI_ComplexSecRoleAttr_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_ComplexSecRoleAttr_C>();
	}
};
static_assert(alignof(UBI_ComplexSecRoleAttr_C) == 0x000008, "Wrong alignment on UBI_ComplexSecRoleAttr_C");
static_assert(sizeof(UBI_ComplexSecRoleAttr_C) == 0x000410, "Wrong size on UBI_ComplexSecRoleAttr_C");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_ComplexSecRoleAttr_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, AttrStateChange) == 0x0003E0, "Member 'UBI_ComplexSecRoleAttr_C::AttrStateChange' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, AKBStateForge) == 0x0003E8, "Member 'UBI_ComplexSecRoleAttr_C::AKBStateForge' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, Arrow) == 0x0003F0, "Member 'UBI_ComplexSecRoleAttr_C::Arrow' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, ImgArrow) == 0x0003F8, "Member 'UBI_ComplexSecRoleAttr_C::ImgArrow' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, ImgBar) == 0x000400, "Member 'UBI_ComplexSecRoleAttr_C::ImgBar' has a wrong offset!");
static_assert(offsetof(UBI_ComplexSecRoleAttr_C, ImgMarker) == 0x000408, "Member 'UBI_ComplexSecRoleAttr_C::ImgMarker' has a wrong offset!");

}

