#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_CommTxtTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_CommTxtTab.BI_CommTxtTab_C.ExecuteUbergraph_BI_CommTxtTab
// 0x0008 (0x0008 - 0x0000)
struct BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab) == 0x000004, "Wrong alignment on BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab");
static_assert(sizeof(BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab) == 0x000008, "Wrong size on BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab");
static_assert(offsetof(BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab, EntryPoint) == 0x000000, "Member 'BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BI_CommTxtTab_C_ExecuteUbergraph_BI_CommTxtTab::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BI_CommTxtTab.BI_CommTxtTab_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_CommTxtTab_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_CommTxtTab_C_PreConstruct) == 0x000001, "Wrong alignment on BI_CommTxtTab_C_PreConstruct");
static_assert(sizeof(BI_CommTxtTab_C_PreConstruct) == 0x000001, "Wrong size on BI_CommTxtTab_C_PreConstruct");
static_assert(offsetof(BI_CommTxtTab_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BI_CommTxtTab_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

