#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_DetailLongPress

#include "Basic.hpp"

#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_DetailLongPress.BI_DetailLongPress_C
// 0x0020 (0x0558 - 0x0538)
class UBI_DetailLongPress_C final : public UBUI_ButtonLongPressV2
{
public:
	class UWidgetAnimation*                       GSAnimPressed;                                     // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStateAnim;                                    // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgBgA;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_DetailLongPress_C">();
	}
	static class UBI_DetailLongPress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_DetailLongPress_C>();
	}
};
static_assert(alignof(UBI_DetailLongPress_C) == 0x000008, "Wrong alignment on UBI_DetailLongPress_C");
static_assert(sizeof(UBI_DetailLongPress_C) == 0x000558, "Wrong size on UBI_DetailLongPress_C");
static_assert(offsetof(UBI_DetailLongPress_C, GSAnimPressed) == 0x000538, "Member 'UBI_DetailLongPress_C::GSAnimPressed' has a wrong offset!");
static_assert(offsetof(UBI_DetailLongPress_C, GSAKBStateAnim) == 0x000540, "Member 'UBI_DetailLongPress_C::GSAKBStateAnim' has a wrong offset!");
static_assert(offsetof(UBI_DetailLongPress_C, ImgBgA) == 0x000548, "Member 'UBI_DetailLongPress_C::ImgBgA' has a wrong offset!");
static_assert(offsetof(UBI_DetailLongPress_C, InputIcon) == 0x000550, "Member 'UBI_DetailLongPress_C::InputIcon' has a wrong offset!");

}

