#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_DetailPageSwitcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_DetailPageSwitcher.BI_DetailPageSwitcher_C
// 0x00A8 (0x0480 - 0x03D8)
class UBI_DetailPageSwitcher_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimForged_0;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimForged;                                        // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBPageSwitch;                                     // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_0;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_1;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_2;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_3;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_4;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 None1_5;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_1;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_2;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_3;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_4;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_5;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_6;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_7;                                            // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Page_8;                                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_ForgingLight;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_BI_DetailPageSwitcher(int32 EntryPoint);
	void FXTest();
	void NGForgeSpark_Top_Event_0(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void NGForgeSpark_Top_Event_1(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void PreConstruct(bool IsDesignTime);
	void SequenceEvent__ENTRYPOINTBI_DetailPageSwitcher_0(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_DetailPageSwitcher_1(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_DetailPageSwitcher_2(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_DetailPageSwitcher_3(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_DetailPageSwitcher_4(class UNiagaraSystemWidget* NGForgeSpark_Top);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_DetailPageSwitcher_C">();
	}
	static class UBI_DetailPageSwitcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_DetailPageSwitcher_C>();
	}
};
static_assert(alignof(UBI_DetailPageSwitcher_C) == 0x000008, "Wrong alignment on UBI_DetailPageSwitcher_C");
static_assert(sizeof(UBI_DetailPageSwitcher_C) == 0x000480, "Wrong size on UBI_DetailPageSwitcher_C");
static_assert(offsetof(UBI_DetailPageSwitcher_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_DetailPageSwitcher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, AnimForged_0) == 0x0003E0, "Member 'UBI_DetailPageSwitcher_C::AnimForged_0' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, AnimForged) == 0x0003E8, "Member 'UBI_DetailPageSwitcher_C::AnimForged' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003F0, "Member 'UBI_DetailPageSwitcher_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, AKBPageSwitch) == 0x0003F8, "Member 'UBI_DetailPageSwitcher_C::AKBPageSwitch' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, NGForgeSpark) == 0x000400, "Member 'UBI_DetailPageSwitcher_C::NGForgeSpark' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_0) == 0x000408, "Member 'UBI_DetailPageSwitcher_C::None1_0' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_1) == 0x000410, "Member 'UBI_DetailPageSwitcher_C::None1_1' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_2) == 0x000418, "Member 'UBI_DetailPageSwitcher_C::None1_2' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_3) == 0x000420, "Member 'UBI_DetailPageSwitcher_C::None1_3' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_4) == 0x000428, "Member 'UBI_DetailPageSwitcher_C::None1_4' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, None1_5) == 0x000430, "Member 'UBI_DetailPageSwitcher_C::None1_5' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_1) == 0x000438, "Member 'UBI_DetailPageSwitcher_C::Page_1' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_2) == 0x000440, "Member 'UBI_DetailPageSwitcher_C::Page_2' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_3) == 0x000448, "Member 'UBI_DetailPageSwitcher_C::Page_3' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_4) == 0x000450, "Member 'UBI_DetailPageSwitcher_C::Page_4' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_5) == 0x000458, "Member 'UBI_DetailPageSwitcher_C::Page_5' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_6) == 0x000460, "Member 'UBI_DetailPageSwitcher_C::Page_6' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_7) == 0x000468, "Member 'UBI_DetailPageSwitcher_C::Page_7' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, Page_8) == 0x000470, "Member 'UBI_DetailPageSwitcher_C::Page_8' has a wrong offset!");
static_assert(offsetof(UBI_DetailPageSwitcher_C, UIFX_ForgingLight) == 0x000478, "Member 'UBI_DetailPageSwitcher_C::UIFX_ForgingLight' has a wrong offset!");

}

