#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_GearDetailBg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_GearDetailBg.BI_GearDetailBg_C
// 0x0050 (0x0428 - 0x03D8)
class UBI_GearDetailBg_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimForged;                                        // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimUpgrade;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEquiped;                                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgBG;                                             // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgCoreBg;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_EquipSpark_Left;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_EquipSpark_Right;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_EquipSpark_Top;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_5(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_4(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_3(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_2(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_1(class UNiagaraSystemWidget* UING_EquipSpark_Top_0);
	void SequenceEvent__ENTRYPOINTBI_GearDetailBg_0(class UNiagaraSystemWidget* UING_EquipSpark_Top_0);
	void SeqFX_Stop_Top(class UNiagaraSystemWidget* UING_EquipSpark_Top_0);
	void SeqFX_Stop_Right(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SeqFX_Stop_Left(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SeqFX_Play_Top(class UNiagaraSystemWidget* UING_EquipSpark_Top_0);
	void SeqFX_Play_Right(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void SeqFX_Play_Left(class UNiagaraSystemWidget* UING_EquipSpark_Right_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_GearDetailBg(int32 EntryPoint);
	void EventAnim_Upgrade_Stop();
	void EventAnim_Upgrade_Play();
	void EventAnim_Forged_Stop();
	void EventAnim_Forged_Play();
	void EventAnim_Equiped_Stop();
	void EventAnim_Equiped_Play();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_GearDetailBg_C">();
	}
	static class UBI_GearDetailBg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_GearDetailBg_C>();
	}
};
static_assert(alignof(UBI_GearDetailBg_C) == 0x000008, "Wrong alignment on UBI_GearDetailBg_C");
static_assert(sizeof(UBI_GearDetailBg_C) == 0x000428, "Wrong size on UBI_GearDetailBg_C");
static_assert(offsetof(UBI_GearDetailBg_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_GearDetailBg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, AnimForged) == 0x0003E0, "Member 'UBI_GearDetailBg_C::AnimForged' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, AnimUpgrade) == 0x0003E8, "Member 'UBI_GearDetailBg_C::AnimUpgrade' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003F0, "Member 'UBI_GearDetailBg_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, AnimEquiped) == 0x0003F8, "Member 'UBI_GearDetailBg_C::AnimEquiped' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, ImgBG) == 0x000400, "Member 'UBI_GearDetailBg_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, ImgCoreBg) == 0x000408, "Member 'UBI_GearDetailBg_C::ImgCoreBg' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, UING_EquipSpark_Left) == 0x000410, "Member 'UBI_GearDetailBg_C::UING_EquipSpark_Left' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, UING_EquipSpark_Right) == 0x000418, "Member 'UBI_GearDetailBg_C::UING_EquipSpark_Right' has a wrong offset!");
static_assert(offsetof(UBI_GearDetailBg_C, UING_EquipSpark_Top) == 0x000420, "Member 'UBI_GearDetailBg_C::UING_EquipSpark_Top' has a wrong offset!");

}

