#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_HuluDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_HuluDetail.BI_HuluDetail_C
// 0x0128 (0x0500 - 0x03D8)
class UBI_HuluDetail_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimUpgrade;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBEquiped;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEquiped;                                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBDetailState;                                  // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBShowHide;                                     // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_CostItem_C*                         BI_CostItem;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_DetailPageSwitcher_C*               BI_DetailPageSwitcher;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EffectDesc_C*                       BI_EffectDesc;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_DetailLongPress_C*                  BI_EquipLongPress;                                 // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearDetailBg_C*                     BI_GearDetailBg;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_CostItemKey_C*                      BI_KeyCostItem;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SoakDesc_C*                         BI_MatDesc;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_ScrollInputTips_WithComb_C*         BI_ScrollInputTips;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_UIFXDetailForged_C*                 BI_UIFXDetailForged;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SoakDesc_C*                         BI_WineDesc;                                       // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_ScrollBoxNew_C*                     ContentScroll;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               ImgArrow;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBgHuluNum;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBgHuluUpNum;                                    // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgPageFrame;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIconScroll;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkerWearing;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Left;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Right;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Top;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class b1MinusManaged::UGSRetainerBox*         RetainerMaskSuitDesc;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spline;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpLine_Mat;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpLineNext;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtNameRuby;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_ForgedLight;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SparkLifeTime;                                     // 0x04E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SparkSize;                                         // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_HuluDetail(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SeqAnim_DetailBg_Equiped();
	void SeqAnim_DetailBg_Upgrade();
	void SeqFX_Play_Left(class UNiagaraSystemWidget* NGForgeSpark_Left_0);
	void SeqFX_Play_Right(class UNiagaraSystemWidget* NGForgeSpark_Right_0);
	void SeqFX_Play_Top(class UNiagaraSystemWidget* NGForgeSpark_Top_0);
	void SeqFX_Stop_Left(class UNiagaraSystemWidget* NGForgeSpark_Left_0);
	void SeqFX_Stop_Right(class UNiagaraSystemWidget* NGForgeSpark_Right_0);
	void SeqFX_Stop_Top(class UNiagaraSystemWidget* NGForgeSpark_Top_0);
	void SequenceEvent__ENTRYPOINTBI_HuluDetail_0();
	void SequenceEvent__ENTRYPOINTBI_HuluDetail_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_HuluDetail_C">();
	}
	static class UBI_HuluDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_HuluDetail_C>();
	}
};
static_assert(alignof(UBI_HuluDetail_C) == 0x000008, "Wrong alignment on UBI_HuluDetail_C");
static_assert(sizeof(UBI_HuluDetail_C) == 0x000500, "Wrong size on UBI_HuluDetail_C");
static_assert(offsetof(UBI_HuluDetail_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_HuluDetail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, AnimUpgrade) == 0x0003E0, "Member 'UBI_HuluDetail_C::AnimUpgrade' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003E8, "Member 'UBI_HuluDetail_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, AKBEquiped) == 0x0003F0, "Member 'UBI_HuluDetail_C::AKBEquiped' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, AnimEquiped) == 0x0003F8, "Member 'UBI_HuluDetail_C::AnimEquiped' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000400, "Member 'UBI_HuluDetail_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, GSAKBDetailState) == 0x000408, "Member 'UBI_HuluDetail_C::GSAKBDetailState' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, GSAKBShowHide) == 0x000410, "Member 'UBI_HuluDetail_C::GSAKBShowHide' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_CostItem) == 0x000418, "Member 'UBI_HuluDetail_C::BI_CostItem' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_DetailPageSwitcher) == 0x000420, "Member 'UBI_HuluDetail_C::BI_DetailPageSwitcher' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_EffectDesc) == 0x000428, "Member 'UBI_HuluDetail_C::BI_EffectDesc' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_EquipLongPress) == 0x000430, "Member 'UBI_HuluDetail_C::BI_EquipLongPress' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_GearDetailBg) == 0x000438, "Member 'UBI_HuluDetail_C::BI_GearDetailBg' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_KeyCostItem) == 0x000440, "Member 'UBI_HuluDetail_C::BI_KeyCostItem' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_MatDesc) == 0x000448, "Member 'UBI_HuluDetail_C::BI_MatDesc' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_ScrollInputTips) == 0x000450, "Member 'UBI_HuluDetail_C::BI_ScrollInputTips' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_UIFXDetailForged) == 0x000458, "Member 'UBI_HuluDetail_C::BI_UIFXDetailForged' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, BI_WineDesc) == 0x000460, "Member 'UBI_HuluDetail_C::BI_WineDesc' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, ContentScroll) == 0x000468, "Member 'UBI_HuluDetail_C::ContentScroll' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, ImgArrow) == 0x000470, "Member 'UBI_HuluDetail_C::ImgArrow' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, ImgBgHuluNum) == 0x000478, "Member 'UBI_HuluDetail_C::ImgBgHuluNum' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, ImgBgHuluUpNum) == 0x000480, "Member 'UBI_HuluDetail_C::ImgBgHuluUpNum' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, ImgPageFrame) == 0x000488, "Member 'UBI_HuluDetail_C::ImgPageFrame' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, InputIconScroll) == 0x000490, "Member 'UBI_HuluDetail_C::InputIconScroll' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, MarkerWearing) == 0x000498, "Member 'UBI_HuluDetail_C::MarkerWearing' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, NGForgeSpark_Left) == 0x0004A0, "Member 'UBI_HuluDetail_C::NGForgeSpark_Left' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, NGForgeSpark_Right) == 0x0004A8, "Member 'UBI_HuluDetail_C::NGForgeSpark_Right' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, NGForgeSpark_Top) == 0x0004B0, "Member 'UBI_HuluDetail_C::NGForgeSpark_Top' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, RetainerMaskSuitDesc) == 0x0004B8, "Member 'UBI_HuluDetail_C::RetainerMaskSuitDesc' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, Spline) == 0x0004C0, "Member 'UBI_HuluDetail_C::Spline' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, SpLine_Mat) == 0x0004C8, "Member 'UBI_HuluDetail_C::SpLine_Mat' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, SpLineNext) == 0x0004D0, "Member 'UBI_HuluDetail_C::SpLineNext' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, TxtNameRuby) == 0x0004D8, "Member 'UBI_HuluDetail_C::TxtNameRuby' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, UIFX_ForgedLight) == 0x0004E0, "Member 'UBI_HuluDetail_C::UIFX_ForgedLight' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, SparkLifeTime) == 0x0004E8, "Member 'UBI_HuluDetail_C::SparkLifeTime' has a wrong offset!");
static_assert(offsetof(UBI_HuluDetail_C, SparkSize) == 0x0004F8, "Member 'UBI_HuluDetail_C::SparkSize' has a wrong offset!");

}

