#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ItemStory

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_ItemStory.BI_ItemStory_C
// 0x0050 (0x0428 - 0x03D8)
class UBI_ItemStory_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimObsFold;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimObsUnfold;                                     // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHide;                                          // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShow;                                          // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBShowHide;                                     // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgStoryBar;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtStoryRuby;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           StoryBarTint;                                      // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void EventAnimHide_Play();
	void EventAnimHide_Stop();
	void EventAnimObsFold_Play();
	void EventAnimObsFold_Stop();
	void EventAnimObsUnfold_Play();
	void EventAnimObsUnfold_Stop();
	void EventAnimShow_Play();
	void EventAnimShow_Stop();
	void ExecuteUbergraph_BI_ItemStory(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_ItemStory_C">();
	}
	static class UBI_ItemStory_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_ItemStory_C>();
	}
};
static_assert(alignof(UBI_ItemStory_C) == 0x000008, "Wrong alignment on UBI_ItemStory_C");
static_assert(sizeof(UBI_ItemStory_C) == 0x000428, "Wrong size on UBI_ItemStory_C");
static_assert(offsetof(UBI_ItemStory_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_ItemStory_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, AnimObsFold) == 0x0003E0, "Member 'UBI_ItemStory_C::AnimObsFold' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, AnimObsUnfold) == 0x0003E8, "Member 'UBI_ItemStory_C::AnimObsUnfold' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, AnimHide) == 0x0003F0, "Member 'UBI_ItemStory_C::AnimHide' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, AnimShow) == 0x0003F8, "Member 'UBI_ItemStory_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, GSAKBShowHide) == 0x000400, "Member 'UBI_ItemStory_C::GSAKBShowHide' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, ImgStoryBar) == 0x000408, "Member 'UBI_ItemStory_C::ImgStoryBar' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, TxtStoryRuby) == 0x000410, "Member 'UBI_ItemStory_C::TxtStoryRuby' has a wrong offset!");
static_assert(offsetof(UBI_ItemStory_C, StoryBarTint) == 0x000418, "Member 'UBI_ItemStory_C::StoryBarTint' has a wrong offset!");

}

