#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_Loading_Item_Name

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_Loading_Item_Name.BI_Loading_Item_Name_C
// 0x0038 (0x0410 - 0x03D8)
class UBI_Loading_Item_Name_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimHide;                                          // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShow;                                          // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgBar;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLineL;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLineR;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         SubfixTxtRuby;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_Loading_Item_Name(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_Loading_Item_Name_C">();
	}
	static class UBI_Loading_Item_Name_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_Loading_Item_Name_C>();
	}
};
static_assert(alignof(UBI_Loading_Item_Name_C) == 0x000008, "Wrong alignment on UBI_Loading_Item_Name_C");
static_assert(sizeof(UBI_Loading_Item_Name_C) == 0x000410, "Wrong size on UBI_Loading_Item_Name_C");
static_assert(offsetof(UBI_Loading_Item_Name_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_Loading_Item_Name_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, AnimHide) == 0x0003E0, "Member 'UBI_Loading_Item_Name_C::AnimHide' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, AnimShow) == 0x0003E8, "Member 'UBI_Loading_Item_Name_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, ImgBar) == 0x0003F0, "Member 'UBI_Loading_Item_Name_C::ImgBar' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, ImgLineL) == 0x0003F8, "Member 'UBI_Loading_Item_Name_C::ImgLineL' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, ImgLineR) == 0x000400, "Member 'UBI_Loading_Item_Name_C::ImgLineR' has a wrong offset!");
static_assert(offsetof(UBI_Loading_Item_Name_C, SubfixTxtRuby) == 0x000408, "Member 'UBI_Loading_Item_Name_C::SubfixTxtRuby' has a wrong offset!");

}

