#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_RoleAttr_V3

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_RoleAttr_V3.BI_RoleAttr_V3_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_RoleAttr_V3_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_RoleAttr_V3_C_PreConstruct) == 0x000001, "Wrong alignment on BI_RoleAttr_V3_C_PreConstruct");
static_assert(sizeof(BI_RoleAttr_V3_C_PreConstruct) == 0x000001, "Wrong size on BI_RoleAttr_V3_C_PreConstruct");
static_assert(offsetof(BI_RoleAttr_V3_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BI_RoleAttr_V3_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BI_RoleAttr_V3.BI_RoleAttr_V3_C.ExecuteUbergraph_BI_RoleAttr_V3
// 0x0028 (0x0028 - 0x0000)
struct BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3) == 0x000008, "Wrong alignment on BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3");
static_assert(sizeof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3) == 0x000028, "Wrong size on BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, EntryPoint) == 0x000000, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'BI_RoleAttr_V3_C_ExecuteUbergraph_BI_RoleAttr_V3::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

}

