#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_RoleAttr_V3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_RoleAttr_V3.BI_RoleAttr_V3_C
// 0x0188 (0x0560 - 0x03D8)
class UBI_RoleAttr_V3_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StateChange;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimObsFold;                                       // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimObsUnfold;                                     // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimHide;                                          // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShow;                                          // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowComplex;                                   // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowSimple;                                    // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_0;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_1;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_2;                              // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_3;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_4;                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_5;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_6;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_7;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_8;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrFold_V3_C*               BI_SecRoleAttrFold_9;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_0;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_1;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_2;                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_3;                            // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_4;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_5;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_6;                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_7;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_8;                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_9;                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_10;                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_11;                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_12;                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SecRoleAttrUnfold_V3_C*             BI_SecRoleAttrUnfold_13;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ExpBar;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ExpBarUnfold;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBox;                                          // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBoxSimple;                                    // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgFoldBg;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgUnfoldBg;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSProcBar*                             ProgBar;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSProcBar*                             ProgBarUnfold;                                     // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgBG;                                            // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgBGUnfold;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void EventAnimHide_Play();
	void EventAnimHide_Stop();
	void EventAnimObsFold_Play();
	void EventAnimObsFold_Stop();
	void EventAnimObsUnfold_Play();
	void EventAnimObsUnfold_Stop();
	void EventAnimShow_Play();
	void EventAnimShow_Stop();
	void ExecuteUbergraph_BI_RoleAttr_V3(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_RoleAttr_V3_C">();
	}
	static class UBI_RoleAttr_V3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_RoleAttr_V3_C>();
	}
};
static_assert(alignof(UBI_RoleAttr_V3_C) == 0x000008, "Wrong alignment on UBI_RoleAttr_V3_C");
static_assert(sizeof(UBI_RoleAttr_V3_C) == 0x000560, "Wrong size on UBI_RoleAttr_V3_C");
static_assert(offsetof(UBI_RoleAttr_V3_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_RoleAttr_V3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, StateChange) == 0x0003E0, "Member 'UBI_RoleAttr_V3_C::StateChange' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003E8, "Member 'UBI_RoleAttr_V3_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimObsFold) == 0x0003F0, "Member 'UBI_RoleAttr_V3_C::AnimObsFold' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimObsUnfold) == 0x0003F8, "Member 'UBI_RoleAttr_V3_C::AnimObsUnfold' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimHide) == 0x000400, "Member 'UBI_RoleAttr_V3_C::AnimHide' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimShow) == 0x000408, "Member 'UBI_RoleAttr_V3_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimShowComplex) == 0x000410, "Member 'UBI_RoleAttr_V3_C::AnimShowComplex' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, AnimShowSimple) == 0x000418, "Member 'UBI_RoleAttr_V3_C::AnimShowSimple' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_0) == 0x000420, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_0' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_1) == 0x000428, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_1' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_2) == 0x000430, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_2' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_3) == 0x000438, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_3' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_4) == 0x000440, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_4' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_5) == 0x000448, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_5' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_6) == 0x000450, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_6' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_7) == 0x000458, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_7' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_8) == 0x000460, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_8' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrFold_9) == 0x000468, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrFold_9' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_0) == 0x000470, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_0' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_1) == 0x000478, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_1' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_2) == 0x000480, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_2' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_3) == 0x000488, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_3' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_4) == 0x000490, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_4' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_5) == 0x000498, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_5' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_6) == 0x0004A0, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_6' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_7) == 0x0004A8, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_7' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_8) == 0x0004B0, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_8' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_9) == 0x0004B8, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_9' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_10) == 0x0004C0, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_10' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_11) == 0x0004C8, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_11' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_12) == 0x0004D0, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_12' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, BI_SecRoleAttrUnfold_13) == 0x0004D8, "Member 'UBI_RoleAttr_V3_C::BI_SecRoleAttrUnfold_13' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ExpBar) == 0x0004E0, "Member 'UBI_RoleAttr_V3_C::ExpBar' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ExpBarUnfold) == 0x0004E8, "Member 'UBI_RoleAttr_V3_C::ExpBarUnfold' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, HoverBox) == 0x0004F0, "Member 'UBI_RoleAttr_V3_C::HoverBox' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, HoverBoxSimple) == 0x0004F8, "Member 'UBI_RoleAttr_V3_C::HoverBoxSimple' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image) == 0x000500, "Member 'UBI_RoleAttr_V3_C::Image' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image_1) == 0x000508, "Member 'UBI_RoleAttr_V3_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image_2) == 0x000510, "Member 'UBI_RoleAttr_V3_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image_3) == 0x000518, "Member 'UBI_RoleAttr_V3_C::Image_3' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image_4) == 0x000520, "Member 'UBI_RoleAttr_V3_C::Image_4' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, Image_93) == 0x000528, "Member 'UBI_RoleAttr_V3_C::Image_93' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ImgFoldBg) == 0x000530, "Member 'UBI_RoleAttr_V3_C::ImgFoldBg' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ImgUnfoldBg) == 0x000538, "Member 'UBI_RoleAttr_V3_C::ImgUnfoldBg' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ProgBar) == 0x000540, "Member 'UBI_RoleAttr_V3_C::ProgBar' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ProgBarUnfold) == 0x000548, "Member 'UBI_RoleAttr_V3_C::ProgBarUnfold' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ProgBG) == 0x000550, "Member 'UBI_RoleAttr_V3_C::ProgBG' has a wrong offset!");
static_assert(offsetof(UBI_RoleAttr_V3_C, ProgBGUnfold) == 0x000558, "Member 'UBI_RoleAttr_V3_C::ProgBGUnfold' has a wrong offset!");

}

