#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_RZDDetail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_RZDDetail.BI_RZDDetail_C
// 0x0158 (0x0530 - 0x03D8)
class UBI_RZDDetail_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AKBPicSwitch;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimUpgrade;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBEquiped;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEquiped;                                       // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBStateSuitTxt;                                   // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBVideoState;                                     // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBDetailState;                                  // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBShowHide;                                     // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_CostItem_C*                         BI_CostItem;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_DetailPageSwitcher_C*               BI_DetailPageSwitcher;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EffectDesc_C*                       BI_EffectDesc;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_DetailLongPress_C*                  BI_EquipLongPress;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearDetailBg_C*                     BI_GearDetailBg;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_CostItemKey_C*                      BI_KeyCostItem;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_ScrollInputTips_WithComb_C*         BI_ScrollInputTips;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_UIFXDetailForged_C*                 BI_UIFXDetailForged;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_ScrollBoxNew_C*                     ContentScroll;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgPageFrame;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgVideo;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgVideoBink;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon_HideVideo;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon_ShowVideo;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIconScroll;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkerWearing;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Left;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Right;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NGForgeSpark_Top;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class b1MinusManaged::UGSRetainerBox*         RetainerMaskSuitDesc;                              // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_RZDDetailItem_C*                    RZDItem;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Spline;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpLine_Passive;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpLineNext;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_TreasureEqDesc_C*                   TreasureEqDesc;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputRichTextBlock*                  TxtInputTips;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtNameRuby;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtSkillDesc;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_ForgedLight;                                  // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SparkLifeTime;                                     // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SparkSize;                                         // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTBI_RZDDetail_1();
	void SequenceEvent__ENTRYPOINTBI_RZDDetail_0();
	void SeqFX_Stop_Top(class UNiagaraSystemWidget* NGForgeSpark_Top_0);
	void SeqFX_Stop_Right(class UNiagaraSystemWidget* NGForgeSpark_Right_0);
	void SeqFX_Stop_Left(class UNiagaraSystemWidget* NGForgeSpark_Left_0);
	void SeqFX_Play_Top(class UNiagaraSystemWidget* NGForgeSpark_Top_0);
	void SeqFX_Play_Right(class UNiagaraSystemWidget* NGForgeSpark_Right_0);
	void SeqFX_Play_Left(class UNiagaraSystemWidget* NGForgeSpark_Left_0);
	void SeqAnim_DetailBg_Upgrade();
	void SeqAnim_DetailBg_Equiped();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_RZDDetail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_RZDDetail_C">();
	}
	static class UBI_RZDDetail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_RZDDetail_C>();
	}
};
static_assert(alignof(UBI_RZDDetail_C) == 0x000008, "Wrong alignment on UBI_RZDDetail_C");
static_assert(sizeof(UBI_RZDDetail_C) == 0x000530, "Wrong size on UBI_RZDDetail_C");
static_assert(offsetof(UBI_RZDDetail_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_RZDDetail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AKBPicSwitch) == 0x0003E0, "Member 'UBI_RZDDetail_C::AKBPicSwitch' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AnimUpgrade) == 0x0003E8, "Member 'UBI_RZDDetail_C::AnimUpgrade' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003F0, "Member 'UBI_RZDDetail_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AKBEquiped) == 0x0003F8, "Member 'UBI_RZDDetail_C::AKBEquiped' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AnimEquiped) == 0x000400, "Member 'UBI_RZDDetail_C::AnimEquiped' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AKBStateSuitTxt) == 0x000408, "Member 'UBI_RZDDetail_C::AKBStateSuitTxt' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000410, "Member 'UBI_RZDDetail_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, AKBVideoState) == 0x000418, "Member 'UBI_RZDDetail_C::AKBVideoState' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, GSAKBDetailState) == 0x000420, "Member 'UBI_RZDDetail_C::GSAKBDetailState' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, GSAKBShowHide) == 0x000428, "Member 'UBI_RZDDetail_C::GSAKBShowHide' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_CostItem) == 0x000430, "Member 'UBI_RZDDetail_C::BI_CostItem' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_DetailPageSwitcher) == 0x000438, "Member 'UBI_RZDDetail_C::BI_DetailPageSwitcher' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_EffectDesc) == 0x000440, "Member 'UBI_RZDDetail_C::BI_EffectDesc' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_EquipLongPress) == 0x000448, "Member 'UBI_RZDDetail_C::BI_EquipLongPress' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_GearDetailBg) == 0x000450, "Member 'UBI_RZDDetail_C::BI_GearDetailBg' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_KeyCostItem) == 0x000458, "Member 'UBI_RZDDetail_C::BI_KeyCostItem' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_ScrollInputTips) == 0x000460, "Member 'UBI_RZDDetail_C::BI_ScrollInputTips' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, BI_UIFXDetailForged) == 0x000468, "Member 'UBI_RZDDetail_C::BI_UIFXDetailForged' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, ContentScroll) == 0x000470, "Member 'UBI_RZDDetail_C::ContentScroll' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, ImgPageFrame) == 0x000478, "Member 'UBI_RZDDetail_C::ImgPageFrame' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, ImgVideo) == 0x000480, "Member 'UBI_RZDDetail_C::ImgVideo' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, ImgVideoBink) == 0x000488, "Member 'UBI_RZDDetail_C::ImgVideoBink' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, InputIcon_HideVideo) == 0x000490, "Member 'UBI_RZDDetail_C::InputIcon_HideVideo' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, InputIcon_ShowVideo) == 0x000498, "Member 'UBI_RZDDetail_C::InputIcon_ShowVideo' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, InputIconScroll) == 0x0004A0, "Member 'UBI_RZDDetail_C::InputIconScroll' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, MarkerWearing) == 0x0004A8, "Member 'UBI_RZDDetail_C::MarkerWearing' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, NGForgeSpark_Left) == 0x0004B0, "Member 'UBI_RZDDetail_C::NGForgeSpark_Left' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, NGForgeSpark_Right) == 0x0004B8, "Member 'UBI_RZDDetail_C::NGForgeSpark_Right' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, NGForgeSpark_Top) == 0x0004C0, "Member 'UBI_RZDDetail_C::NGForgeSpark_Top' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, RetainerMaskSuitDesc) == 0x0004C8, "Member 'UBI_RZDDetail_C::RetainerMaskSuitDesc' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, RZDItem) == 0x0004D0, "Member 'UBI_RZDDetail_C::RZDItem' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, Spline) == 0x0004D8, "Member 'UBI_RZDDetail_C::Spline' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, SpLine_Passive) == 0x0004E0, "Member 'UBI_RZDDetail_C::SpLine_Passive' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, SpLineNext) == 0x0004E8, "Member 'UBI_RZDDetail_C::SpLineNext' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, TreasureEqDesc) == 0x0004F0, "Member 'UBI_RZDDetail_C::TreasureEqDesc' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, TxtInputTips) == 0x0004F8, "Member 'UBI_RZDDetail_C::TxtInputTips' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, TxtNameRuby) == 0x000500, "Member 'UBI_RZDDetail_C::TxtNameRuby' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, TxtSkillDesc) == 0x000508, "Member 'UBI_RZDDetail_C::TxtSkillDesc' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, UIFX_ForgedLight) == 0x000510, "Member 'UBI_RZDDetail_C::UIFX_ForgedLight' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, SparkLifeTime) == 0x000518, "Member 'UBI_RZDDetail_C::SparkLifeTime' has a wrong offset!");
static_assert(offsetof(UBI_RZDDetail_C, SparkSize) == 0x000528, "Member 'UBI_RZDDetail_C::SparkSize' has a wrong offset!");

}

