#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_SuitSPDesc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_SuitSPDesc.BI_SuitSPDesc_C
// 0x0060 (0x0438 - 0x03D8)
class UBI_SuitSPDesc_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimSuitActived;                                   // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimForgeShow;                                     // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBStateSuitTxt;                                   // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGSImage*                               ImgArrow;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgDot;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               ImgNew;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtSuitDesc;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               UIFX_SPSuitAct;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_Forged;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BI_SuitSPDesc(int32 EntryPoint);
	void SeqFX_Play();
	void SeqFX_Stop();
	void SequenceEvent__ENTRYPOINTBI_SuitSPDesc_0();
	void SequenceEvent__ENTRYPOINTBI_SuitSPDesc_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_SuitSPDesc_C">();
	}
	static class UBI_SuitSPDesc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_SuitSPDesc_C>();
	}
};
static_assert(alignof(UBI_SuitSPDesc_C) == 0x000008, "Wrong alignment on UBI_SuitSPDesc_C");
static_assert(sizeof(UBI_SuitSPDesc_C) == 0x000438, "Wrong size on UBI_SuitSPDesc_C");
static_assert(offsetof(UBI_SuitSPDesc_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_SuitSPDesc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003E0, "Member 'UBI_SuitSPDesc_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, AnimSuitActived) == 0x0003E8, "Member 'UBI_SuitSPDesc_C::AnimSuitActived' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, AnimForgeShow) == 0x0003F0, "Member 'UBI_SuitSPDesc_C::AnimForgeShow' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003F8, "Member 'UBI_SuitSPDesc_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, AKBStateSuitTxt) == 0x000400, "Member 'UBI_SuitSPDesc_C::AKBStateSuitTxt' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, ImgArrow) == 0x000408, "Member 'UBI_SuitSPDesc_C::ImgArrow' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, ImgDot) == 0x000410, "Member 'UBI_SuitSPDesc_C::ImgDot' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, ImgNew) == 0x000418, "Member 'UBI_SuitSPDesc_C::ImgNew' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, TxtSuitDesc) == 0x000420, "Member 'UBI_SuitSPDesc_C::TxtSuitDesc' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, UIFX_SPSuitAct) == 0x000428, "Member 'UBI_SuitSPDesc_C::UIFX_SPSuitAct' has a wrong offset!");
static_assert(offsetof(UBI_SuitSPDesc_C, UINS_Forged) == 0x000430, "Member 'UBI_SuitSPDesc_C::UINS_Forged' has a wrong offset!");

}

