#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ScrollInputTips_WithComb

#include "Basic.hpp"

#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_ScrollInputTips_WithComb.BI_ScrollInputTips_WithComb_C
// 0x0028 (0x0408 - 0x03E0)
class UBI_ScrollInputTips_WithComb_C final : public UBUI_ScrollTips
{
public:
	class UWidgetAnimation*                       AKBShowHide;                                       // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgScrollArrow;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIconScrollComb;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIconScrollConnector;                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NSInputIcon;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_ScrollInputTips_WithComb_C">();
	}
	static class UBI_ScrollInputTips_WithComb_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_ScrollInputTips_WithComb_C>();
	}
};
static_assert(alignof(UBI_ScrollInputTips_WithComb_C) == 0x000008, "Wrong alignment on UBI_ScrollInputTips_WithComb_C");
static_assert(sizeof(UBI_ScrollInputTips_WithComb_C) == 0x000408, "Wrong size on UBI_ScrollInputTips_WithComb_C");
static_assert(offsetof(UBI_ScrollInputTips_WithComb_C, AKBShowHide) == 0x0003E0, "Member 'UBI_ScrollInputTips_WithComb_C::AKBShowHide' has a wrong offset!");
static_assert(offsetof(UBI_ScrollInputTips_WithComb_C, ImgScrollArrow) == 0x0003E8, "Member 'UBI_ScrollInputTips_WithComb_C::ImgScrollArrow' has a wrong offset!");
static_assert(offsetof(UBI_ScrollInputTips_WithComb_C, InputIconScrollComb) == 0x0003F0, "Member 'UBI_ScrollInputTips_WithComb_C::InputIconScrollComb' has a wrong offset!");
static_assert(offsetof(UBI_ScrollInputTips_WithComb_C, InputIconScrollConnector) == 0x0003F8, "Member 'UBI_ScrollInputTips_WithComb_C::InputIconScrollConnector' has a wrong offset!");
static_assert(offsetof(UBI_ScrollInputTips_WithComb_C, NSInputIcon) == 0x000400, "Member 'UBI_ScrollInputTips_WithComb_C::NSInputIcon' has a wrong offset!");

}

