#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_SecRoleAttrFold_V3

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_SecRoleAttrFold_V3.BI_SecRoleAttrFold_V3_C
// 0x0030 (0x0408 - 0x03D8)
class UBI_SecRoleAttrFold_V3_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StateChange_0;                                     // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StateChange;                                       // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgBarState;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgMarkerOther;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_HighLight;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_SecRoleAttrFold_V3(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_SecRoleAttrFold_V3_C">();
	}
	static class UBI_SecRoleAttrFold_V3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_SecRoleAttrFold_V3_C>();
	}
};
static_assert(alignof(UBI_SecRoleAttrFold_V3_C) == 0x000008, "Wrong alignment on UBI_SecRoleAttrFold_V3_C");
static_assert(sizeof(UBI_SecRoleAttrFold_V3_C) == 0x000408, "Wrong size on UBI_SecRoleAttrFold_V3_C");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_SecRoleAttrFold_V3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, StateChange_0) == 0x0003E0, "Member 'UBI_SecRoleAttrFold_V3_C::StateChange_0' has a wrong offset!");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, StateChange) == 0x0003E8, "Member 'UBI_SecRoleAttrFold_V3_C::StateChange' has a wrong offset!");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, ImgBarState) == 0x0003F0, "Member 'UBI_SecRoleAttrFold_V3_C::ImgBarState' has a wrong offset!");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, ImgMarkerOther) == 0x0003F8, "Member 'UBI_SecRoleAttrFold_V3_C::ImgMarkerOther' has a wrong offset!");
static_assert(offsetof(UBI_SecRoleAttrFold_V3_C, UIFX_HighLight) == 0x000400, "Member 'UBI_SecRoleAttrFold_V3_C::UIFX_HighLight' has a wrong offset!");

}

