#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_SuitDesc

#include "Basic.hpp"

#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_SuitDesc.BI_SuitDesc_C
// 0x0020 (0x03F8 - 0x03D8)
class UBI_SuitDesc_C final : public UBUI_Widget
{
public:
	class UWidgetAnimation*                       AKBStateSuitTxt;                                   // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ImgDot;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               ImgNew;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         TxtSuitDesc;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_SuitDesc_C">();
	}
	static class UBI_SuitDesc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_SuitDesc_C>();
	}
};
static_assert(alignof(UBI_SuitDesc_C) == 0x000008, "Wrong alignment on UBI_SuitDesc_C");
static_assert(sizeof(UBI_SuitDesc_C) == 0x0003F8, "Wrong size on UBI_SuitDesc_C");
static_assert(offsetof(UBI_SuitDesc_C, AKBStateSuitTxt) == 0x0003D8, "Member 'UBI_SuitDesc_C::AKBStateSuitTxt' has a wrong offset!");
static_assert(offsetof(UBI_SuitDesc_C, ImgDot) == 0x0003E0, "Member 'UBI_SuitDesc_C::ImgDot' has a wrong offset!");
static_assert(offsetof(UBI_SuitDesc_C, ImgNew) == 0x0003E8, "Member 'UBI_SuitDesc_C::ImgNew' has a wrong offset!");
static_assert(offsetof(UBI_SuitDesc_C, TxtSuitDesc) == 0x0003F0, "Member 'UBI_SuitDesc_C::TxtSuitDesc' has a wrong offset!");

}

