#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_StartGame

#include "Basic.hpp"


namespace SDK::Params
{

// Function BI_StartGame.BI_StartGame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BI_StartGame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_StartGame_C_PreConstruct) == 0x000001, "Wrong alignment on BI_StartGame_C_PreConstruct");
static_assert(sizeof(BI_StartGame_C_PreConstruct) == 0x000001, "Wrong size on BI_StartGame_C_PreConstruct");
static_assert(offsetof(BI_StartGame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BI_StartGame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BI_StartGame.BI_StartGame_C.ExecuteUbergraph_BI_StartGame
// 0x0008 (0x0008 - 0x0000)
struct BI_StartGame_C_ExecuteUbergraph_BI_StartGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BI_StartGame_C_ExecuteUbergraph_BI_StartGame) == 0x000004, "Wrong alignment on BI_StartGame_C_ExecuteUbergraph_BI_StartGame");
static_assert(sizeof(BI_StartGame_C_ExecuteUbergraph_BI_StartGame) == 0x000008, "Wrong size on BI_StartGame_C_ExecuteUbergraph_BI_StartGame");
static_assert(offsetof(BI_StartGame_C_ExecuteUbergraph_BI_StartGame, EntryPoint) == 0x000000, "Member 'BI_StartGame_C_ExecuteUbergraph_BI_StartGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BI_StartGame_C_ExecuteUbergraph_BI_StartGame, K2Node_Event_IsDesignTime) == 0x000004, "Member 'BI_StartGame_C_ExecuteUbergraph_BI_StartGame::K2Node_Event_IsDesignTime' has a wrong offset!");

}

