#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_UIFXDetailForged

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BI_UIFXDetailForged.BI_UIFXDetailForged_C
// 0x0070 (0x0448 - 0x03D8)
class UBI_UIFXDetailForged_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       _Bup_AnimDestroyed;                                // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimDestroyed;                                     // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimForged;                                        // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimUpgrade;                                       // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 UIFX_DestroyedMask;                                // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UIFX_Forged;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_ForgeSpark_Left;                              // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_ForgeSpark_Right;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UING_ForgeSpark_Top;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   UINS_DestroyedSpark;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SparkLifeTime;                                     // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SparkSize;                                         // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_9(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_8(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_7(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_6(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_5(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_4(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_3(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_2(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_17(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_16(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_15(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_14(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_13(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_12(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_11(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_10(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_1(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SequenceEvent__ENTRYPOINTBI_UIFXDetailForged_0(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SeqFX_Stop_Top(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SeqFX_Stop_Right(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SeqFX_Stop_Left(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SeqFX_Stop_Destroyed(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void SeqFX_Play_Top(class UNiagaraSystemWidget* NGForgeSpark_Top);
	void SeqFX_Play_Right(class UNiagaraSystemWidget* NGForgeSpark_Right);
	void SeqFX_Play_Left(class UNiagaraSystemWidget* NGForgeSpark_Left);
	void SeqFX_Play_Destroyed(class UNiagaraSystemWidget* UINS_DestroyedSpark_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BI_UIFXDetailForged(int32 EntryPoint);
	void EventAnim_Upgrade_Stop();
	void EventAnim_Upgrade_Play();
	void EventAnim_Forged_Stop();
	void EventAnim_Forged_Play();
	void EventAnim_Destroyed_Stop();
	void EventAnim_Destroyed_Play();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BI_UIFXDetailForged_C">();
	}
	static class UBI_UIFXDetailForged_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBI_UIFXDetailForged_C>();
	}
};
static_assert(alignof(UBI_UIFXDetailForged_C) == 0x000008, "Wrong alignment on UBI_UIFXDetailForged_C");
static_assert(sizeof(UBI_UIFXDetailForged_C) == 0x000448, "Wrong size on UBI_UIFXDetailForged_C");
static_assert(offsetof(UBI_UIFXDetailForged_C, UberGraphFrame) == 0x0003D8, "Member 'UBI_UIFXDetailForged_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, _Bup_AnimDestroyed) == 0x0003E0, "Member 'UBI_UIFXDetailForged_C::_Bup_AnimDestroyed' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, AnimDestroyed) == 0x0003E8, "Member 'UBI_UIFXDetailForged_C::AnimDestroyed' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, AnimForged) == 0x0003F0, "Member 'UBI_UIFXDetailForged_C::AnimForged' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, AnimUpgrade) == 0x0003F8, "Member 'UBI_UIFXDetailForged_C::AnimUpgrade' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UIFX_DestroyedMask) == 0x000400, "Member 'UBI_UIFXDetailForged_C::UIFX_DestroyedMask' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UIFX_Forged) == 0x000408, "Member 'UBI_UIFXDetailForged_C::UIFX_Forged' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UING_ForgeSpark_Left) == 0x000410, "Member 'UBI_UIFXDetailForged_C::UING_ForgeSpark_Left' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UING_ForgeSpark_Right) == 0x000418, "Member 'UBI_UIFXDetailForged_C::UING_ForgeSpark_Right' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UING_ForgeSpark_Top) == 0x000420, "Member 'UBI_UIFXDetailForged_C::UING_ForgeSpark_Top' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, UINS_DestroyedSpark) == 0x000428, "Member 'UBI_UIFXDetailForged_C::UINS_DestroyedSpark' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, SparkLifeTime) == 0x000430, "Member 'UBI_UIFXDetailForged_C::SparkLifeTime' has a wrong offset!");
static_assert(offsetof(UBI_UIFXDetailForged_C, SparkSize) == 0x000440, "Member 'UBI_UIFXDetailForged_C::SparkSize' has a wrong offset!");

}

