#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItem_ShuangTouShu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DropItemActorBase_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DropItem_ShuangTouShu.BP_DropItem_ShuangTouShu_C
// 0x0048 (0x0368 - 0x0320)
class ABP_DropItem_ShuangTouShu_C final : public ABP_DropItemActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 DummySK;                                           // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBGUAnimationSyncComponent*             BGUAnimationSync;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Dao;                                               // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TurnOffLightCurve;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DropItemBPFunc(float FloatParam);
	void ExecuteUbergraph_BP_DropItem_ShuangTouShu(int32 EntryPoint);
	void NewEventDispatcher_0__DelegateSignature();
	void ReceiveActorOnInputTouchEnter(const ETouchIndex FingerIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DropItem_ShuangTouShu_C">();
	}
	static class ABP_DropItem_ShuangTouShu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DropItem_ShuangTouShu_C>();
	}
};
static_assert(alignof(ABP_DropItem_ShuangTouShu_C) == 0x000008, "Wrong alignment on ABP_DropItem_ShuangTouShu_C");
static_assert(sizeof(ABP_DropItem_ShuangTouShu_C) == 0x000368, "Wrong size on ABP_DropItem_ShuangTouShu_C");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, UberGraphFrame) == 0x000320, "Member 'ABP_DropItem_ShuangTouShu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, DummySK) == 0x000328, "Member 'ABP_DropItem_ShuangTouShu_C::DummySK' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, BGUAnimationSync) == 0x000330, "Member 'ABP_DropItem_ShuangTouShu_C::BGUAnimationSync' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, Dao) == 0x000338, "Member 'ABP_DropItem_ShuangTouShu_C::Dao' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, Cube) == 0x000340, "Member 'ABP_DropItem_ShuangTouShu_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, Scene) == 0x000348, "Member 'ABP_DropItem_ShuangTouShu_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, TurnOffLightCurve) == 0x000350, "Member 'ABP_DropItem_ShuangTouShu_C::TurnOffLightCurve' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_ShuangTouShu_C, NewEventDispatcher_0) == 0x000358, "Member 'ABP_DropItem_ShuangTouShu_C::NewEventDispatcher_0' has a wrong offset!");

}

