#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItem_ShuangTouShu

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_DropItem_ShuangTouShu.BP_DropItem_ShuangTouShu_C.DropItemBPFunc
// 0x0004 (0x0004 - 0x0000)
struct BP_DropItem_ShuangTouShu_C_DropItemBPFunc final
{
public:
	float                                         FloatParam;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItem_ShuangTouShu_C_DropItemBPFunc) == 0x000004, "Wrong alignment on BP_DropItem_ShuangTouShu_C_DropItemBPFunc");
static_assert(sizeof(BP_DropItem_ShuangTouShu_C_DropItemBPFunc) == 0x000004, "Wrong size on BP_DropItem_ShuangTouShu_C_DropItemBPFunc");
static_assert(offsetof(BP_DropItem_ShuangTouShu_C_DropItemBPFunc, FloatParam) == 0x000000, "Member 'BP_DropItem_ShuangTouShu_C_DropItemBPFunc::FloatParam' has a wrong offset!");

// Function BP_DropItem_ShuangTouShu.BP_DropItem_ShuangTouShu_C.ExecuteUbergraph_BP_DropItem_ShuangTouShu
// 0x000C (0x000C - 0x0000)
struct BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatParam;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETouchIndex                                   K2Node_Event_FingerIndex;                          // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu) == 0x000004, "Wrong alignment on BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu");
static_assert(sizeof(BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu) == 0x00000C, "Wrong size on BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu");
static_assert(offsetof(BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu, EntryPoint) == 0x000000, "Member 'BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu, K2Node_Event_FloatParam) == 0x000004, "Member 'BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu::K2Node_Event_FloatParam' has a wrong offset!");
static_assert(offsetof(BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu, K2Node_Event_FingerIndex) == 0x000008, "Member 'BP_DropItem_ShuangTouShu_C_ExecuteUbergraph_BP_DropItem_ShuangTouShu::K2Node_Event_FingerIndex' has a wrong offset!");

// Function BP_DropItem_ShuangTouShu.BP_DropItem_ShuangTouShu_C.ReceiveActorOnInputTouchEnter
// 0x0001 (0x0001 - 0x0000)
struct BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter final
{
public:
	ETouchIndex                                   FingerIndex;                                       // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter) == 0x000001, "Wrong alignment on BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter");
static_assert(sizeof(BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter) == 0x000001, "Wrong size on BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter");
static_assert(offsetof(BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter, FingerIndex) == 0x000000, "Member 'BP_DropItem_ShuangTouShu_C_ReceiveActorOnInputTouchEnter::FingerIndex' has a wrong offset!");

}

