#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItem_BaiYiSpear

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DropItemActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DropItem_BaiYiSpear.BP_DropItem_BaiYiSpear_C
// 0x00A0 (0x03C0 - 0x0320)
class ABP_DropItem_BaiYiSpear_C final : public ABP_DropItemActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_WeaponFire_4;                      // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_WeaponFire_3;                      // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_WeaponFire_2;                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_WeaponFire_1;                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_Fire_TuoWei2;                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NG_GYCY_Lang_04_Fire_TuoWei1;                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule2;                                          // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule1;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight1;                                       // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FloatCurve_C719575145A274BB89843B88D88DF7F2; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C719575145A274BB89843B88D88DF7F2; // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TurnOffLightCurve;                                 // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void DropItemBPFunc(float FloatParam);
	void ExecuteUbergraph_BP_DropItem_BaiYiSpear(int32 EntryPoint);
	void NewEventDispatcher_0__DelegateSignature();
	void ReceiveTick(float DeltaSeconds);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DropItem_BaiYiSpear_C">();
	}
	static class ABP_DropItem_BaiYiSpear_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DropItem_BaiYiSpear_C>();
	}
};
static_assert(alignof(ABP_DropItem_BaiYiSpear_C) == 0x000008, "Wrong alignment on ABP_DropItem_BaiYiSpear_C");
static_assert(sizeof(ABP_DropItem_BaiYiSpear_C) == 0x0003C0, "Wrong size on ABP_DropItem_BaiYiSpear_C");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, UberGraphFrame) == 0x000320, "Member 'ABP_DropItem_BaiYiSpear_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Cube) == 0x000328, "Member 'ABP_DropItem_BaiYiSpear_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Scene) == 0x000330, "Member 'ABP_DropItem_BaiYiSpear_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_WeaponFire_4) == 0x000338, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_WeaponFire_4' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_WeaponFire_3) == 0x000340, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_WeaponFire_3' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_WeaponFire_2) == 0x000348, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_WeaponFire_2' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_WeaponFire_1) == 0x000350, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_WeaponFire_1' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_Fire_TuoWei2) == 0x000358, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_Fire_TuoWei2' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NG_GYCY_Lang_04_Fire_TuoWei1) == 0x000360, "Member 'ABP_DropItem_BaiYiSpear_C::NG_GYCY_Lang_04_Fire_TuoWei1' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, PointLight) == 0x000368, "Member 'ABP_DropItem_BaiYiSpear_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Capsule2) == 0x000370, "Member 'ABP_DropItem_BaiYiSpear_C::Capsule2' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Capsule1) == 0x000378, "Member 'ABP_DropItem_BaiYiSpear_C::Capsule1' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, PointLight1) == 0x000380, "Member 'ABP_DropItem_BaiYiSpear_C::PointLight1' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, SkeletalMesh) == 0x000388, "Member 'ABP_DropItem_BaiYiSpear_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Box) == 0x000390, "Member 'ABP_DropItem_BaiYiSpear_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Timeline_0_FloatCurve_C719575145A274BB89843B88D88DF7F2) == 0x000398, "Member 'ABP_DropItem_BaiYiSpear_C::Timeline_0_FloatCurve_C719575145A274BB89843B88D88DF7F2' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Timeline_0__Direction_C719575145A274BB89843B88D88DF7F2) == 0x00039C, "Member 'ABP_DropItem_BaiYiSpear_C::Timeline_0__Direction_C719575145A274BB89843B88D88DF7F2' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, Timeline_0) == 0x0003A0, "Member 'ABP_DropItem_BaiYiSpear_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, TurnOffLightCurve) == 0x0003A8, "Member 'ABP_DropItem_BaiYiSpear_C::TurnOffLightCurve' has a wrong offset!");
static_assert(offsetof(ABP_DropItem_BaiYiSpear_C, NewEventDispatcher_0) == 0x0003B0, "Member 'ABP_DropItem_BaiYiSpear_C::NewEventDispatcher_0' has a wrong offset!");

}

