#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DropItem_Longdage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DropItem_Longdage.BP_DropItem_Longdage_C.DropItemBPFunc
// 0x0004 (0x0004 - 0x0000)
struct BP_DropItem_Longdage_C_DropItemBPFunc final
{
public:
	float                                         FloatParam;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItem_Longdage_C_DropItemBPFunc) == 0x000004, "Wrong alignment on BP_DropItem_Longdage_C_DropItemBPFunc");
static_assert(sizeof(BP_DropItem_Longdage_C_DropItemBPFunc) == 0x000004, "Wrong size on BP_DropItem_Longdage_C_DropItemBPFunc");
static_assert(offsetof(BP_DropItem_Longdage_C_DropItemBPFunc, FloatParam) == 0x000000, "Member 'BP_DropItem_Longdage_C_DropItemBPFunc::FloatParam' has a wrong offset!");

// Function BP_DropItem_Longdage.BP_DropItem_Longdage_C.ExecuteUbergraph_BP_DropItem_Longdage
// 0x0008 (0x0008 - 0x0000)
struct BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_FloatParam;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage) == 0x000004, "Wrong alignment on BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage");
static_assert(sizeof(BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage) == 0x000008, "Wrong size on BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage");
static_assert(offsetof(BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage, EntryPoint) == 0x000000, "Member 'BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage, K2Node_Event_FloatParam) == 0x000004, "Member 'BP_DropItem_Longdage_C_ExecuteUbergraph_BP_DropItem_Longdage::K2Node_Event_FloatParam' has a wrong offset!");

}

