#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_OP_Editable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_OP_Editable.BP_UI_OP_Editable_C
// 0x0030 (0x0408 - 0x03D8)
class UBP_UI_OP_Editable_C final : public UBUI_GM_OP_Editable
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG2;                                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurValueText;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                OPButton;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       OPEditableText;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_OP_Editable(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_OP_Editable_C">();
	}
	static class UBP_UI_OP_Editable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_OP_Editable_C>();
	}
};
static_assert(alignof(UBP_UI_OP_Editable_C) == 0x000008, "Wrong alignment on UBP_UI_OP_Editable_C");
static_assert(sizeof(UBP_UI_OP_Editable_C) == 0x000408, "Wrong size on UBP_UI_OP_Editable_C");
static_assert(offsetof(UBP_UI_OP_Editable_C, UberGraphFrame) == 0x0003D8, "Member 'UBP_UI_OP_Editable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Editable_C, BG) == 0x0003E0, "Member 'UBP_UI_OP_Editable_C::BG' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Editable_C, BG2) == 0x0003E8, "Member 'UBP_UI_OP_Editable_C::BG2' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Editable_C, CurValueText) == 0x0003F0, "Member 'UBP_UI_OP_Editable_C::CurValueText' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Editable_C, OPButton) == 0x0003F8, "Member 'UBP_UI_OP_Editable_C::OPButton' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Editable_C, OPEditableText) == 0x000400, "Member 'UBP_UI_OP_Editable_C::OPEditableText' has a wrong offset!");

}

