#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMSettingSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_GMSettingSlider.BP_UI_GMSettingSlider_C
// 0x0058 (0x02F0 - 0x0298)
class UBP_UI_GMSettingSlider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_UI_GMSettingBase_C*                 BP_UI_GMSettingBase;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UI_OP_Slider_C*                     BP_UI_OP_Slider;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OptionName;                                        // 0x02B0(0x0018)(Edit, BlueprintVisible)
	int32                                         CurStep;                                           // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           SliderStepDescAttr;                                // 0x02D0(0x0010)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnSliderValueChanged;                              // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnSliderValueChanged__DelegateSignature();
	void ExecuteUbergraph_BP_UI_GMSettingSlider(int32 EntryPoint);
	void EventOnSlideChange(int32 OutCurStep);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_GMSettingSlider_C">();
	}
	static class UBP_UI_GMSettingSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_GMSettingSlider_C>();
	}
};
static_assert(alignof(UBP_UI_GMSettingSlider_C) == 0x000008, "Wrong alignment on UBP_UI_GMSettingSlider_C");
static_assert(sizeof(UBP_UI_GMSettingSlider_C) == 0x0002F0, "Wrong size on UBP_UI_GMSettingSlider_C");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, UberGraphFrame) == 0x000298, "Member 'UBP_UI_GMSettingSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, BP_UI_GMSettingBase) == 0x0002A0, "Member 'UBP_UI_GMSettingSlider_C::BP_UI_GMSettingBase' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, BP_UI_OP_Slider) == 0x0002A8, "Member 'UBP_UI_GMSettingSlider_C::BP_UI_OP_Slider' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, OptionName) == 0x0002B0, "Member 'UBP_UI_GMSettingSlider_C::OptionName' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, CurStep) == 0x0002C8, "Member 'UBP_UI_GMSettingSlider_C::CurStep' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, SliderStepDescAttr) == 0x0002D0, "Member 'UBP_UI_GMSettingSlider_C::SliderStepDescAttr' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingSlider_C, OnSliderValueChanged) == 0x0002E0, "Member 'UBP_UI_GMSettingSlider_C::OnSliderValueChanged' has a wrong offset!");

}

