#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_CommErrorTips

#include "Basic.hpp"

#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_CommErrorTips.BP_UI_CommErrorTips_C
// 0x0038 (0x0410 - 0x03D8)
class UBP_UI_CommErrorTips_C final : public UBUI_CommErrorTips
{
public:
	class UImage*                                 Image_44;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBlock;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSImage*                               ImgBox;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLine;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LogBackground;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StackInfoBackground;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_CommErrorTips_C">();
	}
	static class UBP_UI_CommErrorTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_CommErrorTips_C>();
	}
};
static_assert(alignof(UBP_UI_CommErrorTips_C) == 0x000008, "Wrong alignment on UBP_UI_CommErrorTips_C");
static_assert(sizeof(UBP_UI_CommErrorTips_C) == 0x000410, "Wrong size on UBP_UI_CommErrorTips_C");
static_assert(offsetof(UBP_UI_CommErrorTips_C, Image_44) == 0x0003D8, "Member 'UBP_UI_CommErrorTips_C::Image_44' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, ImgBlock) == 0x0003E0, "Member 'UBP_UI_CommErrorTips_C::ImgBlock' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, ImgBox) == 0x0003E8, "Member 'UBP_UI_CommErrorTips_C::ImgBox' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, ImgLine) == 0x0003F0, "Member 'UBP_UI_CommErrorTips_C::ImgLine' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, InputIcon) == 0x0003F8, "Member 'UBP_UI_CommErrorTips_C::InputIcon' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, LogBackground) == 0x000400, "Member 'UBP_UI_CommErrorTips_C::LogBackground' has a wrong offset!");
static_assert(offsetof(UBP_UI_CommErrorTips_C, StackInfoBackground) == 0x000408, "Member 'UBP_UI_CommErrorTips_C::StackInfoBackground' has a wrong offset!");

}

