#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMInfo_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_GMInfo_Player.BP_UI_GMInfo_Player_C
// 0x0018 (0x03F8 - 0x03E0)
class UBP_UI_GMInfo_Player_C final : public UBUI_GMInfo_Player
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_1;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_2;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BP_UI_GMInfo_Player(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_GMInfo_Player_C">();
	}
	static class UBP_UI_GMInfo_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_GMInfo_Player_C>();
	}
};
static_assert(alignof(UBP_UI_GMInfo_Player_C) == 0x000008, "Wrong alignment on UBP_UI_GMInfo_Player_C");
static_assert(sizeof(UBP_UI_GMInfo_Player_C) == 0x0003F8, "Wrong size on UBP_UI_GMInfo_Player_C");
static_assert(offsetof(UBP_UI_GMInfo_Player_C, UberGraphFrame) == 0x0003E0, "Member 'UBP_UI_GMInfo_Player_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfo_Player_C, BG_1) == 0x0003E8, "Member 'UBP_UI_GMInfo_Player_C::BG_1' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfo_Player_C, BG_2) == 0x0003F0, "Member 'UBP_UI_GMInfo_Player_C::BG_2' has a wrong offset!");

}

