#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMSettingBase

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_GMSettingBase.BP_UI_GMSettingBase_C
// 0x0038 (0x02D0 - 0x0298)
class UBP_UI_GMSettingBase_C final : public UUserWidget
{
public:
	class UImage*                                 BG;                                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Mask;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             OPSlot;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OptionName;                                        // 0x02B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x02B8(0x0018)(Edit, BlueprintVisible)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_GMSettingBase_C">();
	}
	static class UBP_UI_GMSettingBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_GMSettingBase_C>();
	}
};
static_assert(alignof(UBP_UI_GMSettingBase_C) == 0x000008, "Wrong alignment on UBP_UI_GMSettingBase_C");
static_assert(sizeof(UBP_UI_GMSettingBase_C) == 0x0002D0, "Wrong size on UBP_UI_GMSettingBase_C");
static_assert(offsetof(UBP_UI_GMSettingBase_C, BG) == 0x000298, "Member 'UBP_UI_GMSettingBase_C::BG' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingBase_C, Mask) == 0x0002A0, "Member 'UBP_UI_GMSettingBase_C::Mask' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingBase_C, OPSlot) == 0x0002A8, "Member 'UBP_UI_GMSettingBase_C::OPSlot' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingBase_C, OptionName) == 0x0002B0, "Member 'UBP_UI_GMSettingBase_C::OptionName' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMSettingBase_C, Name_0) == 0x0002B8, "Member 'UBP_UI_GMSettingBase_C::Name_0' has a wrong offset!");

}

