#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_OP_Check

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_OP_Check.BP_UI_OP_Check_C
// 0x0048 (0x02E0 - 0x0298)
class UBP_UI_OP_Check_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              OPCheck;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x02A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCheck;                                           // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CheckName;                                         // 0x02B8(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             OnChildCheckStateChangedEDisp;                     // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChildCheckStateChangedEDisp__DelegateSignature();
	void OnChildCheckStateChanged(bool bIsChecked);
	void ExecuteUbergraph_BP_UI_OP_Check(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_OP_Check_C">();
	}
	static class UBP_UI_OP_Check_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_OP_Check_C>();
	}
};
static_assert(alignof(UBP_UI_OP_Check_C) == 0x000008, "Wrong alignment on UBP_UI_OP_Check_C");
static_assert(sizeof(UBP_UI_OP_Check_C) == 0x0002E0, "Wrong size on UBP_UI_OP_Check_C");
static_assert(offsetof(UBP_UI_OP_Check_C, UberGraphFrame) == 0x000298, "Member 'UBP_UI_OP_Check_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Check_C, OPCheck) == 0x0002A0, "Member 'UBP_UI_OP_Check_C::OPCheck' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Check_C, TextBlock_0) == 0x0002A8, "Member 'UBP_UI_OP_Check_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Check_C, IsCheck) == 0x0002B0, "Member 'UBP_UI_OP_Check_C::IsCheck' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Check_C, CheckName) == 0x0002B8, "Member 'UBP_UI_OP_Check_C::CheckName' has a wrong offset!");
static_assert(offsetof(UBP_UI_OP_Check_C, OnChildCheckStateChangedEDisp) == 0x0002D0, "Member 'UBP_UI_OP_Check_C::OnChildCheckStateChangedEDisp' has a wrong offset!");

}

