#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_OP_Slider

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.OnSlideValueChangeDisp__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature final
{
public:
	int32                                         OutCurStep;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature) == 0x000004, "Wrong alignment on BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature");
static_assert(sizeof(BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature) == 0x000004, "Wrong size on BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature");
static_assert(offsetof(BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature, OutCurStep) == 0x000000, "Member 'BP_UI_OP_Slider_C_OnSlideValueChangeDisp__DelegateSignature::OutCurStep' has a wrong offset!");

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.InitCurStep
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_OP_Slider_C_InitCurStep final
{
public:
	double                                        TempSliderValue;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_InitCurStep) == 0x000008, "Wrong alignment on BP_UI_OP_Slider_C_InitCurStep");
static_assert(sizeof(BP_UI_OP_Slider_C_InitCurStep) == 0x000018, "Wrong size on BP_UI_OP_Slider_C_InitCurStep");
static_assert(offsetof(BP_UI_OP_Slider_C_InitCurStep, TempSliderValue) == 0x000000, "Member 'BP_UI_OP_Slider_C_InitCurStep::TempSliderValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_InitCurStep, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_UI_OP_Slider_C_InitCurStep::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_InitCurStep, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_UI_OP_Slider_C_InitCurStep::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_InitCurStep, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_UI_OP_Slider_C_InitCurStep::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.GetCurValueText
// 0x0020 (0x0020 - 0x0000)
struct BP_UI_OP_Slider_C_GetCurValueText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	int32                                         CallFunc_GetCurStep_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_GetCurValueText) == 0x000008, "Wrong alignment on BP_UI_OP_Slider_C_GetCurValueText");
static_assert(sizeof(BP_UI_OP_Slider_C_GetCurValueText) == 0x000020, "Wrong size on BP_UI_OP_Slider_C_GetCurValueText");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurValueText, ReturnValue) == 0x000000, "Member 'BP_UI_OP_Slider_C_GetCurValueText::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurValueText, CallFunc_GetCurStep_ReturnValue) == 0x000018, "Member 'BP_UI_OP_Slider_C_GetCurValueText::CallFunc_GetCurStep_ReturnValue' has a wrong offset!");

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.GetCurStep
// 0x0020 (0x0020 - 0x0000)
struct BP_UI_OP_Slider_C_GetCurStep final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_GetCurStep) == 0x000008, "Wrong alignment on BP_UI_OP_Slider_C_GetCurStep");
static_assert(sizeof(BP_UI_OP_Slider_C_GetCurStep) == 0x000020, "Wrong size on BP_UI_OP_Slider_C_GetCurStep");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, ReturnValue) == 0x000000, "Member 'BP_UI_OP_Slider_C_GetCurStep::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_UI_OP_Slider_C_GetCurStep::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_UI_OP_Slider_C_GetCurStep::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000010, "Member 'BP_UI_OP_Slider_C_GetCurStep::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, CallFunc_Round_ReturnValue) == 0x000018, "Member 'BP_UI_OP_Slider_C_GetCurStep::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_GetCurStep, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00001C, "Member 'BP_UI_OP_Slider_C_GetCurStep::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.ExecuteUbergraph_BP_UI_OP_Slider
// 0x0048 (0x0048 - 0x0000)
struct BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurStep_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_WideningCast;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_WideningCast;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_SliderValue_WideningCast;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider) == 0x000008, "Wrong alignment on BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider");
static_assert(sizeof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider) == 0x000048, "Wrong size on BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, EntryPoint) == 0x000000, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_GetCurStep_ReturnValue) == 0x000004, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_GetCurStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000014, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, K2Node_ComponentBoundEvent_Value) == 0x000028, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Divide_DoubleDouble_A_WideningCast) == 0x000030, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Divide_DoubleDouble_A_WideningCast' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, CallFunc_Divide_DoubleDouble_B_WideningCast) == 0x000038, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::CallFunc_Divide_DoubleDouble_B_WideningCast' has a wrong offset!");
static_assert(offsetof(BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider, K2Node_VariableSet_SliderValue_WideningCast) == 0x000040, "Member 'BP_UI_OP_Slider_C_ExecuteUbergraph_BP_UI_OP_Slider::K2Node_VariableSet_SliderValue_WideningCast' has a wrong offset!");

// Function BP_UI_OP_Slider.BP_UI_OP_Slider_C.BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'BP_UI_OP_Slider_C_BndEvt__OPSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

}

