#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ExceptionPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_ExceptionPanel.BP_UI_ExceptionPanel_C
// 0x0090 (0x0468 - 0x03D8)
class UBP_UI_ExceptionPanel_C final : public UBUI_ExceptionPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HideAll;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowOKFin;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG2;                                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CloseButton;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ConfirmBtn;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                CopyButton;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBlock;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBox;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBtn;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLine;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSInputActionIcon*                     InputIcon;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainBG;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 TextArea;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 TextUserConfig;                                    // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Warning;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                InputMgr;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_UI_ExceptionPanel_ConfirmBtn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CopyButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_UI_ExceptionPanel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_ExceptionPanel_C">();
	}
	static class UBP_UI_ExceptionPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_ExceptionPanel_C>();
	}
};
static_assert(alignof(UBP_UI_ExceptionPanel_C) == 0x000008, "Wrong alignment on UBP_UI_ExceptionPanel_C");
static_assert(sizeof(UBP_UI_ExceptionPanel_C) == 0x000468, "Wrong size on UBP_UI_ExceptionPanel_C");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, UberGraphFrame) == 0x0003D8, "Member 'UBP_UI_ExceptionPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, HideAll) == 0x0003E0, "Member 'UBP_UI_ExceptionPanel_C::HideAll' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ShowOKFin) == 0x0003E8, "Member 'UBP_UI_ExceptionPanel_C::ShowOKFin' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, BG) == 0x0003F0, "Member 'UBP_UI_ExceptionPanel_C::BG' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, BG2) == 0x0003F8, "Member 'UBP_UI_ExceptionPanel_C::BG2' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, CloseButton) == 0x000400, "Member 'UBP_UI_ExceptionPanel_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ConfirmBtn) == 0x000408, "Member 'UBP_UI_ExceptionPanel_C::ConfirmBtn' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, CopyButton) == 0x000410, "Member 'UBP_UI_ExceptionPanel_C::CopyButton' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ImgBlock) == 0x000418, "Member 'UBP_UI_ExceptionPanel_C::ImgBlock' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ImgBox) == 0x000420, "Member 'UBP_UI_ExceptionPanel_C::ImgBox' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ImgBtn) == 0x000428, "Member 'UBP_UI_ExceptionPanel_C::ImgBtn' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, ImgLine) == 0x000430, "Member 'UBP_UI_ExceptionPanel_C::ImgLine' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, InputIcon) == 0x000438, "Member 'UBP_UI_ExceptionPanel_C::InputIcon' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, MainBG) == 0x000440, "Member 'UBP_UI_ExceptionPanel_C::MainBG' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, TextArea) == 0x000448, "Member 'UBP_UI_ExceptionPanel_C::TextArea' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, TextUserConfig) == 0x000450, "Member 'UBP_UI_ExceptionPanel_C::TextUserConfig' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, Warning) == 0x000458, "Member 'UBP_UI_ExceptionPanel_C::Warning' has a wrong offset!");
static_assert(offsetof(UBP_UI_ExceptionPanel_C, InputMgr) == 0x000460, "Member 'UBP_UI_ExceptionPanel_C::InputMgr' has a wrong offset!");

}

