#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMSettingSlider

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UI_GMSettingSlider.BP_UI_GMSettingSlider_C.ExecuteUbergraph_BP_UI_GMSettingSlider
// 0x0018 (0x0018 - 0x0000)
struct BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OutCurStep;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 OutCurStep)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider) == 0x000004, "Wrong alignment on BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider");
static_assert(sizeof(BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider) == 0x000018, "Wrong size on BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider");
static_assert(offsetof(BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider, EntryPoint) == 0x000000, "Member 'BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider, K2Node_CustomEvent_OutCurStep) == 0x000004, "Member 'BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider::K2Node_CustomEvent_OutCurStep' has a wrong offset!");
static_assert(offsetof(BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_UI_GMSettingSlider_C_ExecuteUbergraph_BP_UI_GMSettingSlider::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_UI_GMSettingSlider.BP_UI_GMSettingSlider_C.EventOnSlideChange
// 0x0004 (0x0004 - 0x0000)
struct BP_UI_GMSettingSlider_C_EventOnSlideChange final
{
public:
	int32                                         OutCurStep;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UI_GMSettingSlider_C_EventOnSlideChange) == 0x000004, "Wrong alignment on BP_UI_GMSettingSlider_C_EventOnSlideChange");
static_assert(sizeof(BP_UI_GMSettingSlider_C_EventOnSlideChange) == 0x000004, "Wrong size on BP_UI_GMSettingSlider_C_EventOnSlideChange");
static_assert(offsetof(BP_UI_GMSettingSlider_C_EventOnSlideChange, OutCurStep) == 0x000000, "Member 'BP_UI_GMSettingSlider_C_EventOnSlideChange::OutCurStep' has a wrong offset!");

}

