#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMInfoPartInfo

#include "Basic.hpp"

#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_GMInfoPartInfo.BP_UI_GMInfoPartInfo_C
// 0x0028 (0x0400 - 0x03D8)
class UBP_UI_GMInfoPartInfo_C final : public UBUI_Widget
{
public:
	class UImage*                                 BG_0;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_1;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_2;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_3;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_4;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_GMInfoPartInfo_C">();
	}
	static class UBP_UI_GMInfoPartInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_GMInfoPartInfo_C>();
	}
};
static_assert(alignof(UBP_UI_GMInfoPartInfo_C) == 0x000008, "Wrong alignment on UBP_UI_GMInfoPartInfo_C");
static_assert(sizeof(UBP_UI_GMInfoPartInfo_C) == 0x000400, "Wrong size on UBP_UI_GMInfoPartInfo_C");
static_assert(offsetof(UBP_UI_GMInfoPartInfo_C, BG_0) == 0x0003D8, "Member 'UBP_UI_GMInfoPartInfo_C::BG_0' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfoPartInfo_C, BG_1) == 0x0003E0, "Member 'UBP_UI_GMInfoPartInfo_C::BG_1' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfoPartInfo_C, BG_2) == 0x0003E8, "Member 'UBP_UI_GMInfoPartInfo_C::BG_2' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfoPartInfo_C, BG_3) == 0x0003F0, "Member 'UBP_UI_GMInfoPartInfo_C::BG_3' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfoPartInfo_C, BG_4) == 0x0003F8, "Member 'UBP_UI_GMInfoPartInfo_C::BG_4' has a wrong offset!");

}

