#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_GMInfo_Enemy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UI_GMInfo_Enemy.BP_UI_GMInfo_Enemy_C
// 0x0020 (0x0408 - 0x03E8)
class UBP_UI_GMInfo_Enemy_C final : public UBUI_GMInfo_Enemy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_1;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_2;                                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InfoBG;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_BP_UI_GMInfo_Enemy(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_GMInfo_Enemy_C">();
	}
	static class UBP_UI_GMInfo_Enemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UI_GMInfo_Enemy_C>();
	}
};
static_assert(alignof(UBP_UI_GMInfo_Enemy_C) == 0x000008, "Wrong alignment on UBP_UI_GMInfo_Enemy_C");
static_assert(sizeof(UBP_UI_GMInfo_Enemy_C) == 0x000408, "Wrong size on UBP_UI_GMInfo_Enemy_C");
static_assert(offsetof(UBP_UI_GMInfo_Enemy_C, UberGraphFrame) == 0x0003E8, "Member 'UBP_UI_GMInfo_Enemy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfo_Enemy_C, BG_1) == 0x0003F0, "Member 'UBP_UI_GMInfo_Enemy_C::BG_1' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfo_Enemy_C, BG_2) == 0x0003F8, "Member 'UBP_UI_GMInfo_Enemy_C::BG_2' has a wrong offset!");
static_assert(offsetof(UBP_UI_GMInfo_Enemy_C, InfoBG) == 0x000400, "Member 'UBP_UI_GMInfo_Enemy_C::InfoBG' has a wrong offset!");

}

