#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUI_StartGame

#include "Basic.hpp"


namespace SDK::Params
{

// Function BUI_StartGame.BUI_StartGame_C.SequenceEvent__ENTRYPOINTBUI_StartGame_5
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5) == 0x000008, "Wrong alignment on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5");
static_assert(sizeof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5) == 0x000008, "Wrong size on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5");
static_assert(offsetof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_5::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.SequenceEvent__ENTRYPOINTBUI_StartGame_4
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4) == 0x000008, "Wrong alignment on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4");
static_assert(sizeof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4) == 0x000008, "Wrong size on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4");
static_assert(offsetof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_4::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.SequenceEvent__ENTRYPOINTBUI_StartGame_3
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3) == 0x000008, "Wrong alignment on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3");
static_assert(sizeof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3) == 0x000008, "Wrong size on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3");
static_assert(offsetof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_3::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.SequenceEvent__ENTRYPOINTBUI_StartGame_2
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2) == 0x000008, "Wrong alignment on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2");
static_assert(sizeof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2) == 0x000008, "Wrong size on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2");
static_assert(offsetof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_2::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.SequenceEvent__ENTRYPOINTBUI_StartGame_1
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1) == 0x000008, "Wrong alignment on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1");
static_assert(sizeof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1) == 0x000008, "Wrong size on BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1");
static_assert(offsetof(BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_SequenceEvent__ENTRYPOINTBUI_StartGame_1::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BUI_StartGame_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_PreConstruct) == 0x000001, "Wrong alignment on BUI_StartGame_C_PreConstruct");
static_assert(sizeof(BUI_StartGame_C_PreConstruct) == 0x000001, "Wrong size on BUI_StartGame_C_PreConstruct");
static_assert(offsetof(BUI_StartGame_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BUI_StartGame_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.NINS_smokebg_Event_3
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_NINS_smokebg_Event_3 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_NINS_smokebg_Event_3) == 0x000008, "Wrong alignment on BUI_StartGame_C_NINS_smokebg_Event_3");
static_assert(sizeof(BUI_StartGame_C_NINS_smokebg_Event_3) == 0x000008, "Wrong size on BUI_StartGame_C_NINS_smokebg_Event_3");
static_assert(offsetof(BUI_StartGame_C_NINS_smokebg_Event_3, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_NINS_smokebg_Event_3::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.NINS_smokebg_Event_2
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_NINS_smokebg_Event_2 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_NINS_smokebg_Event_2) == 0x000008, "Wrong alignment on BUI_StartGame_C_NINS_smokebg_Event_2");
static_assert(sizeof(BUI_StartGame_C_NINS_smokebg_Event_2) == 0x000008, "Wrong size on BUI_StartGame_C_NINS_smokebg_Event_2");
static_assert(offsetof(BUI_StartGame_C_NINS_smokebg_Event_2, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_NINS_smokebg_Event_2::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.NINS_smokebg_Event_1
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_NINS_smokebg_Event_1 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_NINS_smokebg_Event_1) == 0x000008, "Wrong alignment on BUI_StartGame_C_NINS_smokebg_Event_1");
static_assert(sizeof(BUI_StartGame_C_NINS_smokebg_Event_1) == 0x000008, "Wrong size on BUI_StartGame_C_NINS_smokebg_Event_1");
static_assert(offsetof(BUI_StartGame_C_NINS_smokebg_Event_1, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_NINS_smokebg_Event_1::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.NINS_smokebg_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BUI_StartGame_C_NINS_smokebg_Event_0 final
{
public:
	class UNiagaraSystemWidget*                   NINS_smokebg_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_NINS_smokebg_Event_0) == 0x000008, "Wrong alignment on BUI_StartGame_C_NINS_smokebg_Event_0");
static_assert(sizeof(BUI_StartGame_C_NINS_smokebg_Event_0) == 0x000008, "Wrong size on BUI_StartGame_C_NINS_smokebg_Event_0");
static_assert(offsetof(BUI_StartGame_C_NINS_smokebg_Event_0, NINS_smokebg_0) == 0x000000, "Member 'BUI_StartGame_C_NINS_smokebg_Event_0::NINS_smokebg_0' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.ExecuteUbergraph_BUI_StartGame
// 0x0060 (0x0060 - 0x0000)
struct BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_EventName_2;                    // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_NINS_smokebg_3;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_NINS_smokebg_2;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_NINS_smokebg_1;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   K2Node_CustomEvent_NINS_smokebg;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName_1;                    // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_EventName;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame) == 0x000008, "Wrong alignment on BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame");
static_assert(sizeof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame) == 0x000060, "Wrong size on BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, EntryPoint) == 0x000000, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::EntryPoint' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_EventName_2) == 0x000008, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_EventName_2' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_NINS_smokebg_3) == 0x000018, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_NINS_smokebg_3' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_NINS_smokebg_2) == 0x000020, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_NINS_smokebg_2' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_NINS_smokebg_1) == 0x000028, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_NINS_smokebg_1' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_NINS_smokebg) == 0x000030, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_NINS_smokebg' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_EventName_1) == 0x000038, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_EventName_1' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_CustomEvent_EventName) == 0x000048, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_CustomEvent_EventName' has a wrong offset!");
static_assert(offsetof(BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame, K2Node_Event_IsDesignTime) == 0x000058, "Member 'BUI_StartGame_C_ExecuteUbergraph_BUI_StartGame::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.AnimPressAnyKeySeqEvent
// 0x0010 (0x0010 - 0x0000)
struct BUI_StartGame_C_AnimPressAnyKeySeqEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_AnimPressAnyKeySeqEvent) == 0x000008, "Wrong alignment on BUI_StartGame_C_AnimPressAnyKeySeqEvent");
static_assert(sizeof(BUI_StartGame_C_AnimPressAnyKeySeqEvent) == 0x000010, "Wrong size on BUI_StartGame_C_AnimPressAnyKeySeqEvent");
static_assert(offsetof(BUI_StartGame_C_AnimPressAnyKeySeqEvent, EventName) == 0x000000, "Member 'BUI_StartGame_C_AnimPressAnyKeySeqEvent::EventName' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.AnimPressAnyKeyEvent
// 0x0010 (0x0010 - 0x0000)
struct BUI_StartGame_C_AnimPressAnyKeyEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_AnimPressAnyKeyEvent) == 0x000008, "Wrong alignment on BUI_StartGame_C_AnimPressAnyKeyEvent");
static_assert(sizeof(BUI_StartGame_C_AnimPressAnyKeyEvent) == 0x000010, "Wrong size on BUI_StartGame_C_AnimPressAnyKeyEvent");
static_assert(offsetof(BUI_StartGame_C_AnimPressAnyKeyEvent, EventName) == 0x000000, "Member 'BUI_StartGame_C_AnimPressAnyKeyEvent::EventName' has a wrong offset!");

// Function BUI_StartGame.BUI_StartGame_C.AnimNonePAKEvent
// 0x0010 (0x0010 - 0x0000)
struct BUI_StartGame_C_AnimNonePAKEvent final
{
public:
	class FString                                 EventName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BUI_StartGame_C_AnimNonePAKEvent) == 0x000008, "Wrong alignment on BUI_StartGame_C_AnimNonePAKEvent");
static_assert(sizeof(BUI_StartGame_C_AnimNonePAKEvent) == 0x000010, "Wrong size on BUI_StartGame_C_AnimNonePAKEvent");
static_assert(offsetof(BUI_StartGame_C_AnimNonePAKEvent, EventName) == 0x000000, "Member 'BUI_StartGame_C_AnimNonePAKEvent::EventName' has a wrong offset!");

}

