#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUI_StartGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BUI_StartGame.BUI_StartGame_C
// 0x0160 (0x0538 - 0x03D8)
class UBUI_StartGame_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       TestC;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TextB;                                             // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEnterStart_0;                                  // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TestA;                                             // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimNonePAK;                                       // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimNonePAKSeq;                                    // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimPressAnyKey;                                   // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimPressAnyKeySeq;                                // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimStartGame;                                     // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimStartGameSeq;                                  // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBLogoColor;                                      // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBRoam;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBContinueBtn;                                  // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowHide;                                      // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimEnterStart;                                    // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBI_AgeTips_C*                          BI_AgeTips;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_FirstStartBtn_C*                    BI_FirstStartBtn;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_InputRoot_C*                        BI_InputRoot;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_0;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_1;                                 // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_2;                                 // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_3;                                 // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_4;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_5;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_6;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_7;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_8;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_StartGame_C*                        BI_StartGameBtn_9;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_BattleEnd_Action_C*                 ButtonA;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_252;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBlack;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLine;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgTitleBg;                                        // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoginLoadingBgLetter;                              // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NINS_smokebg;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNiagaraSystemWidget*                   NINS_smokefb;                                      // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayerIcon;                                        // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RecordBgN;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RTxtTips;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Restore_State;                                     // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTBUI_StartGame_9();
	void SequenceEvent__ENTRYPOINTBUI_StartGame_8();
	void SequenceEvent__ENTRYPOINTBUI_StartGame_7();
	void SequenceEvent__ENTRYPOINTBUI_StartGame_6();
	void SequenceEvent__ENTRYPOINTBUI_StartGame_5(class UNiagaraSystemWidget* NINS_smokebg_0);
	void SequenceEvent__ENTRYPOINTBUI_StartGame_4(class UNiagaraSystemWidget* NINS_smokebg_0);
	void SequenceEvent__ENTRYPOINTBUI_StartGame_3(class UNiagaraSystemWidget* NINS_smokebg_0);
	void SequenceEvent__ENTRYPOINTBUI_StartGame_2(class UNiagaraSystemWidget* NINS_smokebg_0);
	void SequenceEvent__ENTRYPOINTBUI_StartGame_10();
	void SequenceEvent__ENTRYPOINTBUI_StartGame_1(class UNiagaraSystemWidget* NINS_smokebg_0);
	void SequenceEvent__ENTRYPOINTBUI_StartGame_0();
	void PreConstruct(bool IsDesignTime);
	void NINS_smokebg_Event_3(class UNiagaraSystemWidget* NINS_smokebg_0);
	void NINS_smokebg_Event_2(class UNiagaraSystemWidget* NINS_smokebg_0);
	void NINS_smokebg_Event_1(class UNiagaraSystemWidget* NINS_smokebg_0);
	void NINS_smokebg_Event_0(class UNiagaraSystemWidget* NINS_smokebg_0);
	void ExecuteUbergraph_BUI_StartGame(int32 EntryPoint);
	void Construct();
	void AnimPressAnyKeySeqEvent(const class FString& EventName);
	void AnimPressAnyKeyEvent(const class FString& EventName);
	void AnimNonePAKEvent(const class FString& EventName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUI_StartGame_C">();
	}
	static class UBUI_StartGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUI_StartGame_C>();
	}
};
static_assert(alignof(UBUI_StartGame_C) == 0x000008, "Wrong alignment on UBUI_StartGame_C");
static_assert(sizeof(UBUI_StartGame_C) == 0x000538, "Wrong size on UBUI_StartGame_C");
static_assert(offsetof(UBUI_StartGame_C, UberGraphFrame) == 0x0003D8, "Member 'UBUI_StartGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, TestC) == 0x0003E0, "Member 'UBUI_StartGame_C::TestC' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, TextB) == 0x0003E8, "Member 'UBUI_StartGame_C::TextB' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimEnterStart_0) == 0x0003F0, "Member 'UBUI_StartGame_C::AnimEnterStart_0' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, NewAnimation_1) == 0x0003F8, "Member 'UBUI_StartGame_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, TestA) == 0x000400, "Member 'UBUI_StartGame_C::TestA' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000408, "Member 'UBUI_StartGame_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimNonePAK) == 0x000410, "Member 'UBUI_StartGame_C::AnimNonePAK' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimNonePAKSeq) == 0x000418, "Member 'UBUI_StartGame_C::AnimNonePAKSeq' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimPressAnyKey) == 0x000420, "Member 'UBUI_StartGame_C::AnimPressAnyKey' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimPressAnyKeySeq) == 0x000428, "Member 'UBUI_StartGame_C::AnimPressAnyKeySeq' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimStartGame) == 0x000430, "Member 'UBUI_StartGame_C::AnimStartGame' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimStartGameSeq) == 0x000438, "Member 'UBUI_StartGame_C::AnimStartGameSeq' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AKBLogoColor) == 0x000440, "Member 'UBUI_StartGame_C::AKBLogoColor' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, GSAKBRoam) == 0x000448, "Member 'UBUI_StartGame_C::GSAKBRoam' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, GSAKBContinueBtn) == 0x000450, "Member 'UBUI_StartGame_C::GSAKBContinueBtn' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimShowHide) == 0x000458, "Member 'UBUI_StartGame_C::AnimShowHide' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, AnimEnterStart) == 0x000460, "Member 'UBUI_StartGame_C::AnimEnterStart' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_AgeTips) == 0x000468, "Member 'UBUI_StartGame_C::BI_AgeTips' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_FirstStartBtn) == 0x000470, "Member 'UBUI_StartGame_C::BI_FirstStartBtn' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_InputRoot) == 0x000478, "Member 'UBUI_StartGame_C::BI_InputRoot' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_0) == 0x000480, "Member 'UBUI_StartGame_C::BI_StartGameBtn_0' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_1) == 0x000488, "Member 'UBUI_StartGame_C::BI_StartGameBtn_1' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_2) == 0x000490, "Member 'UBUI_StartGame_C::BI_StartGameBtn_2' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_3) == 0x000498, "Member 'UBUI_StartGame_C::BI_StartGameBtn_3' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_4) == 0x0004A0, "Member 'UBUI_StartGame_C::BI_StartGameBtn_4' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_5) == 0x0004A8, "Member 'UBUI_StartGame_C::BI_StartGameBtn_5' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_6) == 0x0004B0, "Member 'UBUI_StartGame_C::BI_StartGameBtn_6' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_7) == 0x0004B8, "Member 'UBUI_StartGame_C::BI_StartGameBtn_7' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_8) == 0x0004C0, "Member 'UBUI_StartGame_C::BI_StartGameBtn_8' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, BI_StartGameBtn_9) == 0x0004C8, "Member 'UBUI_StartGame_C::BI_StartGameBtn_9' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, ButtonA) == 0x0004D0, "Member 'UBUI_StartGame_C::ButtonA' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, Image_252) == 0x0004D8, "Member 'UBUI_StartGame_C::Image_252' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, ImgBlack) == 0x0004E0, "Member 'UBUI_StartGame_C::ImgBlack' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, ImgLine) == 0x0004E8, "Member 'UBUI_StartGame_C::ImgLine' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, ImgTitleBg) == 0x0004F0, "Member 'UBUI_StartGame_C::ImgTitleBg' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, LoginLoadingBgLetter) == 0x0004F8, "Member 'UBUI_StartGame_C::LoginLoadingBgLetter' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, Logo) == 0x000500, "Member 'UBUI_StartGame_C::Logo' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, NINS_smokebg) == 0x000508, "Member 'UBUI_StartGame_C::NINS_smokebg' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, NINS_smokefb) == 0x000510, "Member 'UBUI_StartGame_C::NINS_smokefb' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, PlayerIcon) == 0x000518, "Member 'UBUI_StartGame_C::PlayerIcon' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, RecordBgN) == 0x000520, "Member 'UBUI_StartGame_C::RecordBgN' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, RTxtTips) == 0x000528, "Member 'UBUI_StartGame_C::RTxtTips' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, NewVar_0) == 0x000530, "Member 'UBUI_StartGame_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBUI_StartGame_C, Restore_State) == 0x000534, "Member 'UBUI_StartGame_C::Restore_State' has a wrong offset!");

}

