#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BUI_EquipMain

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "b1MinusManaged_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BUI_EquipMain.BUI_EquipMain_C
// 0x01C0 (0x0598 - 0x03D8)
class UBUI_EquipMain_C final : public UBUI_Widget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimSubShowHide_0;                                 // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       _Test_AnimShowHide;                                // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AKBSlotTitle;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimRefreshSubTab;                                 // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStatePageEquip;                               // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GSAKBStatePage;                                    // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus; // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimObsMode;                                       // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimSubShowHide;                                   // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AnimShowHide;                                      // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BarEquipTitle;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarHuluTitle;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarJewelryRedpoint;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarJewelryTitle;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BarQuickItemTitle;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BgEquip;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_CommSubTab_C*                       BI_CommSubTab;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipDetailCompare_C*               BI_EquipDetailCompare;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipQuickSlot_C*                   BI_EquipQuickSlot;                                 // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_1;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_2;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_3;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_4;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_5;                                // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_Slot_C*                   BI_EquipSlotItem_6;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_EquipItem_RZDSlot_C*                BI_EquipSlotItem_7;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_8;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_9;                                // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_10;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_11;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_12;                               // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_GearItem_Slot_C*                    BI_EquipSlotItem_13;                               // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_HuluDetail_C*                       BI_HuluDetail;                                     // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_InputRoot_C*                        BI_InputRoot;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_ItemStory_C*                        BI_ItemStory;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_JewelryDetail_C*                    BI_JewelryDetail;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_JewelrySlotDetail_C*                BI_JewelrySlotDetail;                              // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_RoleAttr_V3_C*                      BI_RoleAttr;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_RZDDetail_C*                        BI_RZDDetail;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_Sorting_C*                          BI_Sorting;                                        // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_SubTabJewelry_C*                    BI_SubTabJewelry;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_TileView_C*                         BI_TileView;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBI_TreasureDetail_C*                   BI_TreasureDetail;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DebugCover;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBG;                                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class b1MinusManaged::UGSRetainerBox*         ListMask;                                          // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkerJewelry;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MarkerSlotType;                                    // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SubTitleBar;                                       // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtEquipTitleRuby;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtHuluTitleRuby;                                  // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtJewelryTitleRuby;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGSRichScaleText*                       TxtQuickItemTitleRuby;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_9();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_8();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_7();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_6();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_5();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_4();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_3();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_2();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_10();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_1();
	void SequenceEvent__ENTRYPOINTBUI_EquipMain_0();
	void SeqEvent_AnimObsMode(const class FString& EventName);
	void SeqAnim_SubShow();
	void SeqAnim_SubHide();
	void SeqAnim_Show();
	void SeqAnim_ObsUnfold();
	void SeqAnim_ObsFold();
	void SeqAnim_Hide();
	void ExecuteUbergraph_BUI_EquipMain(int32 EntryPoint);
	class UWidget* DoCustomNavigation_0(EUINavigation Navigation_0);
	void DebugShowSub();
	void DebugShow();
	void DebugHideSub();
	void DebugHide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BUI_EquipMain_C">();
	}
	static class UBUI_EquipMain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBUI_EquipMain_C>();
	}
};
static_assert(alignof(UBUI_EquipMain_C) == 0x000008, "Wrong alignment on UBUI_EquipMain_C");
static_assert(sizeof(UBUI_EquipMain_C) == 0x000598, "Wrong size on UBUI_EquipMain_C");
static_assert(offsetof(UBUI_EquipMain_C, UberGraphFrame) == 0x0003D8, "Member 'UBUI_EquipMain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AnimSubShowHide_0) == 0x0003E0, "Member 'UBUI_EquipMain_C::AnimSubShowHide_0' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, _Test_AnimShowHide) == 0x0003E8, "Member 'UBUI_EquipMain_C::_Test_AnimShowHide' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x0003F0, "Member 'UBUI_EquipMain_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AKBSlotTitle) == 0x0003F8, "Member 'UBUI_EquipMain_C::AKBSlotTitle' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000400, "Member 'UBUI_EquipMain_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AnimRefreshSubTab) == 0x000408, "Member 'UBUI_EquipMain_C::AnimRefreshSubTab' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, GSAKBStatePageEquip) == 0x000410, "Member 'UBUI_EquipMain_C::GSAKBStatePageEquip' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, GSAKBStatePage) == 0x000418, "Member 'UBUI_EquipMain_C::GSAKBStatePage' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus) == 0x000420, "Member 'UBUI_EquipMain_C::MinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinusMinus' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AnimObsMode) == 0x000428, "Member 'UBUI_EquipMain_C::AnimObsMode' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AnimSubShowHide) == 0x000430, "Member 'UBUI_EquipMain_C::AnimSubShowHide' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, AnimShowHide) == 0x000438, "Member 'UBUI_EquipMain_C::AnimShowHide' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BarEquipTitle) == 0x000440, "Member 'UBUI_EquipMain_C::BarEquipTitle' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BarHuluTitle) == 0x000448, "Member 'UBUI_EquipMain_C::BarHuluTitle' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BarJewelryRedpoint) == 0x000450, "Member 'UBUI_EquipMain_C::BarJewelryRedpoint' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BarJewelryTitle) == 0x000458, "Member 'UBUI_EquipMain_C::BarJewelryTitle' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BarQuickItemTitle) == 0x000460, "Member 'UBUI_EquipMain_C::BarQuickItemTitle' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BgEquip) == 0x000468, "Member 'UBUI_EquipMain_C::BgEquip' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_CommSubTab) == 0x000470, "Member 'UBUI_EquipMain_C::BI_CommSubTab' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipDetailCompare) == 0x000478, "Member 'UBUI_EquipMain_C::BI_EquipDetailCompare' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipQuickSlot) == 0x000480, "Member 'UBUI_EquipMain_C::BI_EquipQuickSlot' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_1) == 0x000488, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_1' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_2) == 0x000490, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_2' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_3) == 0x000498, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_3' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_4) == 0x0004A0, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_4' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_5) == 0x0004A8, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_5' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_6) == 0x0004B0, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_6' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_7) == 0x0004B8, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_7' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_8) == 0x0004C0, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_8' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_9) == 0x0004C8, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_9' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_10) == 0x0004D0, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_10' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_11) == 0x0004D8, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_11' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_12) == 0x0004E0, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_12' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_EquipSlotItem_13) == 0x0004E8, "Member 'UBUI_EquipMain_C::BI_EquipSlotItem_13' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_HuluDetail) == 0x0004F0, "Member 'UBUI_EquipMain_C::BI_HuluDetail' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_InputRoot) == 0x0004F8, "Member 'UBUI_EquipMain_C::BI_InputRoot' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_ItemStory) == 0x000500, "Member 'UBUI_EquipMain_C::BI_ItemStory' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_JewelryDetail) == 0x000508, "Member 'UBUI_EquipMain_C::BI_JewelryDetail' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_JewelrySlotDetail) == 0x000510, "Member 'UBUI_EquipMain_C::BI_JewelrySlotDetail' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_RoleAttr) == 0x000518, "Member 'UBUI_EquipMain_C::BI_RoleAttr' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_RZDDetail) == 0x000520, "Member 'UBUI_EquipMain_C::BI_RZDDetail' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_Sorting) == 0x000528, "Member 'UBUI_EquipMain_C::BI_Sorting' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_SubTabJewelry) == 0x000530, "Member 'UBUI_EquipMain_C::BI_SubTabJewelry' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_TileView) == 0x000538, "Member 'UBUI_EquipMain_C::BI_TileView' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, BI_TreasureDetail) == 0x000540, "Member 'UBUI_EquipMain_C::BI_TreasureDetail' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, DebugCover) == 0x000548, "Member 'UBUI_EquipMain_C::DebugCover' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, ImgBG) == 0x000550, "Member 'UBUI_EquipMain_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, ListMask) == 0x000558, "Member 'UBUI_EquipMain_C::ListMask' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, MarkerJewelry) == 0x000560, "Member 'UBUI_EquipMain_C::MarkerJewelry' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, MarkerSlotType) == 0x000568, "Member 'UBUI_EquipMain_C::MarkerSlotType' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, SubTitleBar) == 0x000570, "Member 'UBUI_EquipMain_C::SubTitleBar' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, TxtEquipTitleRuby) == 0x000578, "Member 'UBUI_EquipMain_C::TxtEquipTitleRuby' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, TxtHuluTitleRuby) == 0x000580, "Member 'UBUI_EquipMain_C::TxtHuluTitleRuby' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, TxtJewelryTitleRuby) == 0x000588, "Member 'UBUI_EquipMain_C::TxtJewelryTitleRuby' has a wrong offset!");
static_assert(offsetof(UBUI_EquipMain_C, TxtQuickItemTitleRuby) == 0x000590, "Member 'UBUI_EquipMain_C::TxtQuickItemTitleRuby' has a wrong offset!");

}

