#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalliopeWin64

#include "Basic.hpp"


namespace SDK::Params
{

// Function CalliopeWin64.CalliopeMoviePipelineSetting.AfterLevelSequenceActorInitializedCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS) == 0x000008, "Wrong alignment on CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS");
static_assert(sizeof(CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS) == 0x000008, "Wrong size on CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS");
static_assert(offsetof(CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS, InPipeline) == 0x000000, "Member 'CalliopeMoviePipelineSetting_AfterLevelSequenceActorInitializedCS::InPipeline' has a wrong offset!");

// Function CalliopeWin64.CalliopeMoviePipelineSetting.SequenceBindActorsByTag
// 0x0058 (0x0058 - 0x0000)
struct CalliopeMoviePipelineSetting_SequenceBindActorsByTag final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class AActor*>              TagActors;                                         // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeMoviePipelineSetting_SequenceBindActorsByTag) == 0x000008, "Wrong alignment on CalliopeMoviePipelineSetting_SequenceBindActorsByTag");
static_assert(sizeof(CalliopeMoviePipelineSetting_SequenceBindActorsByTag) == 0x000058, "Wrong size on CalliopeMoviePipelineSetting_SequenceBindActorsByTag");
static_assert(offsetof(CalliopeMoviePipelineSetting_SequenceBindActorsByTag, InPipeline) == 0x000000, "Member 'CalliopeMoviePipelineSetting_SequenceBindActorsByTag::InPipeline' has a wrong offset!");
static_assert(offsetof(CalliopeMoviePipelineSetting_SequenceBindActorsByTag, TagActors) == 0x000008, "Member 'CalliopeMoviePipelineSetting_SequenceBindActorsByTag::TagActors' has a wrong offset!");

// Function CalliopeWin64.CalliopeMoviePipelineSetting.SetupForPipelineCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_SetupForPipelineCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeMoviePipelineSetting_SetupForPipelineCS) == 0x000008, "Wrong alignment on CalliopeMoviePipelineSetting_SetupForPipelineCS");
static_assert(sizeof(CalliopeMoviePipelineSetting_SetupForPipelineCS) == 0x000008, "Wrong size on CalliopeMoviePipelineSetting_SetupForPipelineCS");
static_assert(offsetof(CalliopeMoviePipelineSetting_SetupForPipelineCS, InPipeline) == 0x000000, "Member 'CalliopeMoviePipelineSetting_SetupForPipelineCS::InPipeline' has a wrong offset!");

// Function CalliopeWin64.CalliopeMoviePipelineSetting.TeardownForPipelineCS
// 0x0008 (0x0008 - 0x0000)
struct CalliopeMoviePipelineSetting_TeardownForPipelineCS final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeMoviePipelineSetting_TeardownForPipelineCS) == 0x000008, "Wrong alignment on CalliopeMoviePipelineSetting_TeardownForPipelineCS");
static_assert(sizeof(CalliopeMoviePipelineSetting_TeardownForPipelineCS) == 0x000008, "Wrong size on CalliopeMoviePipelineSetting_TeardownForPipelineCS");
static_assert(offsetof(CalliopeMoviePipelineSetting_TeardownForPipelineCS, InPipeline) == 0x000000, "Member 'CalliopeMoviePipelineSetting_TeardownForPipelineCS::InPipeline' has a wrong offset!");

// Function CalliopeWin64.CalliopeMoviePipelineSetting.GetSequenceBindingTags
// 0x0060 (0x0060 - 0x0000)
struct CalliopeMoviePipelineSetting_GetSequenceBindingTags final
{
public:
	class UMoviePipeline*                         InPipeline;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             OutBindingTags;                                    // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeMoviePipelineSetting_GetSequenceBindingTags) == 0x000008, "Wrong alignment on CalliopeMoviePipelineSetting_GetSequenceBindingTags");
static_assert(sizeof(CalliopeMoviePipelineSetting_GetSequenceBindingTags) == 0x000060, "Wrong size on CalliopeMoviePipelineSetting_GetSequenceBindingTags");
static_assert(offsetof(CalliopeMoviePipelineSetting_GetSequenceBindingTags, InPipeline) == 0x000000, "Member 'CalliopeMoviePipelineSetting_GetSequenceBindingTags::InPipeline' has a wrong offset!");
static_assert(offsetof(CalliopeMoviePipelineSetting_GetSequenceBindingTags, OutBindingTags) == 0x000008, "Member 'CalliopeMoviePipelineSetting_GetSequenceBindingTags::OutBindingTags' has a wrong offset!");
static_assert(offsetof(CalliopeMoviePipelineSetting_GetSequenceBindingTags, ReturnValue) == 0x000058, "Member 'CalliopeMoviePipelineSetting_GetSequenceBindingTags::ReturnValue' has a wrong offset!");

// Function CalliopeWin64.CalliopeMoviePipelineSetting.IgnoreTransientFiltersCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS) == 0x000001, "Wrong alignment on CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS");
static_assert(sizeof(CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS) == 0x000001, "Wrong size on CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS");
static_assert(offsetof(CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS, ReturnValue) == 0x000000, "Member 'CalliopeMoviePipelineSetting_IgnoreTransientFiltersCS::ReturnValue' has a wrong offset!");

}

