#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Calliope

#include "Basic.hpp"

#include "Calliope_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "LevelSequence_structs.hpp"


namespace SDK::Params
{

// Function Calliope.CalliopeAsset.CreateInstance
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_CreateInstance final
{
public:
	class UObject*                                Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         CalliopeAsset;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InstancePrefixName;                                // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_CreateInstance) == 0x000008, "Wrong alignment on CalliopeAsset_CreateInstance");
static_assert(sizeof(CalliopeAsset_CreateInstance) == 0x000028, "Wrong size on CalliopeAsset_CreateInstance");
static_assert(offsetof(CalliopeAsset_CreateInstance, Owner) == 0x000000, "Member 'CalliopeAsset_CreateInstance::Owner' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_CreateInstance, CalliopeAsset) == 0x000008, "Member 'CalliopeAsset_CreateInstance::CalliopeAsset' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_CreateInstance, InstancePrefixName) == 0x000010, "Member 'CalliopeAsset_CreateInstance::InstancePrefixName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_CreateInstance, ReturnValue) == 0x000020, "Member 'CalliopeAsset_CreateInstance::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.AddBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_AddBranchGraph final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_AddBranchGraph) == 0x000004, "Wrong alignment on CalliopeAsset_AddBranchGraph");
static_assert(sizeof(CalliopeAsset_AddBranchGraph) == 0x000008, "Wrong size on CalliopeAsset_AddBranchGraph");
static_assert(offsetof(CalliopeAsset_AddBranchGraph, GraphName) == 0x000000, "Member 'CalliopeAsset_AddBranchGraph::GraphName' has a wrong offset!");

// Function Calliope.CalliopeAsset.AddParameter
// 0x0048 (0x0048 - 0x0000)
struct CalliopeAsset_AddParameter final
{
public:
	EGsManagedParamType                           ParamType;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectPath;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x0028(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         State;                                             // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          OutConfigGuid;                                     // 0x0034(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_AddParameter) == 0x000008, "Wrong alignment on CalliopeAsset_AddParameter");
static_assert(sizeof(CalliopeAsset_AddParameter) == 0x000048, "Wrong size on CalliopeAsset_AddParameter");
static_assert(offsetof(CalliopeAsset_AddParameter, ParamType) == 0x000000, "Member 'CalliopeAsset_AddParameter::ParamType' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, ObjectPath) == 0x000008, "Member 'CalliopeAsset_AddParameter::ObjectPath' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, ActorGuid) == 0x000018, "Member 'CalliopeAsset_AddParameter::ActorGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, AliasName) == 0x000028, "Member 'CalliopeAsset_AddParameter::AliasName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, State) == 0x000030, "Member 'CalliopeAsset_AddParameter::State' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, OutConfigGuid) == 0x000034, "Member 'CalliopeAsset_AddParameter::OutConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AddParameter, ReturnValue) == 0x000044, "Member 'CalliopeAsset_AddParameter::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.AssignParameterUnitTamerReference
// 0x0020 (0x0020 - 0x0000)
struct CalliopeAsset_AssignParameterUnitTamerReference final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ObjectPath;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_AssignParameterUnitTamerReference) == 0x000008, "Wrong alignment on CalliopeAsset_AssignParameterUnitTamerReference");
static_assert(sizeof(CalliopeAsset_AssignParameterUnitTamerReference) == 0x000020, "Wrong size on CalliopeAsset_AssignParameterUnitTamerReference");
static_assert(offsetof(CalliopeAsset_AssignParameterUnitTamerReference, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_AssignParameterUnitTamerReference::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_AssignParameterUnitTamerReference, ObjectPath) == 0x000010, "Member 'CalliopeAsset_AssignParameterUnitTamerReference::ObjectPath' has a wrong offset!");

// Function Calliope.CalliopeAsset.DeactivateNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_DeactivateNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_DeactivateNode) == 0x000004, "Wrong alignment on CalliopeAsset_DeactivateNode");
static_assert(sizeof(CalliopeAsset_DeactivateNode) == 0x000010, "Wrong size on CalliopeAsset_DeactivateNode");
static_assert(offsetof(CalliopeAsset_DeactivateNode, InGuid) == 0x000000, "Member 'CalliopeAsset_DeactivateNode::InGuid' has a wrong offset!");

// Function Calliope.CalliopeAsset.ExportToData
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_ExportToData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_ExportToData) == 0x000001, "Wrong alignment on CalliopeAsset_ExportToData");
static_assert(sizeof(CalliopeAsset_ExportToData) == 0x000001, "Wrong size on CalliopeAsset_ExportToData");
static_assert(offsetof(CalliopeAsset_ExportToData, ReturnValue) == 0x000000, "Member 'CalliopeAsset_ExportToData::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterActorGuidByConfigGuid
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_GetParameterActorGuidByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutActorGuid;                                      // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterActorGuidByConfigGuid) == 0x000008, "Wrong alignment on CalliopeAsset_GetParameterActorGuidByConfigGuid");
static_assert(sizeof(CalliopeAsset_GetParameterActorGuidByConfigGuid) == 0x000028, "Wrong size on CalliopeAsset_GetParameterActorGuidByConfigGuid");
static_assert(offsetof(CalliopeAsset_GetParameterActorGuidByConfigGuid, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_GetParameterActorGuidByConfigGuid::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterActorGuidByConfigGuid, OutActorGuid) == 0x000010, "Member 'CalliopeAsset_GetParameterActorGuidByConfigGuid::OutActorGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterActorGuidByConfigGuid, ReturnValue) == 0x000020, "Member 'CalliopeAsset_GetParameterActorGuidByConfigGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterBuffIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterBuffIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutBuffID;                                         // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterBuffIDByConfigGuid) == 0x000004, "Wrong alignment on CalliopeAsset_GetParameterBuffIDByConfigGuid");
static_assert(sizeof(CalliopeAsset_GetParameterBuffIDByConfigGuid) == 0x000018, "Wrong size on CalliopeAsset_GetParameterBuffIDByConfigGuid");
static_assert(offsetof(CalliopeAsset_GetParameterBuffIDByConfigGuid, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_GetParameterBuffIDByConfigGuid::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterBuffIDByConfigGuid, OutBuffID) == 0x000010, "Member 'CalliopeAsset_GetParameterBuffIDByConfigGuid::OutBuffID' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterBuffIDByConfigGuid, ReturnValue) == 0x000014, "Member 'CalliopeAsset_GetParameterBuffIDByConfigGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterConfigGuidByActorGuid
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetParameterConfigGuidByActorGuid final
{
public:
	EGsManagedParamType                           ParamType;                                         // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ParamValueString;                                  // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParamValueInt;                                     // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ParamValueName;                                    // 0x001C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          OutGuid;                                           // 0x0024(0x0010)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterConfigGuidByActorGuid) == 0x000008, "Wrong alignment on CalliopeAsset_GetParameterConfigGuidByActorGuid");
static_assert(sizeof(CalliopeAsset_GetParameterConfigGuidByActorGuid) == 0x000038, "Wrong size on CalliopeAsset_GetParameterConfigGuidByActorGuid");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, ParamType) == 0x000000, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::ParamType' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, ParamValueString) == 0x000008, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::ParamValueString' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, ParamValueInt) == 0x000018, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::ParamValueInt' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, ParamValueName) == 0x00001C, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::ParamValueName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, OutGuid) == 0x000024, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::OutGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterConfigGuidByActorGuid, ReturnValue) == 0x000034, "Member 'CalliopeAsset_GetParameterConfigGuidByActorGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterDisplayNameByConfigGuid
// 0x0038 (0x0038 - 0x0000)
struct CalliopeAsset_GetParameterDisplayNameByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPropertyName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutDisplayName;                                    // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterDisplayNameByConfigGuid) == 0x000008, "Wrong alignment on CalliopeAsset_GetParameterDisplayNameByConfigGuid");
static_assert(sizeof(CalliopeAsset_GetParameterDisplayNameByConfigGuid) == 0x000038, "Wrong size on CalliopeAsset_GetParameterDisplayNameByConfigGuid");
static_assert(offsetof(CalliopeAsset_GetParameterDisplayNameByConfigGuid, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_GetParameterDisplayNameByConfigGuid::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterDisplayNameByConfigGuid, InPropertyName) == 0x000010, "Member 'CalliopeAsset_GetParameterDisplayNameByConfigGuid::InPropertyName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterDisplayNameByConfigGuid, OutDisplayName) == 0x000020, "Member 'CalliopeAsset_GetParameterDisplayNameByConfigGuid::OutDisplayName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterDisplayNameByConfigGuid, ReturnValue) == 0x000030, "Member 'CalliopeAsset_GetParameterDisplayNameByConfigGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterSequenceIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterSequenceIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutSequenceID;                                     // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterSequenceIDByConfigGuid) == 0x000004, "Wrong alignment on CalliopeAsset_GetParameterSequenceIDByConfigGuid");
static_assert(sizeof(CalliopeAsset_GetParameterSequenceIDByConfigGuid) == 0x000018, "Wrong size on CalliopeAsset_GetParameterSequenceIDByConfigGuid");
static_assert(offsetof(CalliopeAsset_GetParameterSequenceIDByConfigGuid, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_GetParameterSequenceIDByConfigGuid::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterSequenceIDByConfigGuid, OutSequenceID) == 0x000010, "Member 'CalliopeAsset_GetParameterSequenceIDByConfigGuid::OutSequenceID' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterSequenceIDByConfigGuid, ReturnValue) == 0x000014, "Member 'CalliopeAsset_GetParameterSequenceIDByConfigGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetParameterTaskStateIDByConfigGuid
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetParameterTaskStateIDByConfigGuid final
{
public:
	struct FCalliopeGuid                          InConfigGuid;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTaskStageID;                                    // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetParameterTaskStateIDByConfigGuid) == 0x000004, "Wrong alignment on CalliopeAsset_GetParameterTaskStateIDByConfigGuid");
static_assert(sizeof(CalliopeAsset_GetParameterTaskStateIDByConfigGuid) == 0x000018, "Wrong size on CalliopeAsset_GetParameterTaskStateIDByConfigGuid");
static_assert(offsetof(CalliopeAsset_GetParameterTaskStateIDByConfigGuid, InConfigGuid) == 0x000000, "Member 'CalliopeAsset_GetParameterTaskStateIDByConfigGuid::InConfigGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterTaskStateIDByConfigGuid, OutTaskStageID) == 0x000010, "Member 'CalliopeAsset_GetParameterTaskStateIDByConfigGuid::OutTaskStageID' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetParameterTaskStateIDByConfigGuid, ReturnValue) == 0x000014, "Member 'CalliopeAsset_GetParameterTaskStateIDByConfigGuid::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.OnNodeActivate
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_OnNodeActivate final
{
public:
	const class UCalliopeNode*                    Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_OnNodeActivate) == 0x000008, "Wrong alignment on CalliopeAsset_OnNodeActivate");
static_assert(sizeof(CalliopeAsset_OnNodeActivate) == 0x000008, "Wrong size on CalliopeAsset_OnNodeActivate");
static_assert(offsetof(CalliopeAsset_OnNodeActivate, Node) == 0x000000, "Member 'CalliopeAsset_OnNodeActivate::Node' has a wrong offset!");

// Function Calliope.CalliopeAsset.OnNodeDeactivate
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_OnNodeDeactivate final
{
public:
	const class UCalliopeNode*                    Node;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_OnNodeDeactivate) == 0x000008, "Wrong alignment on CalliopeAsset_OnNodeDeactivate");
static_assert(sizeof(CalliopeAsset_OnNodeDeactivate) == 0x000008, "Wrong size on CalliopeAsset_OnNodeDeactivate");
static_assert(offsetof(CalliopeAsset_OnNodeDeactivate, Node) == 0x000000, "Member 'CalliopeAsset_OnNodeDeactivate::Node' has a wrong offset!");

// Function Calliope.CalliopeAsset.OnPropertyChanged
// 0x0020 (0x0020 - 0x0000)
struct CalliopeAsset_OnPropertyChanged final
{
public:
	class FString                                 MemberName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PropertyName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_OnPropertyChanged) == 0x000008, "Wrong alignment on CalliopeAsset_OnPropertyChanged");
static_assert(sizeof(CalliopeAsset_OnPropertyChanged) == 0x000020, "Wrong size on CalliopeAsset_OnPropertyChanged");
static_assert(offsetof(CalliopeAsset_OnPropertyChanged, MemberName) == 0x000000, "Member 'CalliopeAsset_OnPropertyChanged::MemberName' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_OnPropertyChanged, PropertyName) == 0x000010, "Member 'CalliopeAsset_OnPropertyChanged::PropertyName' has a wrong offset!");

// Function Calliope.CalliopeAsset.PostDuplicateInCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_PostDuplicateInCS final
{
public:
	bool                                          bDuplicateForPIE;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_PostDuplicateInCS) == 0x000001, "Wrong alignment on CalliopeAsset_PostDuplicateInCS");
static_assert(sizeof(CalliopeAsset_PostDuplicateInCS) == 0x000001, "Wrong size on CalliopeAsset_PostDuplicateInCS");
static_assert(offsetof(CalliopeAsset_PostDuplicateInCS, bDuplicateForPIE) == 0x000000, "Member 'CalliopeAsset_PostDuplicateInCS::bDuplicateForPIE' has a wrong offset!");

// Function Calliope.CalliopeAsset.RecordInput
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RecordInput final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPinName;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_RecordInput) == 0x000004, "Wrong alignment on CalliopeAsset_RecordInput");
static_assert(sizeof(CalliopeAsset_RecordInput) == 0x000018, "Wrong size on CalliopeAsset_RecordInput");
static_assert(offsetof(CalliopeAsset_RecordInput, InGuid) == 0x000000, "Member 'CalliopeAsset_RecordInput::InGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_RecordInput, InPinName) == 0x000010, "Member 'CalliopeAsset_RecordInput::InPinName' has a wrong offset!");

// Function Calliope.CalliopeAsset.RecordOnlyNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_RecordOnlyNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_RecordOnlyNode) == 0x000004, "Wrong alignment on CalliopeAsset_RecordOnlyNode");
static_assert(sizeof(CalliopeAsset_RecordOnlyNode) == 0x000010, "Wrong size on CalliopeAsset_RecordOnlyNode");
static_assert(offsetof(CalliopeAsset_RecordOnlyNode, InGuid) == 0x000000, "Member 'CalliopeAsset_RecordOnlyNode::InGuid' has a wrong offset!");

// Function Calliope.CalliopeAsset.RecordOutput
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RecordOutput final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPinName;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_RecordOutput) == 0x000004, "Wrong alignment on CalliopeAsset_RecordOutput");
static_assert(sizeof(CalliopeAsset_RecordOutput) == 0x000018, "Wrong size on CalliopeAsset_RecordOutput");
static_assert(offsetof(CalliopeAsset_RecordOutput, InGuid) == 0x000000, "Member 'CalliopeAsset_RecordOutput::InGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_RecordOutput, InPinName) == 0x000010, "Member 'CalliopeAsset_RecordOutput::InPinName' has a wrong offset!");

// Function Calliope.CalliopeAsset.RegisterNode
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_RegisterNode final
{
public:
	struct FCalliopeGuid                          NewGuid;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeNode*                          NewNode;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_RegisterNode) == 0x000008, "Wrong alignment on CalliopeAsset_RegisterNode");
static_assert(sizeof(CalliopeAsset_RegisterNode) == 0x000018, "Wrong size on CalliopeAsset_RegisterNode");
static_assert(offsetof(CalliopeAsset_RegisterNode, NewGuid) == 0x000000, "Member 'CalliopeAsset_RegisterNode::NewGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_RegisterNode, NewNode) == 0x000010, "Member 'CalliopeAsset_RegisterNode::NewNode' has a wrong offset!");

// Function Calliope.CalliopeAsset.RemoveBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_RemoveBranchGraph final
{
public:
	class FName                                   GraphName;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_RemoveBranchGraph) == 0x000004, "Wrong alignment on CalliopeAsset_RemoveBranchGraph");
static_assert(sizeof(CalliopeAsset_RemoveBranchGraph) == 0x000008, "Wrong size on CalliopeAsset_RemoveBranchGraph");
static_assert(offsetof(CalliopeAsset_RemoveBranchGraph, GraphName) == 0x000000, "Member 'CalliopeAsset_RemoveBranchGraph::GraphName' has a wrong offset!");

// Function Calliope.CalliopeAsset.SetSubGraphAssetInPIE
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_SetSubGraphAssetInPIE final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeAsset*                         CalliopeAsset;                                     // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_SetSubGraphAssetInPIE) == 0x000008, "Wrong alignment on CalliopeAsset_SetSubGraphAssetInPIE");
static_assert(sizeof(CalliopeAsset_SetSubGraphAssetInPIE) == 0x000018, "Wrong size on CalliopeAsset_SetSubGraphAssetInPIE");
static_assert(offsetof(CalliopeAsset_SetSubGraphAssetInPIE, InGuid) == 0x000000, "Member 'CalliopeAsset_SetSubGraphAssetInPIE::InGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_SetSubGraphAssetInPIE, CalliopeAsset) == 0x000010, "Member 'CalliopeAsset_SetSubGraphAssetInPIE::CalliopeAsset' has a wrong offset!");

// Function Calliope.CalliopeAsset.StartAsSubInstance
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_StartAsSubInstance final
{
public:
	class UCalliopeAsset*                         ParentInstance;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCalliopeGuid                          InSubNodeGuid;                                     // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_StartAsSubInstance) == 0x000008, "Wrong alignment on CalliopeAsset_StartAsSubInstance");
static_assert(sizeof(CalliopeAsset_StartAsSubInstance) == 0x000018, "Wrong size on CalliopeAsset_StartAsSubInstance");
static_assert(offsetof(CalliopeAsset_StartAsSubInstance, ParentInstance) == 0x000000, "Member 'CalliopeAsset_StartAsSubInstance::ParentInstance' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_StartAsSubInstance, InSubNodeGuid) == 0x000008, "Member 'CalliopeAsset_StartAsSubInstance::InSubNodeGuid' has a wrong offset!");

// Function Calliope.CalliopeAsset.UnregisterNode
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_UnregisterNode final
{
public:
	struct FCalliopeGuid                          NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_UnregisterNode) == 0x000004, "Wrong alignment on CalliopeAsset_UnregisterNode");
static_assert(sizeof(CalliopeAsset_UnregisterNode) == 0x000010, "Wrong size on CalliopeAsset_UnregisterNode");
static_assert(offsetof(CalliopeAsset_UnregisterNode, NodeGuid) == 0x000000, "Member 'CalliopeAsset_UnregisterNode::NodeGuid' has a wrong offset!");

// Function Calliope.CalliopeAsset.UpdateParameterActorReferenceAndAliasName
// 0x0028 (0x0028 - 0x0000)
struct CalliopeAsset_UpdateParameterActorReferenceAndAliasName final
{
public:
	class FString                                 ObjectPath;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorGuid;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AliasName;                                         // 0x0020(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_UpdateParameterActorReferenceAndAliasName) == 0x000008, "Wrong alignment on CalliopeAsset_UpdateParameterActorReferenceAndAliasName");
static_assert(sizeof(CalliopeAsset_UpdateParameterActorReferenceAndAliasName) == 0x000028, "Wrong size on CalliopeAsset_UpdateParameterActorReferenceAndAliasName");
static_assert(offsetof(CalliopeAsset_UpdateParameterActorReferenceAndAliasName, ObjectPath) == 0x000000, "Member 'CalliopeAsset_UpdateParameterActorReferenceAndAliasName::ObjectPath' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_UpdateParameterActorReferenceAndAliasName, ActorGuid) == 0x000010, "Member 'CalliopeAsset_UpdateParameterActorReferenceAndAliasName::ActorGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_UpdateParameterActorReferenceAndAliasName, AliasName) == 0x000020, "Member 'CalliopeAsset_UpdateParameterActorReferenceAndAliasName::AliasName' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetCustomInputs
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_GetCustomInputs final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetCustomInputs) == 0x000008, "Wrong alignment on CalliopeAsset_GetCustomInputs");
static_assert(sizeof(CalliopeAsset_GetCustomInputs) == 0x000010, "Wrong size on CalliopeAsset_GetCustomInputs");
static_assert(offsetof(CalliopeAsset_GetCustomInputs, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetCustomInputs::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetCustomOutputs
// 0x0010 (0x0010 - 0x0000)
struct CalliopeAsset_GetCustomOutputs final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetCustomOutputs) == 0x000008, "Wrong alignment on CalliopeAsset_GetCustomOutputs");
static_assert(sizeof(CalliopeAsset_GetCustomOutputs) == 0x000010, "Wrong size on CalliopeAsset_GetCustomOutputs");
static_assert(offsetof(CalliopeAsset_GetCustomOutputs, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetCustomOutputs::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetExtraDefaultInputNodes
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultInputNodes final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetExtraDefaultInputNodes) == 0x000008, "Wrong alignment on CalliopeAsset_GetExtraDefaultInputNodes");
static_assert(sizeof(CalliopeAsset_GetExtraDefaultInputNodes) == 0x000018, "Wrong size on CalliopeAsset_GetExtraDefaultInputNodes");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultInputNodes, OutClasses) == 0x000000, "Member 'CalliopeAsset_GetExtraDefaultInputNodes::OutClasses' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultInputNodes, ReturnValue) == 0x000010, "Member 'CalliopeAsset_GetExtraDefaultInputNodes::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetExtraDefaultInputNodesInBranchGraph
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph) == 0x000008, "Wrong alignment on CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph");
static_assert(sizeof(CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph) == 0x000018, "Wrong size on CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph, OutClasses) == 0x000000, "Member 'CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph::OutClasses' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph, ReturnValue) == 0x000010, "Member 'CalliopeAsset_GetExtraDefaultInputNodesInBranchGraph::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetExtraDefaultOutputNodes
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultOutputNodes final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetExtraDefaultOutputNodes) == 0x000008, "Wrong alignment on CalliopeAsset_GetExtraDefaultOutputNodes");
static_assert(sizeof(CalliopeAsset_GetExtraDefaultOutputNodes) == 0x000018, "Wrong size on CalliopeAsset_GetExtraDefaultOutputNodes");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultOutputNodes, OutClasses) == 0x000000, "Member 'CalliopeAsset_GetExtraDefaultOutputNodes::OutClasses' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultOutputNodes, ReturnValue) == 0x000010, "Member 'CalliopeAsset_GetExtraDefaultOutputNodes::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetExtraDefaultOutputNodesInBranchGraph
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph final
{
public:
	TArray<class UClass*>                         OutClasses;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph) == 0x000008, "Wrong alignment on CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph");
static_assert(sizeof(CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph) == 0x000018, "Wrong size on CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph, OutClasses) == 0x000000, "Member 'CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph::OutClasses' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph, ReturnValue) == 0x000010, "Member 'CalliopeAsset_GetExtraDefaultOutputNodesInBranchGraph::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetNode
// 0x0018 (0x0018 - 0x0000)
struct CalliopeAsset_GetNode final
{
public:
	struct FCalliopeGuid                          InGuid;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCalliopeNode*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetNode) == 0x000008, "Wrong alignment on CalliopeAsset_GetNode");
static_assert(sizeof(CalliopeAsset_GetNode) == 0x000018, "Wrong size on CalliopeAsset_GetNode");
static_assert(offsetof(CalliopeAsset_GetNode, InGuid) == 0x000000, "Member 'CalliopeAsset_GetNode::InGuid' has a wrong offset!");
static_assert(offsetof(CalliopeAsset_GetNode, ReturnValue) == 0x000010, "Member 'CalliopeAsset_GetNode::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetNodes
// 0x0050 (0x0050 - 0x0000)
struct CalliopeAsset_GetNodes final
{
public:
	TMap<struct FCalliopeGuid, class UCalliopeNode*> ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetNodes) == 0x000008, "Wrong alignment on CalliopeAsset_GetNodes");
static_assert(sizeof(CalliopeAsset_GetNodes) == 0x000050, "Wrong size on CalliopeAsset_GetNodes");
static_assert(offsetof(CalliopeAsset_GetNodes, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetNodes::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetRerouteNodeClass
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetRerouteNodeClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetRerouteNodeClass) == 0x000008, "Wrong alignment on CalliopeAsset_GetRerouteNodeClass");
static_assert(sizeof(CalliopeAsset_GetRerouteNodeClass) == 0x000008, "Wrong size on CalliopeAsset_GetRerouteNodeClass");
static_assert(offsetof(CalliopeAsset_GetRerouteNodeClass, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetRerouteNodeClass::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetRerouteNodeClassInBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetRerouteNodeClassInBranchGraph final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetRerouteNodeClassInBranchGraph) == 0x000008, "Wrong alignment on CalliopeAsset_GetRerouteNodeClassInBranchGraph");
static_assert(sizeof(CalliopeAsset_GetRerouteNodeClassInBranchGraph) == 0x000008, "Wrong size on CalliopeAsset_GetRerouteNodeClassInBranchGraph");
static_assert(offsetof(CalliopeAsset_GetRerouteNodeClassInBranchGraph, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetRerouteNodeClassInBranchGraph::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetStartNodeClass
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetStartNodeClass final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetStartNodeClass) == 0x000008, "Wrong alignment on CalliopeAsset_GetStartNodeClass");
static_assert(sizeof(CalliopeAsset_GetStartNodeClass) == 0x000008, "Wrong size on CalliopeAsset_GetStartNodeClass");
static_assert(offsetof(CalliopeAsset_GetStartNodeClass, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetStartNodeClass::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetStartNodeClassInBranchGraph
// 0x0008 (0x0008 - 0x0000)
struct CalliopeAsset_GetStartNodeClassInBranchGraph final
{
public:
	class UClass*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetStartNodeClassInBranchGraph) == 0x000008, "Wrong alignment on CalliopeAsset_GetStartNodeClassInBranchGraph");
static_assert(sizeof(CalliopeAsset_GetStartNodeClassInBranchGraph) == 0x000008, "Wrong size on CalliopeAsset_GetStartNodeClassInBranchGraph");
static_assert(offsetof(CalliopeAsset_GetStartNodeClassInBranchGraph, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetStartNodeClassInBranchGraph::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.GetViewType
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_GetViewType final
{
public:
	ECalliopeViewType                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_GetViewType) == 0x000001, "Wrong alignment on CalliopeAsset_GetViewType");
static_assert(sizeof(CalliopeAsset_GetViewType) == 0x000001, "Wrong size on CalliopeAsset_GetViewType");
static_assert(offsetof(CalliopeAsset_GetViewType, ReturnValue) == 0x000000, "Member 'CalliopeAsset_GetViewType::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeAsset.IsEditorOnlyCS
// 0x0001 (0x0001 - 0x0000)
struct CalliopeAsset_IsEditorOnlyCS final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeAsset_IsEditorOnlyCS) == 0x000001, "Wrong alignment on CalliopeAsset_IsEditorOnlyCS");
static_assert(sizeof(CalliopeAsset_IsEditorOnlyCS) == 0x000001, "Wrong size on CalliopeAsset_IsEditorOnlyCS");
static_assert(offsetof(CalliopeAsset_IsEditorOnlyCS, ReturnValue) == 0x000000, "Member 'CalliopeAsset_IsEditorOnlyCS::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.BindActorByName
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_BindActorByName final
{
public:
	class FName                                   BindingName;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 BindingActor;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_BindActorByName) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_BindActorByName");
static_assert(sizeof(CalliopeLevelSequenceActor_BindActorByName) == 0x000010, "Wrong size on CalliopeLevelSequenceActor_BindActorByName");
static_assert(offsetof(CalliopeLevelSequenceActor_BindActorByName, BindingName) == 0x000000, "Member 'CalliopeLevelSequenceActor_BindActorByName::BindingName' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_BindActorByName, BindingActor) == 0x000008, "Member 'CalliopeLevelSequenceActor_BindActorByName::BindingActor' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.BindActorsByTag
// 0x0050 (0x0050 - 0x0000)
struct CalliopeLevelSequenceActor_BindActorsByTag final
{
public:
	TMap<class FName, class AActor*>              TagActors;                                         // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_BindActorsByTag) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_BindActorsByTag");
static_assert(sizeof(CalliopeLevelSequenceActor_BindActorsByTag) == 0x000050, "Wrong size on CalliopeLevelSequenceActor_BindActorsByTag");
static_assert(offsetof(CalliopeLevelSequenceActor_BindActorsByTag, TagActors) == 0x000000, "Member 'CalliopeLevelSequenceActor_BindActorsByTag::TagActors' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.MeshPrestreamTextures
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_MeshPrestreamTextures final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationTimeSeconds;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeLevelSequenceActor_MeshPrestreamTextures) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_MeshPrestreamTextures");
static_assert(sizeof(CalliopeLevelSequenceActor_MeshPrestreamTextures) == 0x000010, "Wrong size on CalliopeLevelSequenceActor_MeshPrestreamTextures");
static_assert(offsetof(CalliopeLevelSequenceActor_MeshPrestreamTextures, Mesh) == 0x000000, "Member 'CalliopeLevelSequenceActor_MeshPrestreamTextures::Mesh' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_MeshPrestreamTextures, DurationTimeSeconds) == 0x000008, "Member 'CalliopeLevelSequenceActor_MeshPrestreamTextures::DurationTimeSeconds' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_MeshPrestreamTextures, bEnable) == 0x00000C, "Member 'CalliopeLevelSequenceActor_MeshPrestreamTextures::bEnable' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.MeshSetClothLocalSpaceSimulation
// 0x0010 (0x0010 - 0x0000)
struct CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation final
{
public:
	class UMeshComponent*                         Mesh;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation");
static_assert(sizeof(CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation) == 0x000010, "Wrong size on CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation");
static_assert(offsetof(CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation, Mesh) == 0x000000, "Member 'CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation::Mesh' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation, bEnable) == 0x000008, "Member 'CalliopeLevelSequenceActor_MeshSetClothLocalSpaceSimulation::bEnable' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.ReSetSequence
// 0x0008 (0x0008 - 0x0000)
struct CalliopeLevelSequenceActor_ReSetSequence final
{
public:
	class ULevelSequence*                         InSequence;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_ReSetSequence) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_ReSetSequence");
static_assert(sizeof(CalliopeLevelSequenceActor_ReSetSequence) == 0x000008, "Wrong size on CalliopeLevelSequenceActor_ReSetSequence");
static_assert(offsetof(CalliopeLevelSequenceActor_ReSetSequence, InSequence) == 0x000000, "Member 'CalliopeLevelSequenceActor_ReSetSequence::InSequence' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.SetAllMeshPropertyInSequence
// 0x0001 (0x0001 - 0x0000)
struct CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence) == 0x000001, "Wrong alignment on CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence");
static_assert(sizeof(CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence) == 0x000001, "Wrong size on CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence");
static_assert(offsetof(CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence, bEnable) == 0x000000, "Member 'CalliopeLevelSequenceActor_SetAllMeshPropertyInSequence::bEnable' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.SetAllPerformerTickEnabled
// 0x0058 (0x0058 - 0x0000)
struct CalliopeLevelSequenceActor_SetAllPerformerTickEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AActor*>                           OutPerformers;                                     // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_SetAllPerformerTickEnabled) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_SetAllPerformerTickEnabled");
static_assert(sizeof(CalliopeLevelSequenceActor_SetAllPerformerTickEnabled) == 0x000058, "Wrong size on CalliopeLevelSequenceActor_SetAllPerformerTickEnabled");
static_assert(offsetof(CalliopeLevelSequenceActor_SetAllPerformerTickEnabled, bEnable) == 0x000000, "Member 'CalliopeLevelSequenceActor_SetAllPerformerTickEnabled::bEnable' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_SetAllPerformerTickEnabled, OutPerformers) == 0x000008, "Member 'CalliopeLevelSequenceActor_SetAllPerformerTickEnabled::OutPerformers' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.SetPaused
// 0x0001 (0x0001 - 0x0000)
struct CalliopeLevelSequenceActor_SetPaused final
{
public:
	bool                                          bInPaused;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CalliopeLevelSequenceActor_SetPaused) == 0x000001, "Wrong alignment on CalliopeLevelSequenceActor_SetPaused");
static_assert(sizeof(CalliopeLevelSequenceActor_SetPaused) == 0x000001, "Wrong size on CalliopeLevelSequenceActor_SetPaused");
static_assert(offsetof(CalliopeLevelSequenceActor_SetPaused, bInPaused) == 0x000000, "Member 'CalliopeLevelSequenceActor_SetPaused::bInPaused' has a wrong offset!");

// Function Calliope.CalliopeLevelSequenceActor.GetBindingTags
// 0x0058 (0x0058 - 0x0000)
struct CalliopeLevelSequenceActor_GetBindingTags final
{
public:
	TSet<class FName>                             OutBindingTags;                                    // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0050(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CalliopeLevelSequenceActor_GetBindingTags) == 0x000008, "Wrong alignment on CalliopeLevelSequenceActor_GetBindingTags");
static_assert(sizeof(CalliopeLevelSequenceActor_GetBindingTags) == 0x000058, "Wrong size on CalliopeLevelSequenceActor_GetBindingTags");
static_assert(offsetof(CalliopeLevelSequenceActor_GetBindingTags, OutBindingTags) == 0x000000, "Member 'CalliopeLevelSequenceActor_GetBindingTags::OutBindingTags' has a wrong offset!");
static_assert(offsetof(CalliopeLevelSequenceActor_GetBindingTags, ReturnValue) == 0x000050, "Member 'CalliopeLevelSequenceActor_GetBindingTags::ReturnValue' has a wrong offset!");

// Function Calliope.CalliopeFunctionLibrary.MarkDirtyAllCalliopeTrack
// 0x0008 (0x0008 - 0x0000)
