#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicPrestreaming

#include "Basic.hpp"


namespace SDK::Params
{

// Function CinematicPrestreaming.MovieSceneCinePrestreamingSection.SetPrestreamingAsset
// 0x0008 (0x0008 - 0x0000)
struct MovieSceneCinePrestreamingSection_SetPrestreamingAsset final
{
public:
	const class UCinePrestreamingData*            InData;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneCinePrestreamingSection_SetPrestreamingAsset) == 0x000008, "Wrong alignment on MovieSceneCinePrestreamingSection_SetPrestreamingAsset");
static_assert(sizeof(MovieSceneCinePrestreamingSection_SetPrestreamingAsset) == 0x000008, "Wrong size on MovieSceneCinePrestreamingSection_SetPrestreamingAsset");
static_assert(offsetof(MovieSceneCinePrestreamingSection_SetPrestreamingAsset, InData) == 0x000000, "Member 'MovieSceneCinePrestreamingSection_SetPrestreamingAsset::InData' has a wrong offset!");

// Function CinematicPrestreaming.MovieSceneCinePrestreamingSection.SetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneCinePrestreamingSection_SetQualityLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneCinePrestreamingSection_SetQualityLevel) == 0x000004, "Wrong alignment on MovieSceneCinePrestreamingSection_SetQualityLevel");
static_assert(sizeof(MovieSceneCinePrestreamingSection_SetQualityLevel) == 0x000004, "Wrong size on MovieSceneCinePrestreamingSection_SetQualityLevel");
static_assert(offsetof(MovieSceneCinePrestreamingSection_SetQualityLevel, InLevel) == 0x000000, "Member 'MovieSceneCinePrestreamingSection_SetQualityLevel::InLevel' has a wrong offset!");

// Function CinematicPrestreaming.MovieSceneCinePrestreamingSection.SetStartFrameOffset
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneCinePrestreamingSection_SetStartFrameOffset final
{
public:
	int32                                         InOffset;                                          // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneCinePrestreamingSection_SetStartFrameOffset) == 0x000004, "Wrong alignment on MovieSceneCinePrestreamingSection_SetStartFrameOffset");
static_assert(sizeof(MovieSceneCinePrestreamingSection_SetStartFrameOffset) == 0x000004, "Wrong size on MovieSceneCinePrestreamingSection_SetStartFrameOffset");
static_assert(offsetof(MovieSceneCinePrestreamingSection_SetStartFrameOffset, InOffset) == 0x000000, "Member 'MovieSceneCinePrestreamingSection_SetStartFrameOffset::InOffset' has a wrong offset!");

// Function CinematicPrestreaming.MovieSceneCinePrestreamingSection.GetPrestreamingAsset
// 0x0028 (0x0028 - 0x0000)
struct MovieSceneCinePrestreamingSection_GetPrestreamingAsset final
{
public:
	TSoftObjectPtr<class UCinePrestreamingData>   ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneCinePrestreamingSection_GetPrestreamingAsset) == 0x000008, "Wrong alignment on MovieSceneCinePrestreamingSection_GetPrestreamingAsset");
static_assert(sizeof(MovieSceneCinePrestreamingSection_GetPrestreamingAsset) == 0x000028, "Wrong size on MovieSceneCinePrestreamingSection_GetPrestreamingAsset");
static_assert(offsetof(MovieSceneCinePrestreamingSection_GetPrestreamingAsset, ReturnValue) == 0x000000, "Member 'MovieSceneCinePrestreamingSection_GetPrestreamingAsset::ReturnValue' has a wrong offset!");

// Function CinematicPrestreaming.MovieSceneCinePrestreamingSection.GetQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct MovieSceneCinePrestreamingSection_GetQualityLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieSceneCinePrestreamingSection_GetQualityLevel) == 0x000004, "Wrong alignment on MovieSceneCinePrestreamingSection_GetQualityLevel");
static_assert(sizeof(MovieSceneCinePrestreamingSection_GetQualityLevel) == 0x000004, "Wrong size on MovieSceneCinePrestreamingSection_GetQualityLevel");
static_assert(offsetof(MovieSceneCinePrestreamingSection_GetQualityLevel, ReturnValue) == 0x000000, "Member 'MovieSceneCinePrestreamingSection_GetQualityLevel::ReturnValue' has a wrong offset!");

}

