#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicCamera

#include "Basic.hpp"

#include "CinematicCamera_structs.hpp"


namespace SDK::Params
{

// Function CinematicCamera.CameraRig_Rail.GetRailSplineComponent
// 0x0008 (0x0008 - 0x0000)
struct CameraRig_Rail_GetRailSplineComponent final
{
public:
	class USplineComponent*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CameraRig_Rail_GetRailSplineComponent) == 0x000008, "Wrong alignment on CameraRig_Rail_GetRailSplineComponent");
static_assert(sizeof(CameraRig_Rail_GetRailSplineComponent) == 0x000008, "Wrong size on CameraRig_Rail_GetRailSplineComponent");
static_assert(offsetof(CameraRig_Rail_GetRailSplineComponent, ReturnValue) == 0x000000, "Member 'CameraRig_Rail_GetRailSplineComponent::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraActor.GetCineCameraComponent
// 0x0008 (0x0008 - 0x0000)
struct CineCameraActor_GetCineCameraComponent final
{
public:
	class UCineCameraComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraActor_GetCineCameraComponent) == 0x000008, "Wrong alignment on CineCameraActor_GetCineCameraComponent");
static_assert(sizeof(CineCameraActor_GetCineCameraComponent) == 0x000008, "Wrong size on CineCameraActor_GetCineCameraComponent");
static_assert(offsetof(CineCameraActor_GetCineCameraComponent, ReturnValue) == 0x000000, "Member 'CineCameraActor_GetCineCameraComponent::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetFilmbackPresetsCopy
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_GetFilmbackPresetsCopy final
{
public:
	TArray<struct FNamedFilmbackPreset>           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetFilmbackPresetsCopy) == 0x000008, "Wrong alignment on CineCameraComponent_GetFilmbackPresetsCopy");
static_assert(sizeof(CineCameraComponent_GetFilmbackPresetsCopy) == 0x000010, "Wrong size on CineCameraComponent_GetFilmbackPresetsCopy");
static_assert(offsetof(CineCameraComponent_GetFilmbackPresetsCopy, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetFilmbackPresetsCopy::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetLensPresetsCopy
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_GetLensPresetsCopy final
{
public:
	TArray<struct FNamedLensPreset>               ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetLensPresetsCopy) == 0x000008, "Wrong alignment on CineCameraComponent_GetLensPresetsCopy");
static_assert(sizeof(CineCameraComponent_GetLensPresetsCopy) == 0x000010, "Wrong size on CineCameraComponent_GetLensPresetsCopy");
static_assert(offsetof(CineCameraComponent_GetLensPresetsCopy, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetLensPresetsCopy::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.SetCurrentFocalLength
// 0x0004 (0x0004 - 0x0000)
struct CineCameraComponent_SetCurrentFocalLength final
{
public:
	float                                         InFocalLength;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_SetCurrentFocalLength) == 0x000004, "Wrong alignment on CineCameraComponent_SetCurrentFocalLength");
static_assert(sizeof(CineCameraComponent_SetCurrentFocalLength) == 0x000004, "Wrong size on CineCameraComponent_SetCurrentFocalLength");
static_assert(offsetof(CineCameraComponent_SetCurrentFocalLength, InFocalLength) == 0x000000, "Member 'CineCameraComponent_SetCurrentFocalLength::InFocalLength' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.SetFilmbackPresetByName
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_SetFilmbackPresetByName final
{
public:
	class FString                                 InPresetName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_SetFilmbackPresetByName) == 0x000008, "Wrong alignment on CineCameraComponent_SetFilmbackPresetByName");
static_assert(sizeof(CineCameraComponent_SetFilmbackPresetByName) == 0x000010, "Wrong size on CineCameraComponent_SetFilmbackPresetByName");
static_assert(offsetof(CineCameraComponent_SetFilmbackPresetByName, InPresetName) == 0x000000, "Member 'CineCameraComponent_SetFilmbackPresetByName::InPresetName' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.SetLensPresetByName
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_SetLensPresetByName final
{
public:
	class FString                                 InPresetName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_SetLensPresetByName) == 0x000008, "Wrong alignment on CineCameraComponent_SetLensPresetByName");
static_assert(sizeof(CineCameraComponent_SetLensPresetByName) == 0x000010, "Wrong size on CineCameraComponent_SetLensPresetByName");
static_assert(offsetof(CineCameraComponent_SetLensPresetByName, InPresetName) == 0x000000, "Member 'CineCameraComponent_SetLensPresetByName::InPresetName' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetDefaultFilmbackPresetName
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_GetDefaultFilmbackPresetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetDefaultFilmbackPresetName) == 0x000008, "Wrong alignment on CineCameraComponent_GetDefaultFilmbackPresetName");
static_assert(sizeof(CineCameraComponent_GetDefaultFilmbackPresetName) == 0x000010, "Wrong size on CineCameraComponent_GetDefaultFilmbackPresetName");
static_assert(offsetof(CineCameraComponent_GetDefaultFilmbackPresetName, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetDefaultFilmbackPresetName::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetFilmbackPresetName
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_GetFilmbackPresetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetFilmbackPresetName) == 0x000008, "Wrong alignment on CineCameraComponent_GetFilmbackPresetName");
static_assert(sizeof(CineCameraComponent_GetFilmbackPresetName) == 0x000010, "Wrong size on CineCameraComponent_GetFilmbackPresetName");
static_assert(offsetof(CineCameraComponent_GetFilmbackPresetName, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetFilmbackPresetName::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetHorizontalFieldOfView
// 0x0004 (0x0004 - 0x0000)
struct CineCameraComponent_GetHorizontalFieldOfView final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetHorizontalFieldOfView) == 0x000004, "Wrong alignment on CineCameraComponent_GetHorizontalFieldOfView");
static_assert(sizeof(CineCameraComponent_GetHorizontalFieldOfView) == 0x000004, "Wrong size on CineCameraComponent_GetHorizontalFieldOfView");
static_assert(offsetof(CineCameraComponent_GetHorizontalFieldOfView, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetHorizontalFieldOfView::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetLensPresetName
// 0x0010 (0x0010 - 0x0000)
struct CineCameraComponent_GetLensPresetName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetLensPresetName) == 0x000008, "Wrong alignment on CineCameraComponent_GetLensPresetName");
static_assert(sizeof(CineCameraComponent_GetLensPresetName) == 0x000010, "Wrong size on CineCameraComponent_GetLensPresetName");
static_assert(offsetof(CineCameraComponent_GetLensPresetName, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetLensPresetName::ReturnValue' has a wrong offset!");

// Function CinematicCamera.CineCameraComponent.GetVerticalFieldOfView
// 0x0004 (0x0004 - 0x0000)
struct CineCameraComponent_GetVerticalFieldOfView final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CineCameraComponent_GetVerticalFieldOfView) == 0x000004, "Wrong alignment on CineCameraComponent_GetVerticalFieldOfView");
static_assert(sizeof(CineCameraComponent_GetVerticalFieldOfView) == 0x000004, "Wrong size on CineCameraComponent_GetVerticalFieldOfView");
static_assert(offsetof(CineCameraComponent_GetVerticalFieldOfView, ReturnValue) == 0x000000, "Member 'CineCameraComponent_GetVerticalFieldOfView::ReturnValue' has a wrong offset!");

}

