#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CinematicPrestreaming

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct CinematicPrestreaming.CinePrestreamingVTData
// 0x0010 (0x0010 - 0x0000)
struct FCinePrestreamingVTData final
{
public:
	TArray<uint64>                                PageIds;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCinePrestreamingVTData) == 0x000008, "Wrong alignment on FCinePrestreamingVTData");
static_assert(sizeof(FCinePrestreamingVTData) == 0x000010, "Wrong size on FCinePrestreamingVTData");
static_assert(offsetof(FCinePrestreamingVTData, PageIds) == 0x000000, "Member 'FCinePrestreamingVTData::PageIds' has a wrong offset!");

// ScriptStruct CinematicPrestreaming.CinePrestreamingNaniteData
// 0x0010 (0x0010 - 0x0000)
struct FCinePrestreamingNaniteData final
{
public:
	TArray<uint32>                                RequestData;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCinePrestreamingNaniteData) == 0x000008, "Wrong alignment on FCinePrestreamingNaniteData");
static_assert(sizeof(FCinePrestreamingNaniteData) == 0x000010, "Wrong size on FCinePrestreamingNaniteData");
static_assert(offsetof(FCinePrestreamingNaniteData, RequestData) == 0x000000, "Member 'FCinePrestreamingNaniteData::RequestData' has a wrong offset!");

// ScriptStruct CinematicPrestreaming.MovieSceneCinePrestreamingComponentData
// 0x0008 (0x0008 - 0x0000)
struct FMovieSceneCinePrestreamingComponentData final
{
public:
	class UMovieSceneCinePrestreamingSection*     Section;                                           // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMovieSceneCinePrestreamingComponentData) == 0x000008, "Wrong alignment on FMovieSceneCinePrestreamingComponentData");
static_assert(sizeof(FMovieSceneCinePrestreamingComponentData) == 0x000008, "Wrong size on FMovieSceneCinePrestreamingComponentData");
static_assert(offsetof(FMovieSceneCinePrestreamingComponentData, Section) == 0x000000, "Member 'FMovieSceneCinePrestreamingComponentData::Section' has a wrong offset!");

}

