#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ClothingSystemRuntimeInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.EnableGravityOverride
// 0x0018 (0x0018 - 0x0000)
struct ClothingSimulationInteractor_EnableGravityOverride final
{
public:
	struct FVector                                InVector;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_EnableGravityOverride) == 0x000008, "Wrong alignment on ClothingSimulationInteractor_EnableGravityOverride");
static_assert(sizeof(ClothingSimulationInteractor_EnableGravityOverride) == 0x000018, "Wrong size on ClothingSimulationInteractor_EnableGravityOverride");
static_assert(offsetof(ClothingSimulationInteractor_EnableGravityOverride, InVector) == 0x000000, "Member 'ClothingSimulationInteractor_EnableGravityOverride::InVector' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.SetAnimDriveSpringStiffness
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_SetAnimDriveSpringStiffness final
{
public:
	float                                         InStiffness;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_SetAnimDriveSpringStiffness) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_SetAnimDriveSpringStiffness");
static_assert(sizeof(ClothingSimulationInteractor_SetAnimDriveSpringStiffness) == 0x000004, "Wrong size on ClothingSimulationInteractor_SetAnimDriveSpringStiffness");
static_assert(offsetof(ClothingSimulationInteractor_SetAnimDriveSpringStiffness, InStiffness) == 0x000000, "Member 'ClothingSimulationInteractor_SetAnimDriveSpringStiffness::InStiffness' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.SetMaxNumIterations
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_SetMaxNumIterations final
{
public:
	int32                                         MaxNumIterations;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_SetMaxNumIterations) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_SetMaxNumIterations");
static_assert(sizeof(ClothingSimulationInteractor_SetMaxNumIterations) == 0x000004, "Wrong size on ClothingSimulationInteractor_SetMaxNumIterations");
static_assert(offsetof(ClothingSimulationInteractor_SetMaxNumIterations, MaxNumIterations) == 0x000000, "Member 'ClothingSimulationInteractor_SetMaxNumIterations::MaxNumIterations' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.SetNumIterations
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_SetNumIterations final
{
public:
	int32                                         NumIterations;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_SetNumIterations) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_SetNumIterations");
static_assert(sizeof(ClothingSimulationInteractor_SetNumIterations) == 0x000004, "Wrong size on ClothingSimulationInteractor_SetNumIterations");
static_assert(offsetof(ClothingSimulationInteractor_SetNumIterations, NumIterations) == 0x000000, "Member 'ClothingSimulationInteractor_SetNumIterations::NumIterations' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.SetNumSubsteps
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_SetNumSubsteps final
{
public:
	int32                                         NumSubsteps;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_SetNumSubsteps) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_SetNumSubsteps");
static_assert(sizeof(ClothingSimulationInteractor_SetNumSubsteps) == 0x000004, "Wrong size on ClothingSimulationInteractor_SetNumSubsteps");
static_assert(offsetof(ClothingSimulationInteractor_SetNumSubsteps, NumSubsteps) == 0x000000, "Member 'ClothingSimulationInteractor_SetNumSubsteps::NumSubsteps' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetClothingInteractor
// 0x0018 (0x0018 - 0x0000)
struct ClothingSimulationInteractor_GetClothingInteractor final
{
public:
	class FString                                 ClothingAssetName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClothingInteractor*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetClothingInteractor) == 0x000008, "Wrong alignment on ClothingSimulationInteractor_GetClothingInteractor");
static_assert(sizeof(ClothingSimulationInteractor_GetClothingInteractor) == 0x000018, "Wrong size on ClothingSimulationInteractor_GetClothingInteractor");
static_assert(offsetof(ClothingSimulationInteractor_GetClothingInteractor, ClothingAssetName) == 0x000000, "Member 'ClothingSimulationInteractor_GetClothingInteractor::ClothingAssetName' has a wrong offset!");
static_assert(offsetof(ClothingSimulationInteractor_GetClothingInteractor, ReturnValue) == 0x000010, "Member 'ClothingSimulationInteractor_GetClothingInteractor::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetNumCloths
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetNumCloths final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetNumCloths) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetNumCloths");
static_assert(sizeof(ClothingSimulationInteractor_GetNumCloths) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetNumCloths");
static_assert(offsetof(ClothingSimulationInteractor_GetNumCloths, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetNumCloths::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetNumDynamicParticles
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetNumDynamicParticles final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetNumDynamicParticles) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetNumDynamicParticles");
static_assert(sizeof(ClothingSimulationInteractor_GetNumDynamicParticles) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetNumDynamicParticles");
static_assert(offsetof(ClothingSimulationInteractor_GetNumDynamicParticles, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetNumDynamicParticles::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetNumIterations
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetNumIterations final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetNumIterations) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetNumIterations");
static_assert(sizeof(ClothingSimulationInteractor_GetNumIterations) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetNumIterations");
static_assert(offsetof(ClothingSimulationInteractor_GetNumIterations, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetNumIterations::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetNumKinematicParticles
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetNumKinematicParticles final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetNumKinematicParticles) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetNumKinematicParticles");
static_assert(sizeof(ClothingSimulationInteractor_GetNumKinematicParticles) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetNumKinematicParticles");
static_assert(offsetof(ClothingSimulationInteractor_GetNumKinematicParticles, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetNumKinematicParticles::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetNumSubsteps
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetNumSubsteps final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetNumSubsteps) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetNumSubsteps");
static_assert(sizeof(ClothingSimulationInteractor_GetNumSubsteps) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetNumSubsteps");
static_assert(offsetof(ClothingSimulationInteractor_GetNumSubsteps, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetNumSubsteps::ReturnValue' has a wrong offset!");

// Function ClothingSystemRuntimeInterface.ClothingSimulationInteractor.GetSimulationTime
// 0x0004 (0x0004 - 0x0000)
struct ClothingSimulationInteractor_GetSimulationTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClothingSimulationInteractor_GetSimulationTime) == 0x000004, "Wrong alignment on ClothingSimulationInteractor_GetSimulationTime");
static_assert(sizeof(ClothingSimulationInteractor_GetSimulationTime) == 0x000004, "Wrong size on ClothingSimulationInteractor_GetSimulationTime");
static_assert(offsetof(ClothingSimulationInteractor_GetSimulationTime, ReturnValue) == 0x000000, "Member 'ClothingSimulationInteractor_GetSimulationTime::ReturnValue' has a wrong offset!");

}

