#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ConstructionSystemRuntime

#include "Basic.hpp"

#include "ConstructionSystemRuntime_structs.hpp"


namespace SDK::Params
{

// Function ConstructionSystemRuntime.ConstructionSystemBuildTool.HandleInput_RotateCursorStep
// 0x0004 (0x0004 - 0x0000)
struct ConstructionSystemBuildTool_HandleInput_RotateCursorStep final
{
public:
	float                                         NumSteps;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemBuildTool_HandleInput_RotateCursorStep) == 0x000004, "Wrong alignment on ConstructionSystemBuildTool_HandleInput_RotateCursorStep");
static_assert(sizeof(ConstructionSystemBuildTool_HandleInput_RotateCursorStep) == 0x000004, "Wrong size on ConstructionSystemBuildTool_HandleInput_RotateCursorStep");
static_assert(offsetof(ConstructionSystemBuildTool_HandleInput_RotateCursorStep, NumSteps) == 0x000000, "Member 'ConstructionSystemBuildTool_HandleInput_RotateCursorStep::NumSteps' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemBuildTool.SetActivePrefab
// 0x0008 (0x0008 - 0x0000)
struct ConstructionSystemBuildTool_SetActivePrefab final
{
public:
	class UPrefabricatorAssetInterface*           InActivePrefabAsset;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemBuildTool_SetActivePrefab) == 0x000008, "Wrong alignment on ConstructionSystemBuildTool_SetActivePrefab");
static_assert(sizeof(ConstructionSystemBuildTool_SetActivePrefab) == 0x000008, "Wrong size on ConstructionSystemBuildTool_SetActivePrefab");
static_assert(offsetof(ConstructionSystemBuildTool_SetActivePrefab, InActivePrefabAsset) == 0x000000, "Member 'ConstructionSystemBuildTool_SetActivePrefab::InActivePrefabAsset' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemComponent.EnableConstructionSystem
// 0x0001 (0x0001 - 0x0000)
struct ConstructionSystemComponent_EnableConstructionSystem final
{
public:
	EConstructionSystemToolType                   InToolType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemComponent_EnableConstructionSystem) == 0x000001, "Wrong alignment on ConstructionSystemComponent_EnableConstructionSystem");
static_assert(sizeof(ConstructionSystemComponent_EnableConstructionSystem) == 0x000001, "Wrong size on ConstructionSystemComponent_EnableConstructionSystem");
static_assert(offsetof(ConstructionSystemComponent_EnableConstructionSystem, InToolType) == 0x000000, "Member 'ConstructionSystemComponent_EnableConstructionSystem::InToolType' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemComponent.GetActiveTool
// 0x0008 (0x0008 - 0x0000)
struct ConstructionSystemComponent_GetActiveTool final
{
public:
	class UConstructionSystemTool*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemComponent_GetActiveTool) == 0x000008, "Wrong alignment on ConstructionSystemComponent_GetActiveTool");
static_assert(sizeof(ConstructionSystemComponent_GetActiveTool) == 0x000008, "Wrong size on ConstructionSystemComponent_GetActiveTool");
static_assert(offsetof(ConstructionSystemComponent_GetActiveTool, ReturnValue) == 0x000000, "Member 'ConstructionSystemComponent_GetActiveTool::ReturnValue' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemComponent.GetTool
// 0x0010 (0x0010 - 0x0000)
struct ConstructionSystemComponent_GetTool final
{
public:
	EConstructionSystemToolType                   InToolType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UConstructionSystemTool*                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemComponent_GetTool) == 0x000008, "Wrong alignment on ConstructionSystemComponent_GetTool");
static_assert(sizeof(ConstructionSystemComponent_GetTool) == 0x000010, "Wrong size on ConstructionSystemComponent_GetTool");
static_assert(offsetof(ConstructionSystemComponent_GetTool, InToolType) == 0x000000, "Member 'ConstructionSystemComponent_GetTool::InToolType' has a wrong offset!");
static_assert(offsetof(ConstructionSystemComponent_GetTool, ReturnValue) == 0x000008, "Member 'ConstructionSystemComponent_GetTool::ReturnValue' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemComponent.SetActiveTool
// 0x0001 (0x0001 - 0x0000)
struct ConstructionSystemComponent_SetActiveTool final
{
public:
	EConstructionSystemToolType                   InToolType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemComponent_SetActiveTool) == 0x000001, "Wrong alignment on ConstructionSystemComponent_SetActiveTool");
static_assert(sizeof(ConstructionSystemComponent_SetActiveTool) == 0x000001, "Wrong size on ConstructionSystemComponent_SetActiveTool");
static_assert(offsetof(ConstructionSystemComponent_SetActiveTool, InToolType) == 0x000000, "Member 'ConstructionSystemComponent_SetActiveTool::InToolType' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemComponent.GetActiveToolType
// 0x0001 (0x0001 - 0x0000)
struct ConstructionSystemComponent_GetActiveToolType final
{
public:
	EConstructionSystemToolType                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemComponent_GetActiveToolType) == 0x000001, "Wrong alignment on ConstructionSystemComponent_GetActiveToolType");
static_assert(sizeof(ConstructionSystemComponent_GetActiveToolType) == 0x000001, "Wrong size on ConstructionSystemComponent_GetActiveToolType");
static_assert(offsetof(ConstructionSystemComponent_GetActiveToolType, ReturnValue) == 0x000000, "Member 'ConstructionSystemComponent_GetActiveToolType::ReturnValue' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemSaveSystem.HandleConstructionSystemLevelLoad
// 0x0008 (0x0008 - 0x0000)
struct ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad) == 0x000008, "Wrong alignment on ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad");
static_assert(sizeof(ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad) == 0x000008, "Wrong size on ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad");
static_assert(offsetof(ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad, WorldContextObject) == 0x000000, "Member 'ConstructionSystemSaveSystem_HandleConstructionSystemLevelLoad::WorldContextObject' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemSaveSystem.LoadConstructionSystemLevel
// 0x0030 (0x0030 - 0x0000)
struct ConstructionSystemSaveSystem_LoadConstructionSystemLevel final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LevelName;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsolute;                                         // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SaveSlotName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel) == 0x000008, "Wrong alignment on ConstructionSystemSaveSystem_LoadConstructionSystemLevel");
static_assert(sizeof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel) == 0x000030, "Wrong size on ConstructionSystemSaveSystem_LoadConstructionSystemLevel");
static_assert(offsetof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel, WorldContextObject) == 0x000000, "Member 'ConstructionSystemSaveSystem_LoadConstructionSystemLevel::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel, LevelName) == 0x000008, "Member 'ConstructionSystemSaveSystem_LoadConstructionSystemLevel::LevelName' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel, bAbsolute) == 0x000010, "Member 'ConstructionSystemSaveSystem_LoadConstructionSystemLevel::bAbsolute' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel, SaveSlotName) == 0x000018, "Member 'ConstructionSystemSaveSystem_LoadConstructionSystemLevel::SaveSlotName' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_LoadConstructionSystemLevel, UserIndex) == 0x000028, "Member 'ConstructionSystemSaveSystem_LoadConstructionSystemLevel::UserIndex' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemSaveSystem.SaveConstructionSystemLevel
// 0x0020 (0x0020 - 0x0000)
struct ConstructionSystemSaveSystem_SaveConstructionSystemLevel final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveSlotName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UserIndex;                                         // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSavePlayerState;                                  // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel) == 0x000008, "Wrong alignment on ConstructionSystemSaveSystem_SaveConstructionSystemLevel");
static_assert(sizeof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel) == 0x000020, "Wrong size on ConstructionSystemSaveSystem_SaveConstructionSystemLevel");
static_assert(offsetof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel, WorldContextObject) == 0x000000, "Member 'ConstructionSystemSaveSystem_SaveConstructionSystemLevel::WorldContextObject' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel, SaveSlotName) == 0x000008, "Member 'ConstructionSystemSaveSystem_SaveConstructionSystemLevel::SaveSlotName' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel, UserIndex) == 0x000018, "Member 'ConstructionSystemSaveSystem_SaveConstructionSystemLevel::UserIndex' has a wrong offset!");
static_assert(offsetof(ConstructionSystemSaveSystem_SaveConstructionSystemLevel, bSavePlayerState) == 0x00001C, "Member 'ConstructionSystemSaveSystem_SaveConstructionSystemLevel::bSavePlayerState' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemBuildUI.SetConstructionSystem
// 0x0008 (0x0008 - 0x0000)
struct ConstructionSystemBuildUI_SetConstructionSystem final
{
public:
	class UConstructionSystemComponent*           ConstructionSystem;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemBuildUI_SetConstructionSystem) == 0x000008, "Wrong alignment on ConstructionSystemBuildUI_SetConstructionSystem");
static_assert(sizeof(ConstructionSystemBuildUI_SetConstructionSystem) == 0x000008, "Wrong size on ConstructionSystemBuildUI_SetConstructionSystem");
static_assert(offsetof(ConstructionSystemBuildUI_SetConstructionSystem, ConstructionSystem) == 0x000000, "Member 'ConstructionSystemBuildUI_SetConstructionSystem::ConstructionSystem' has a wrong offset!");

// Function ConstructionSystemRuntime.ConstructionSystemBuildUI.SetUIAsset
// 0x0008 (0x0008 - 0x0000)
struct ConstructionSystemBuildUI_SetUIAsset final
{
public:
	class UConstructionSystemUIAsset*             UIAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ConstructionSystemBuildUI_SetUIAsset) == 0x000008, "Wrong alignment on ConstructionSystemBuildUI_SetUIAsset");
static_assert(sizeof(ConstructionSystemBuildUI_SetUIAsset) == 0x000008, "Wrong size on ConstructionSystemBuildUI_SetUIAsset");
static_assert(offsetof(ConstructionSystemBuildUI_SetUIAsset, UIAsset) == 0x000000, "Member 'ConstructionSystemBuildUI_SetUIAsset::UIAsset' has a wrong offset!");

}

