#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlRig

#include "Basic.hpp"

#include "AnimationCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RigVM_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieSceneTracks_structs.hpp"


namespace SDK
{

// Enum ControlRig.EControlRigComponentSpace
// NumValues: 0x0006
enum class EControlRigComponentSpace : uint8
{
	WorldSpace                               = 0,
	ActorSpace                               = 1,
	ComponentSpace                           = 2,
	RigSpace                                 = 3,
	LocalSpace                               = 4,
	Max                                      = 5,
};

// Enum ControlRig.EControlRigComponentMapDirection
// NumValues: 0x0003
enum class EControlRigComponentMapDirection : uint8
{
	Input                                    = 0,
	Output                                   = 1,
	EControlRigComponentMapDirection_MAX     = 2,
};

// Enum ControlRig.ETransformSpaceMode
// NumValues: 0x0005
enum class ETransformSpaceMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	BaseSpace                                = 2,
	BaseJoint                                = 3,
	Max                                      = 4,
};

// Enum ControlRig.EControlRigClampSpatialMode
// NumValues: 0x0004
enum class EControlRigClampSpatialMode : uint8
{
	Plane                                    = 0,
	Cylinder                                 = 1,
	Sphere                                   = 2,
	EControlRigClampSpatialMode_MAX          = 3,
};

// Enum ControlRig.ETransformGetterType
// NumValues: 0x0003
enum class ETransformGetterType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EBoneGetterSetterMode
// NumValues: 0x0003
enum class EBoneGetterSetterMode : uint8
{
	LocalSpace                               = 0,
	GlobalSpace                              = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigExecutionType
// NumValues: 0x0003
enum class ERigExecutionType : uint8
{
	Runtime                                  = 0,
	Editing                                  = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigDrawSettings
// NumValues: 0x0005
enum class EControlRigDrawSettings : uint8
{
	Points                                   = 0,
	Lines                                    = 1,
	LineStrip                                = 2,
	DynamicMesh                              = 3,
	EControlRigDrawSettings_MAX              = 4,
};

// Enum ControlRig.EControlRigDrawHierarchyMode
// NumValues: 0x0002
enum class EControlRigDrawHierarchyMode : uint8
{
	Axes                                     = 0,
	Max                                      = 1,
};

// Enum ControlRig.EControlRigAnimEasingType
// NumValues: 0x0020
enum class EControlRigAnimEasingType : uint8
{
	Linear                                   = 0,
	QuadraticEaseIn                          = 1,
	QuadraticEaseOut                         = 2,
	QuadraticEaseInOut                       = 3,
	CubicEaseIn                              = 4,
	CubicEaseOut                             = 5,
	CubicEaseInOut                           = 6,
	QuarticEaseIn                            = 7,
	QuarticEaseOut                           = 8,
	QuarticEaseInOut                         = 9,
	QuinticEaseIn                            = 10,
	QuinticEaseOut                           = 11,
	QuinticEaseInOut                         = 12,
	SineEaseIn                               = 13,
	SineEaseOut                              = 14,
	SineEaseInOut                            = 15,
	CircularEaseIn                           = 16,
	CircularEaseOut                          = 17,
	CircularEaseInOut                        = 18,
	ExponentialEaseIn                        = 19,
	ExponentialEaseOut                       = 20,
	ExponentialEaseInOut                     = 21,
	ElasticEaseIn                            = 22,
	ElasticEaseOut                           = 23,
	ElasticEaseInOut                         = 24,
	BackEaseIn                               = 25,
	BackEaseOut                              = 26,
	BackEaseInOut                            = 27,
	BounceEaseIn                             = 28,
	BounceEaseOut                            = 29,
	BounceEaseInOut                          = 30,
	EControlRigAnimEasingType_MAX            = 31,
};

// Enum ControlRig.ECRSimPointIntegrateType
// NumValues: 0x0003
enum class ECRSimPointIntegrateType : uint8
{
	Verlet                                   = 0,
	SemiExplicitEuler                        = 1,
	ECRSimPointIntegrateType_MAX             = 2,
};

// Enum ControlRig.ECRSimConstraintType
// NumValues: 0x0005
enum class ECRSimConstraintType : uint8
{
	Distance                                 = 0,
	DistanceFromA                            = 1,
	DistanceFromB                            = 2,
	Plane                                    = 3,
	ECRSimConstraintType_MAX                 = 4,
};

// Enum ControlRig.ECRSimPointForceType
// NumValues: 0x0002
enum class ECRSimPointForceType : uint8
{
	Direction                                = 0,
	ECRSimPointForceType_MAX                 = 1,
};

// Enum ControlRig.ECRSimSoftCollisionType
// NumValues: 0x0004
enum class ECRSimSoftCollisionType : uint8
{
	Plane                                    = 0,
	Sphere                                   = 1,
	Cone                                     = 2,
	ECRSimSoftCollisionType_MAX              = 3,
};

// Enum ControlRig.EControlRigFKRigExecuteMode
// NumValues: 0x0003
enum class EControlRigFKRigExecuteMode : uint8
{
	Replace                                  = 0,
	Additive                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.EMovieSceneControlRigSpaceType
// NumValues: 0x0004
enum class EMovieSceneControlRigSpaceType : uint8
{
	Parent                                   = 0,
	World                                    = 1,
	ControlRig                               = 2,
	EMovieSceneControlRigSpaceType_MAX       = 3,
};

// Enum ControlRig.ERigTransformStackEntryType
// NumValues: 0x0005
enum class ERigTransformStackEntryType : uint8
{
	TransformPose                            = 0,
	ControlOffset                            = 1,
	ControlShape                             = 2,
	CurveValue                               = 3,
	ERigTransformStackEntryType_MAX          = 4,
};

// Enum ControlRig.ERigElementType
// NumValues: 0x000C
enum class ERigElementType : uint8
{
	None                                     = 0,
	Bone                                     = 1,
	Null                                     = 2,
	Space                                    = 2,
	Control                                  = 4,
	Curve                                    = 8,
	RigidBody                                = 16,
	Reference                                = 32,
	Last                                     = 64,
	All                                      = 63,
	ToResetAfterSetupEvent                   = 13,
	ERigElementType_MAX                      = 65,
};

// Enum ControlRig.ERigBoneType
// NumValues: 0x0003
enum class ERigBoneType : uint8
{
	Imported                                 = 0,
	User                                     = 1,
	ERigBoneType_MAX                         = 2,
};

// Enum ControlRig.ERigHierarchyNotification
// NumValues: 0x000C
enum class ERigHierarchyNotification : uint8
{
	ElementAdded                             = 0,
	ElementRemoved                           = 1,
	ElementRenamed                           = 2,
	ElementSelected                          = 3,
	ElementDeselected                        = 4,
	ParentChanged                            = 5,
	HierarchyReset                           = 6,
	ControlSettingChanged                    = 7,
	ControlVisibilityChanged                 = 8,
	ControlShapeTransformChanged             = 9,
	ParentWeightsChanged                     = 10,
	Max                                      = 11,
};

// Enum ControlRig.ERigEvent
// NumValues: 0x0003
enum class ERigEvent : uint8
{
	None                                     = 0,
	RequestAutoKey                           = 1,
	Max                                      = 2,
};

// Enum ControlRig.EControlRigSetKey
// NumValues: 0x0004
enum class EControlRigSetKey : uint8
{
	DoNotCare                                = 0,
	Always                                   = 1,
	Never                                    = 2,
	EControlRigSetKey_MAX                    = 3,
};

// Enum ControlRig.ERigControlType
// NumValues: 0x000B
enum class ERigControlType : uint8
{
	Bool                                     = 0,
	Float                                    = 1,
	Integer                                  = 2,
	Vector2D                                 = 3,
	Position                                 = 4,
	Scale                                    = 5,
	Rotator                                  = 6,
	Transform                                = 7,
	TransformNoScale                         = 8,
	EulerTransform                           = 9,
	ERigControlType_MAX                      = 10,
};

// Enum ControlRig.ERigControlValueType
// NumValues: 0x0005
enum class ERigControlValueType : uint8
{
	Initial                                  = 0,
	Current                                  = 1,
	Minimum                                  = 2,
	Maximum                                  = 3,
	ERigControlValueType_MAX                 = 4,
};

// Enum ControlRig.ERigControlAxis
// NumValues: 0x0004
enum class ERigControlAxis : uint8
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	ERigControlAxis_MAX                      = 3,
};

// Enum ControlRig.ERigTransformType
// NumValues: 0x0006
enum class ERigTransformType : uint8
{
	InitialLocal                             = 0,
	CurrentLocal                             = 1,
	InitialGlobal                            = 2,
	CurrentGlobal                            = 3,
	NumTransformTypes                        = 4,
	ERigTransformType_MAX                    = 5,
};

// Enum ControlRig.ERigSpaceType
// NumValues: 0x0005
enum class ERigSpaceType : uint8
{
	Global                                   = 0,
	Bone                                     = 1,
	Control                                  = 2,
	Space                                    = 3,
	ERigSpaceType_MAX                        = 4,
};

// Enum ControlRig.EControlRigState
// NumValues: 0x0004
enum class EControlRigState : uint8
{
	Init                                     = 0,
	Update                                   = 1,
	Invalid                                  = 2,
	EControlRigState_MAX                     = 3,
};

// Enum ControlRig.EAimMode
// NumValues: 0x0003
enum class EAimMode : uint8
{
	AimAtTarget                              = 0,
	OrientToTarget                           = 1,
	MAX                                      = 2,
};

// Enum ControlRig.EApplyTransformMode
// NumValues: 0x0003
enum class EApplyTransformMode : uint8
{
	Override                                 = 0,
	Additive                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugPointMode
// NumValues: 0x0003
enum class ERigUnitDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitDebugTransformMode
// NumValues: 0x0004
enum class ERigUnitDebugTransformMode : uint8
{
	Point                                    = 0,
	Axes                                     = 1,
	Box                                      = 2,
	Max                                      = 3,
};

// Enum ControlRig.ERigSwitchParentMode
// NumValues: 0x0004
enum class ERigSwitchParentMode : uint8
{
	World                                    = 0,
	DefaultParent                            = 1,
	ParentItem                               = 2,
	ERigSwitchParentMode_MAX                 = 3,
};

// Enum ControlRig.EControlRigCurveAlignment
// NumValues: 0x0003
enum class EControlRigCurveAlignment : uint8
{
	Front                                    = 0,
	Stretched                                = 1,
	EControlRigCurveAlignment_MAX            = 2,
};

// Enum ControlRig.EControlRigVectorKind
// NumValues: 0x0003
enum class EControlRigVectorKind : uint8
{
	Direction                                = 0,
	Location                                 = 1,
	EControlRigVectorKind_MAX                = 2,
};

// Enum ControlRig.ERBFKernelType
// NumValues: 0x0006
enum class ERBFKernelType : uint8
{
	Gaussian                                 = 0,
	Exponential                              = 1,
	Linear                                   = 2,
	Cubic                                    = 3,
	Quintic                                  = 4,
	ERBFKernelType_MAX                       = 5,
};

// Enum ControlRig.ERBFQuatDistanceType
// NumValues: 0x0005
enum class ERBFQuatDistanceType : uint8
{
	Euclidean                                = 0,
	ArcLength                                = 1,
	SwingAngle                               = 2,
	TwistAngle                               = 3,
	ERBFQuatDistanceType_MAX                 = 4,
};

// Enum ControlRig.ERBFVectorDistanceType
// NumValues: 0x0004
enum class ERBFVectorDistanceType : uint8
{
	Euclidean                                = 0,
	Manhattan                                = 1,
	ArcLength                                = 2,
	ERBFVectorDistanceType_MAX               = 3,
};

// Enum ControlRig.EControlRigModifyBoneMode
// NumValues: 0x0005
enum class EControlRigModifyBoneMode : uint8
{
	OverrideLocal                            = 0,
	OverrideGlobal                           = 1,
	AdditiveLocal                            = 2,
	AdditiveGlobal                           = 3,
	Max                                      = 4,
};

// Enum ControlRig.EConstraintInterpType
// NumValues: 0x0003
enum class EConstraintInterpType : uint8
{
	Average                                  = 0,
	Shortest                                 = 1,
	Max                                      = 2,
};

// Enum ControlRig.ERigUnitVisualDebugPointMode
// NumValues: 0x0003
enum class ERigUnitVisualDebugPointMode : uint8
{
	Point                                    = 0,
	Vector                                   = 1,
	Max                                      = 2,
};

// ScriptStruct ControlRig.RigUnit
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit : public FRigVMStruct
{
};
static_assert(alignof(FRigUnit) == 0x000008, "Wrong alignment on FRigUnit");
static_assert(sizeof(FRigUnit) == 0x000008, "Wrong size on FRigUnit");

// ScriptStruct ControlRig.RigUnit_MathBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_MathBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_MathBase) == 0x000008, "Wrong alignment on FRigUnit_MathBase");
static_assert(sizeof(FRigUnit_MathBase) == 0x000008, "Wrong size on FRigUnit_MathBase");

// ScriptStruct ControlRig.RigUnit_MathTransformBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_MathTransformBase : public FRigUnit_MathBase
{
};
static_assert(alignof(FRigUnit_MathTransformBase) == 0x000008, "Wrong alignment on FRigUnit_MathTransformBase");
static_assert(sizeof(FRigUnit_MathTransformBase) == 0x000008, "Wrong size on FRigUnit_MathTransformBase");

// ScriptStruct ControlRig.RigUnit_MathTransformUnaryOp
// 0x00C8 (0x00D0 - 0x0008)
struct FRigUnit_MathTransformUnaryOp : public FRigUnit_MathTransformBase
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0010(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Result;                                            // 0x0070(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_MathTransformUnaryOp) == 0x000010, "Wrong alignment on FRigUnit_MathTransformUnaryOp");
static_assert(sizeof(FRigUnit_MathTransformUnaryOp) == 0x0000D0, "Wrong size on FRigUnit_MathTransformUnaryOp");
static_assert(offsetof(FRigUnit_MathTransformUnaryOp, Value) == 0x000010, "Member 'FRigUnit_MathTransformUnaryOp::Value' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathTransformUnaryOp, Result) == 0x000070, "Member 'FRigUnit_MathTransformUnaryOp::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigHierarchyRef
// 0x0001 (0x0001 - 0x0000)
struct FRigHierarchyRef final
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigHierarchyRef) == 0x000001, "Wrong alignment on FRigHierarchyRef");
static_assert(sizeof(FRigHierarchyRef) == 0x000001, "Wrong size on FRigHierarchyRef");

// ScriptStruct ControlRig.RigUnit_DebugBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_DebugBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_DebugBase) == 0x000008, "Wrong alignment on FRigUnit_DebugBase");
static_assert(sizeof(FRigUnit_DebugBase) == 0x000008, "Wrong size on FRigUnit_DebugBase");

// ScriptStruct ControlRig.RigUnit_VisualDebugTransform
// 0x0088 (0x0090 - 0x0008)
struct FRigUnit_VisualDebugTransform final : public FRigUnit_DebugBase
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Value;                                             // 0x0010(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Thickness;                                         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneSpace;                                         // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_VisualDebugTransform) == 0x000010, "Wrong alignment on FRigUnit_VisualDebugTransform");
static_assert(sizeof(FRigUnit_VisualDebugTransform) == 0x000090, "Wrong size on FRigUnit_VisualDebugTransform");
static_assert(offsetof(FRigUnit_VisualDebugTransform, Value) == 0x000010, "Member 'FRigUnit_VisualDebugTransform::Value' has a wrong offset!");
static_assert(offsetof(FRigUnit_VisualDebugTransform, bEnabled) == 0x000070, "Member 'FRigUnit_VisualDebugTransform::bEnabled' has a wrong offset!");
static_assert(offsetof(FRigUnit_VisualDebugTransform, Thickness) == 0x000074, "Member 'FRigUnit_VisualDebugTransform::Thickness' has a wrong offset!");
static_assert(offsetof(FRigUnit_VisualDebugTransform, Scale) == 0x000078, "Member 'FRigUnit_VisualDebugTransform::Scale' has a wrong offset!");
static_assert(offsetof(FRigUnit_VisualDebugTransform, BoneSpace) == 0x00007C, "Member 'FRigUnit_VisualDebugTransform::BoneSpace' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigComponentMappedElement
// 0x00D0 (0x00D0 - 0x0000)
struct FControlRigComponentMappedElement final
{
public:
	struct FComponentReference                    ComponentReference;                                // 0x0000(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         TransformIndex;                                    // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TransformName;                                     // 0x002C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigElementType                               ElementType;                                       // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ElementName;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlRigComponentMapDirection              Direction;                                         // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Offset;                                            // 0x0050(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControlRigComponentSpace                     Space;                                             // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x00B8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ElementIndex;                                      // 0x00C0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubIndex;                                          // 0x00C4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FControlRigComponentMappedElement) == 0x000010, "Wrong alignment on FControlRigComponentMappedElement");
static_assert(sizeof(FControlRigComponentMappedElement) == 0x0000D0, "Wrong size on FControlRigComponentMappedElement");
static_assert(offsetof(FControlRigComponentMappedElement, ComponentReference) == 0x000000, "Member 'FControlRigComponentMappedElement::ComponentReference' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, TransformIndex) == 0x000028, "Member 'FControlRigComponentMappedElement::TransformIndex' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, TransformName) == 0x00002C, "Member 'FControlRigComponentMappedElement::TransformName' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, ElementType) == 0x000034, "Member 'FControlRigComponentMappedElement::ElementType' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, ElementName) == 0x000038, "Member 'FControlRigComponentMappedElement::ElementName' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, Direction) == 0x000040, "Member 'FControlRigComponentMappedElement::Direction' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, Offset) == 0x000050, "Member 'FControlRigComponentMappedElement::Offset' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, Weight) == 0x0000B0, "Member 'FControlRigComponentMappedElement::Weight' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, Space) == 0x0000B4, "Member 'FControlRigComponentMappedElement::Space' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, SceneComponent) == 0x0000B8, "Member 'FControlRigComponentMappedElement::SceneComponent' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, ElementIndex) == 0x0000C0, "Member 'FControlRigComponentMappedElement::ElementIndex' has a wrong offset!");
static_assert(offsetof(FControlRigComponentMappedElement, SubIndex) == 0x0000C4, "Member 'FControlRigComponentMappedElement::SubIndex' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_BinaryVectorOp
// 0x0048 (0x0050 - 0x0008)
struct FRigUnit_BinaryVectorOp : public FRigUnit
{
public:
	struct FVector                                Argument0;                                         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Argument1;                                         // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Result;                                            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_BinaryVectorOp) == 0x000008, "Wrong alignment on FRigUnit_BinaryVectorOp");
static_assert(sizeof(FRigUnit_BinaryVectorOp) == 0x000050, "Wrong size on FRigUnit_BinaryVectorOp");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Argument0) == 0x000008, "Member 'FRigUnit_BinaryVectorOp::Argument0' has a wrong offset!");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Argument1) == 0x000020, "Member 'FRigUnit_BinaryVectorOp::Argument1' has a wrong offset!");
static_assert(offsetof(FRigUnit_BinaryVectorOp, Result) == 0x000038, "Member 'FRigUnit_BinaryVectorOp::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_Subtract_VectorVector
// 0x0000 (0x0050 - 0x0050)
struct FRigUnit_Subtract_VectorVector final : public FRigUnit_BinaryVectorOp
{
};
static_assert(alignof(FRigUnit_Subtract_VectorVector) == 0x000008, "Wrong alignment on FRigUnit_Subtract_VectorVector");
static_assert(sizeof(FRigUnit_Subtract_VectorVector) == 0x000050, "Wrong size on FRigUnit_Subtract_VectorVector");

// ScriptStruct ControlRig.RigElement
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FRigElement
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigElement) == 0x000008, "Wrong alignment on FRigElement");
static_assert(sizeof(FRigElement) == 0x000018, "Wrong size on FRigElement");
static_assert(offsetof(FRigElement, Name) == 0x000008, "Member 'FRigElement::Name' has a wrong offset!");
static_assert(offsetof(FRigElement, Index) == 0x000010, "Member 'FRigElement::Index' has a wrong offset!");

// ScriptStruct ControlRig.RigCurve
// 0x0008 (0x0020 - 0x0018)
struct FRigCurve final : public FRigElement
{
public:
	float                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigCurve) == 0x000008, "Wrong alignment on FRigCurve");
static_assert(sizeof(FRigCurve) == 0x000020, "Wrong size on FRigCurve");
static_assert(offsetof(FRigCurve, Value) == 0x000018, "Member 'FRigCurve::Value' has a wrong offset!");

// ScriptStruct ControlRig.RigElementKey
// 0x000C (0x000C - 0x0000)
struct FRigElementKey final
{
public:
	ERigElementType                               Type;                                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigElementKey) == 0x000004, "Wrong alignment on FRigElementKey");
static_assert(sizeof(FRigElementKey) == 0x00000C, "Wrong size on FRigElementKey");
static_assert(offsetof(FRigElementKey, Type) == 0x000000, "Member 'FRigElementKey::Type' has a wrong offset!");
static_assert(offsetof(FRigElementKey, Name) == 0x000004, "Member 'FRigElementKey::Name' has a wrong offset!");

// ScriptStruct ControlRig.CachedRigElement
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FCachedRigElement final
{
public:
	struct FRigElementKey                         Key;                                               // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint16                                        Index;                                             // 0x000C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ContainerVersion;                                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_14[0xC];                                       // 0x0014(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCachedRigElement) == 0x000008, "Wrong alignment on FCachedRigElement");
static_assert(sizeof(FCachedRigElement) == 0x000020, "Wrong size on FCachedRigElement");
static_assert(offsetof(FCachedRigElement, Key) == 0x000000, "Member 'FCachedRigElement::Key' has a wrong offset!");
static_assert(offsetof(FCachedRigElement, Index) == 0x00000C, "Member 'FCachedRigElement::Index' has a wrong offset!");
static_assert(offsetof(FCachedRigElement, ContainerVersion) == 0x000010, "Member 'FCachedRigElement::ContainerVersion' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigExecuteContext
// 0x0000 (0x00C0 - 0x00C0)
struct FControlRigExecuteContext final : public FRigVMExecuteContext
{
};
static_assert(alignof(FControlRigExecuteContext) == 0x000010, "Wrong alignment on FControlRigExecuteContext");
static_assert(sizeof(FControlRigExecuteContext) == 0x0000C0, "Wrong size on FControlRigExecuteContext");

// ScriptStruct ControlRig.RigUnitMutable
// 0x00C8 (0x00D0 - 0x0008)
struct FRigUnitMutable : public FRigUnit
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext;                                    // 0x0010(0x00C0)(Transient, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnitMutable) == 0x000010, "Wrong alignment on FRigUnitMutable");
static_assert(sizeof(FRigUnitMutable) == 0x0000D0, "Wrong size on FRigUnitMutable");
static_assert(offsetof(FRigUnitMutable, ExecuteContext) == 0x000010, "Member 'FRigUnitMutable::ExecuteContext' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SetRelativeBoneTransform
// 0x00C0 (0x0190 - 0x00D0)
struct FRigUnit_SetRelativeBoneTransform final : public FRigUnitMutable
{
public:
	class FName                                   bone;                                              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Space;                                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPropagateToChildren;                              // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCachedRigElement                      CachedBone;                                        // 0x0148(0x0020)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCachedRigElement                      CachedSpaceIndex;                                  // 0x0168(0x0020)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_SetRelativeBoneTransform) == 0x000010, "Wrong alignment on FRigUnit_SetRelativeBoneTransform");
static_assert(sizeof(FRigUnit_SetRelativeBoneTransform) == 0x000190, "Wrong size on FRigUnit_SetRelativeBoneTransform");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, bone) == 0x0000D0, "Member 'FRigUnit_SetRelativeBoneTransform::bone' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, Space) == 0x0000D8, "Member 'FRigUnit_SetRelativeBoneTransform::Space' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, Transform) == 0x0000E0, "Member 'FRigUnit_SetRelativeBoneTransform::Transform' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, Weight) == 0x000140, "Member 'FRigUnit_SetRelativeBoneTransform::Weight' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, bPropagateToChildren) == 0x000144, "Member 'FRigUnit_SetRelativeBoneTransform::bPropagateToChildren' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, CachedBone) == 0x000148, "Member 'FRigUnit_SetRelativeBoneTransform::CachedBone' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetRelativeBoneTransform, CachedSpaceIndex) == 0x000168, "Member 'FRigUnit_SetRelativeBoneTransform::CachedSpaceIndex' has a wrong offset!");

// ScriptStruct ControlRig.ConstraintNodeData
// 0x0140 (0x0140 - 0x0000)
struct FConstraintNodeData final
{
public:
	struct FTransform                             RelativeParent;                                    // 0x0000(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FConstraintOffset                      ConstraintOffset;                                  // 0x0060(0x00C0)(NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   LinkedNode;                                        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransformConstraint>           Constraints;                                       // 0x0128(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FConstraintNodeData) == 0x000010, "Wrong alignment on FConstraintNodeData");
static_assert(sizeof(FConstraintNodeData) == 0x000140, "Wrong size on FConstraintNodeData");
static_assert(offsetof(FConstraintNodeData, RelativeParent) == 0x000000, "Member 'FConstraintNodeData::RelativeParent' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, ConstraintOffset) == 0x000060, "Member 'FConstraintNodeData::ConstraintOffset' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, LinkedNode) == 0x000120, "Member 'FConstraintNodeData::LinkedNode' has a wrong offset!");
static_assert(offsetof(FConstraintNodeData, Constraints) == 0x000128, "Member 'FConstraintNodeData::Constraints' has a wrong offset!");

// ScriptStruct ControlRig.AnimationHierarchy
// 0x0010 (0x0088 - 0x0078)
struct FAnimationHierarchy final : public FNodeHierarchyWithUserData
{
public:
	TArray<struct FConstraintNodeData>            UserData;                                          // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAnimationHierarchy) == 0x000008, "Wrong alignment on FAnimationHierarchy");
static_assert(sizeof(FAnimationHierarchy) == 0x000088, "Wrong size on FAnimationHierarchy");
static_assert(offsetof(FAnimationHierarchy, UserData) == 0x000078, "Member 'FAnimationHierarchy::UserData' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SetMultiControlVector2D_Entry
// 0x0018 (0x0018 - 0x0000)
struct FRigUnit_SetMultiControlVector2D_Entry final
{
public:
	class FName                                   Control;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Vector;                                            // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_SetMultiControlVector2D_Entry) == 0x000008, "Wrong alignment on FRigUnit_SetMultiControlVector2D_Entry");
static_assert(sizeof(FRigUnit_SetMultiControlVector2D_Entry) == 0x000018, "Wrong size on FRigUnit_SetMultiControlVector2D_Entry");
static_assert(offsetof(FRigUnit_SetMultiControlVector2D_Entry, Control) == 0x000000, "Member 'FRigUnit_SetMultiControlVector2D_Entry::Control' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetMultiControlVector2D_Entry, Vector) == 0x000008, "Member 'FRigUnit_SetMultiControlVector2D_Entry::Vector' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SetMultiControlVector2D
// 0x0030 (0x0100 - 0x00D0)
struct FRigUnit_SetMultiControlVector2D final : public FRigUnitMutable
{
public:
	TArray<struct FRigUnit_SetMultiControlVector2D_Entry> Entries;                                           // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         Weight;                                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCachedRigElement>              CachedControlIndices;                              // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_SetMultiControlVector2D) == 0x000010, "Wrong alignment on FRigUnit_SetMultiControlVector2D");
static_assert(sizeof(FRigUnit_SetMultiControlVector2D) == 0x000100, "Wrong size on FRigUnit_SetMultiControlVector2D");
static_assert(offsetof(FRigUnit_SetMultiControlVector2D, Entries) == 0x0000D0, "Member 'FRigUnit_SetMultiControlVector2D::Entries' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetMultiControlVector2D, Weight) == 0x0000E0, "Member 'FRigUnit_SetMultiControlVector2D::Weight' has a wrong offset!");
static_assert(offsetof(FRigUnit_SetMultiControlVector2D, CachedControlIndices) == 0x0000E8, "Member 'FRigUnit_SetMultiControlVector2D::CachedControlIndices' has a wrong offset!");

// ScriptStruct ControlRig.RigControlModifiedContext
// 0x0014 (0x0014 - 0x0000)
struct alignas(0x04) FRigControlModifiedContext final
{
public:
	uint8                                         Pad_0[0x14];                                       // 0x0000(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigControlModifiedContext) == 0x000004, "Wrong alignment on FRigControlModifiedContext");
static_assert(sizeof(FRigControlModifiedContext) == 0x000014, "Wrong size on FRigControlModifiedContext");

// ScriptStruct ControlRig.RigUnit_MathVectorBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_MathVectorBase : public FRigUnit_MathBase
{
};
static_assert(alignof(FRigUnit_MathVectorBase) == 0x000008, "Wrong alignment on FRigUnit_MathVectorBase");
static_assert(sizeof(FRigUnit_MathVectorBase) == 0x000008, "Wrong size on FRigUnit_MathVectorBase");

// ScriptStruct ControlRig.RigUnit_MathVectorIsNearlyZero
// 0x0020 (0x0028 - 0x0008)
struct FRigUnit_MathVectorIsNearlyZero final : public FRigUnit_MathVectorBase
{
public:
	struct FVector                                Value;                                             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Tolerance;                                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigUnit_MathVectorIsNearlyZero) == 0x000008, "Wrong alignment on FRigUnit_MathVectorIsNearlyZero");
static_assert(sizeof(FRigUnit_MathVectorIsNearlyZero) == 0x000028, "Wrong size on FRigUnit_MathVectorIsNearlyZero");
static_assert(offsetof(FRigUnit_MathVectorIsNearlyZero, Value) == 0x000008, "Member 'FRigUnit_MathVectorIsNearlyZero::Value' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathVectorIsNearlyZero, Tolerance) == 0x000020, "Member 'FRigUnit_MathVectorIsNearlyZero::Tolerance' has a wrong offset!");
static_assert(offsetof(FRigUnit_MathVectorIsNearlyZero, Result) == 0x000024, "Member 'FRigUnit_MathVectorIsNearlyZero::Result' has a wrong offset!");

// ScriptStruct ControlRig.RigTransformStackEntry
// 0x00F0 (0x00F0 - 0x0000)
struct FRigTransformStackEntry final
{
public:
	struct FRigElementKey                         Key;                                               // 0x0000(0x000C)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigTransformStackEntryType                   EntryType;                                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERigTransformType                             TransformType;                                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OldTransform;                                      // 0x0010(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             NewTransform;                                      // 0x0070(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bAffectChildren;                                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Callstack;                                         // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRigTransformStackEntry) == 0x000010, "Wrong alignment on FRigTransformStackEntry");
static_assert(sizeof(FRigTransformStackEntry) == 0x0000F0, "Wrong size on FRigTransformStackEntry");
static_assert(offsetof(FRigTransformStackEntry, Key) == 0x000000, "Member 'FRigTransformStackEntry::Key' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, EntryType) == 0x00000C, "Member 'FRigTransformStackEntry::EntryType' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, TransformType) == 0x00000D, "Member 'FRigTransformStackEntry::TransformType' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, OldTransform) == 0x000010, "Member 'FRigTransformStackEntry::OldTransform' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, NewTransform) == 0x000070, "Member 'FRigTransformStackEntry::NewTransform' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, bAffectChildren) == 0x0000D0, "Member 'FRigTransformStackEntry::bAffectChildren' has a wrong offset!");
static_assert(offsetof(FRigTransformStackEntry, Callstack) == 0x0000D8, "Member 'FRigTransformStackEntry::Callstack' has a wrong offset!");

// ScriptStruct ControlRig.ControlRigIOSettings
// 0x0002 (0x0002 - 0x0000)
struct FControlRigIOSettings final
{
public:
	bool                                          bUpdatePose;                                       // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUpdateCurves;                                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FControlRigIOSettings) == 0x000001, "Wrong alignment on FControlRigIOSettings");
static_assert(sizeof(FControlRigIOSettings) == 0x000002, "Wrong size on FControlRigIOSettings");
static_assert(offsetof(FControlRigIOSettings, bUpdatePose) == 0x000000, "Member 'FControlRigIOSettings::bUpdatePose' has a wrong offset!");
static_assert(offsetof(FControlRigIOSettings, bUpdateCurves) == 0x000001, "Member 'FControlRigIOSettings::bUpdateCurves' has a wrong offset!");

// ScriptStruct ControlRig.AnimNode_ControlRigBase
// 0x0200 (0x0258 - 0x0058)
struct FAnimNode_ControlRigBase : public FAnimNode_CustomProperty
{
public:
	struct FPoseLink                              Source;                                            // 0x0058(0x0010)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bResetInputPoseToInitial;                          // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTransferInputPose;                                // 0x0069(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTransferInputCurves;                              // 0x006A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bTransferPoseInGlobalSpace;                        // 0x006B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBoneReference>                 InputBonesToTransfer;                              // 0x0070(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x1C0];                                     // 0x0080(0x01C0)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UNodeMappingContainer>   NodeMappingContainer;                              // 0x0240(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FControlRigIOSettings                  InputSettings;                                     // 0x0248(0x0002)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FControlRigIOSettings                  OutputSettings;                                    // 0x024A(0x0002)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bExecute;                                          // 0x024C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_24D[0xB];                                      // 0x024D(0x000B)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAnimNode_ControlRigBase) == 0x000008, "Wrong alignment on FAnimNode_ControlRigBase");
static_assert(sizeof(FAnimNode_ControlRigBase) == 0x000258, "Wrong size on FAnimNode_ControlRigBase");
static_assert(offsetof(FAnimNode_ControlRigBase, Source) == 0x000058, "Member 'FAnimNode_ControlRigBase::Source' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bResetInputPoseToInitial) == 0x000068, "Member 'FAnimNode_ControlRigBase::bResetInputPoseToInitial' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bTransferInputPose) == 0x000069, "Member 'FAnimNode_ControlRigBase::bTransferInputPose' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bTransferInputCurves) == 0x00006A, "Member 'FAnimNode_ControlRigBase::bTransferInputCurves' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bTransferPoseInGlobalSpace) == 0x00006B, "Member 'FAnimNode_ControlRigBase::bTransferPoseInGlobalSpace' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, InputBonesToTransfer) == 0x000070, "Member 'FAnimNode_ControlRigBase::InputBonesToTransfer' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, NodeMappingContainer) == 0x000240, "Member 'FAnimNode_ControlRigBase::NodeMappingContainer' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, InputSettings) == 0x000248, "Member 'FAnimNode_ControlRigBase::InputSettings' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, OutputSettings) == 0x00024A, "Member 'FAnimNode_ControlRigBase::OutputSettings' has a wrong offset!");
static_assert(offsetof(FAnimNode_ControlRigBase, bExecute) == 0x00024C, "Member 'FAnimNode_ControlRigBase::bExecute' has a wrong offset!");

// ScriptStruct ControlRig.RigElementKeyCollection
// 0x0010 (0x0010 - 0x0000)
struct FRigElementKeyCollection final
{
public:
	TArray<struct FRigElementKey>                 Keys;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigElementKeyCollection) == 0x000008, "Wrong alignment on FRigElementKeyCollection");
static_assert(sizeof(FRigElementKeyCollection) == 0x000010, "Wrong size on FRigElementKeyCollection");
static_assert(offsetof(FRigElementKeyCollection, Keys) == 0x000000, "Member 'FRigElementKeyCollection::Keys' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_CollectionBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_CollectionBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_CollectionBase) == 0x000008, "Wrong alignment on FRigUnit_CollectionBase");
static_assert(sizeof(FRigUnit_CollectionBase) == 0x000008, "Wrong size on FRigUnit_CollectionBase");

// ScriptStruct ControlRig.RigUnit_CollectionGetParentIndices
// 0x0020 (0x0028 - 0x0008)
struct FRigUnit_CollectionGetParentIndices final : public FRigUnit_CollectionBase
{
public:
	struct FRigElementKeyCollection               Collection;                                        // 0x0008(0x0010)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ParentIndices;                                     // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_CollectionGetParentIndices) == 0x000008, "Wrong alignment on FRigUnit_CollectionGetParentIndices");
static_assert(sizeof(FRigUnit_CollectionGetParentIndices) == 0x000028, "Wrong size on FRigUnit_CollectionGetParentIndices");
static_assert(offsetof(FRigUnit_CollectionGetParentIndices, Collection) == 0x000008, "Member 'FRigUnit_CollectionGetParentIndices::Collection' has a wrong offset!");
static_assert(offsetof(FRigUnit_CollectionGetParentIndices, ParentIndices) == 0x000018, "Member 'FRigUnit_CollectionGetParentIndices::ParentIndices' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_SimBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_SimBase : public FRigUnit
{
};
static_assert(alignof(FRigUnit_SimBase) == 0x000008, "Wrong alignment on FRigUnit_SimBase");
static_assert(sizeof(FRigUnit_SimBase) == 0x000008, "Wrong size on FRigUnit_SimBase");

// ScriptStruct ControlRig.RigUnit_AccumulateBase
// 0x0000 (0x0008 - 0x0008)
struct FRigUnit_AccumulateBase : public FRigUnit_SimBase
{
};
static_assert(alignof(FRigUnit_AccumulateBase) == 0x000008, "Wrong alignment on FRigUnit_AccumulateBase");
static_assert(sizeof(FRigUnit_AccumulateBase) == 0x000008, "Wrong size on FRigUnit_AccumulateBase");

// ScriptStruct ControlRig.RigUnit_AccumulateQuatLerp
// 0x0098 (0x00A0 - 0x0008)
struct FRigUnit_AccumulateQuatLerp final : public FRigUnit_AccumulateBase
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  TargetValue;                                       // 0x0010(0x0020)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FQuat                                  InitialValue;                                      // 0x0030(0x0020)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Blend;                                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIntegrateDeltaTime;                               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0xB];                                       // 0x0055(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  Result;                                            // 0x0060(0x0020)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FQuat                                  AccumulatedValue;                                  // 0x0080(0x0020)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRigUnit_AccumulateQuatLerp) == 0x000010, "Wrong alignment on FRigUnit_AccumulateQuatLerp");
static_assert(sizeof(FRigUnit_AccumulateQuatLerp) == 0x0000A0, "Wrong size on FRigUnit_AccumulateQuatLerp");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, TargetValue) == 0x000010, "Member 'FRigUnit_AccumulateQuatLerp::TargetValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, InitialValue) == 0x000030, "Member 'FRigUnit_AccumulateQuatLerp::InitialValue' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, Blend) == 0x000050, "Member 'FRigUnit_AccumulateQuatLerp::Blend' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, bIntegrateDeltaTime) == 0x000054, "Member 'FRigUnit_AccumulateQuatLerp::bIntegrateDeltaTime' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, Result) == 0x000060, "Member 'FRigUnit_AccumulateQuatLerp::Result' has a wrong offset!");
static_assert(offsetof(FRigUnit_AccumulateQuatLerp, AccumulatedValue) == 0x000080, "Member 'FRigUnit_AccumulateQuatLerp::AccumulatedValue' has a wrong offset!");

// ScriptStruct ControlRig.RigUnit_VisualDebugVector
// 0x0040 (0x0048 - 0x0008)
struct FRigUnit_VisualDebugVector final : public FRigUnit_DebugBase
{
public:
	struct FVector                                Value;                                             // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
