#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomLightSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum CustomLightSystem.EWaterReflectionMode
// NumValues: 0x0004
enum class EWaterReflectionMode : uint8
{
	None                                     = 0,
	Lumen                                    = 1,
	ReflectionSphere                         = 3,
	EWaterReflectionMode_MAX                 = 4,
};

// ScriptStruct CustomLightSystem.CLSDirectionalLightData
// 0x01A0 (0x01A0 - 0x0000)
struct FCLSDirectionalLightData final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LightColor;                                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAffectsWorld : 1;                                 // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastShadows : 1;                                   // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastStaticShadows : 1;                             // 0x001C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastDynamicShadows : 1;                            // 0x001C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectTranslucentLighting : 1;                    // 0x001C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransmission : 1;                                 // 0x001C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastVolumetricShadow : 1;                         // 0x001C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastDeepShadow : 1;                               // 0x001C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ECastRayTracedShadow                          CastRaytracedShadow;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAffectReflection : 1;                             // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectGlobalIllumination : 1;                     // 0x0024(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeepShadowLayerDistribution;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IndirectLightingIntensity;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplesPerPixel;                                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Temperature;                                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDrawDistance;                                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistanceFadeRange;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseTemperature : 1;                               // 0x0044(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpecularScale;                                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowResolutionScale;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowBias;                                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowSlopeBias;                                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowSharpen;                                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ContactShadowLength;                               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ContactShadowLengthInWS : 1;                       // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastTranslucentShadows : 1;                        // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastShadowsFromCinematicObjectsOnly : 1;          // 0x0060(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectDynamicIndirectLighting : 1;                // 0x0060(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bForceCachedShadowsForMovablePrimitives : 1;       // 0x0060(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLightingChannels                      LightingChannels;                                  // 0x0064(0x0001)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     LightFunctionMaterial;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                LightFunctionScale;                                // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureLightProfile*                   IESTexture;                                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseIESBrightness : 1;                             // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IESBrightnessScale;                                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightFunctionFadeDistance;                         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DisabledBrightness;                                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableLightShaftBloom : 1;                        // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BloomScale;                                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomThreshold;                                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BloomMaxBrightness;                                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 BloomTint;                                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRayTracedDistanceFieldShadows;                 // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RayStartOffsetDepthScale;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowCascadeBiasDistribution;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableLightShaftOcclusion : 1;                    // 0x00C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionMaskDarkness;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionDepthRange;                               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LightShaftOverrideDirection;                       // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicShadowDistanceMovableLight;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicShadowDistanceStationaryLight;              // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DynamicShadowCascades;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CascadeDistributionExponent;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CascadeTransitionFraction;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowDistanceFadeoutFraction;                     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseInsetShadowsForMovableObjects : 1;             // 0x0100(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FarShadowCascadeCount;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarShadowDistance;                                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistanceFieldShadowDistance;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightSourceAngle;                                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightSourceSoftAngle;                              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowSourceAngleFactor;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceDistance;                                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAtmosphereSunLight : 1;                           // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AtmosphereSunLightIndex;                           // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AtmosphereSunDiskColorScale;                       // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPerPixelAtmosphereTransmittance : 1;              // 0x0138(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastShadowsOnClouds : 1;                          // 0x0138(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastShadowsOnAtmosphere : 1;                      // 0x0138(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastCloudShadows : 1;                             // 0x0138(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CloudShadowStrength;                               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowOnAtmosphereStrength;                   // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowOnSurfaceStrength;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowDepthBias;                              // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowExtent;                                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowMapResolutionScale;                     // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudShadowRaySampleCountScale;                    // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudScatteredLuminanceScale;                      // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLightmassDirectionalLightSettings     LightmassSettings;                                 // 0x0168(0x0010)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bCastModulatedShadows : 1;                         // 0x0178(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 ModulatedShadowColor;                              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowAmount;                                      // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Rotation;                                          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCLSDirectionalLightData) == 0x000008, "Wrong alignment on FCLSDirectionalLightData");
static_assert(sizeof(FCLSDirectionalLightData) == 0x0001A0, "Wrong size on FCLSDirectionalLightData");
static_assert(offsetof(FCLSDirectionalLightData, Name) == 0x000000, "Member 'FCLSDirectionalLightData::Name' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, bValid) == 0x000010, "Member 'FCLSDirectionalLightData::bValid' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, Intensity) == 0x000014, "Member 'FCLSDirectionalLightData::Intensity' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightColor) == 0x000018, "Member 'FCLSDirectionalLightData::LightColor' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CastRaytracedShadow) == 0x000020, "Member 'FCLSDirectionalLightData::CastRaytracedShadow' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DeepShadowLayerDistribution) == 0x000028, "Member 'FCLSDirectionalLightData::DeepShadowLayerDistribution' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, IndirectLightingIntensity) == 0x00002C, "Member 'FCLSDirectionalLightData::IndirectLightingIntensity' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, VolumetricScatteringIntensity) == 0x000030, "Member 'FCLSDirectionalLightData::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, SamplesPerPixel) == 0x000034, "Member 'FCLSDirectionalLightData::SamplesPerPixel' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, Temperature) == 0x000038, "Member 'FCLSDirectionalLightData::Temperature' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, MaxDrawDistance) == 0x00003C, "Member 'FCLSDirectionalLightData::MaxDrawDistance' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, MaxDistanceFadeRange) == 0x000040, "Member 'FCLSDirectionalLightData::MaxDistanceFadeRange' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, SpecularScale) == 0x000048, "Member 'FCLSDirectionalLightData::SpecularScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowResolutionScale) == 0x00004C, "Member 'FCLSDirectionalLightData::ShadowResolutionScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowBias) == 0x000050, "Member 'FCLSDirectionalLightData::ShadowBias' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowSlopeBias) == 0x000054, "Member 'FCLSDirectionalLightData::ShadowSlopeBias' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowSharpen) == 0x000058, "Member 'FCLSDirectionalLightData::ShadowSharpen' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ContactShadowLength) == 0x00005C, "Member 'FCLSDirectionalLightData::ContactShadowLength' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightingChannels) == 0x000064, "Member 'FCLSDirectionalLightData::LightingChannels' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightFunctionMaterial) == 0x000068, "Member 'FCLSDirectionalLightData::LightFunctionMaterial' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightFunctionScale) == 0x000070, "Member 'FCLSDirectionalLightData::LightFunctionScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, IESTexture) == 0x000088, "Member 'FCLSDirectionalLightData::IESTexture' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, IESBrightnessScale) == 0x000094, "Member 'FCLSDirectionalLightData::IESBrightnessScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightFunctionFadeDistance) == 0x000098, "Member 'FCLSDirectionalLightData::LightFunctionFadeDistance' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DisabledBrightness) == 0x00009C, "Member 'FCLSDirectionalLightData::DisabledBrightness' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, BloomScale) == 0x0000A4, "Member 'FCLSDirectionalLightData::BloomScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, BloomThreshold) == 0x0000A8, "Member 'FCLSDirectionalLightData::BloomThreshold' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, BloomMaxBrightness) == 0x0000AC, "Member 'FCLSDirectionalLightData::BloomMaxBrightness' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, BloomTint) == 0x0000B0, "Member 'FCLSDirectionalLightData::BloomTint' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, bUseRayTracedDistanceFieldShadows) == 0x0000B4, "Member 'FCLSDirectionalLightData::bUseRayTracedDistanceFieldShadows' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, RayStartOffsetDepthScale) == 0x0000B8, "Member 'FCLSDirectionalLightData::RayStartOffsetDepthScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowCascadeBiasDistribution) == 0x0000BC, "Member 'FCLSDirectionalLightData::ShadowCascadeBiasDistribution' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, OcclusionMaskDarkness) == 0x0000C4, "Member 'FCLSDirectionalLightData::OcclusionMaskDarkness' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, OcclusionDepthRange) == 0x0000C8, "Member 'FCLSDirectionalLightData::OcclusionDepthRange' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightShaftOverrideDirection) == 0x0000D0, "Member 'FCLSDirectionalLightData::LightShaftOverrideDirection' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DynamicShadowDistanceMovableLight) == 0x0000E8, "Member 'FCLSDirectionalLightData::DynamicShadowDistanceMovableLight' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DynamicShadowDistanceStationaryLight) == 0x0000EC, "Member 'FCLSDirectionalLightData::DynamicShadowDistanceStationaryLight' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DynamicShadowCascades) == 0x0000F0, "Member 'FCLSDirectionalLightData::DynamicShadowCascades' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CascadeDistributionExponent) == 0x0000F4, "Member 'FCLSDirectionalLightData::CascadeDistributionExponent' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CascadeTransitionFraction) == 0x0000F8, "Member 'FCLSDirectionalLightData::CascadeTransitionFraction' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowDistanceFadeoutFraction) == 0x0000FC, "Member 'FCLSDirectionalLightData::ShadowDistanceFadeoutFraction' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, FarShadowCascadeCount) == 0x000104, "Member 'FCLSDirectionalLightData::FarShadowCascadeCount' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, FarShadowDistance) == 0x000108, "Member 'FCLSDirectionalLightData::FarShadowDistance' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, DistanceFieldShadowDistance) == 0x00010C, "Member 'FCLSDirectionalLightData::DistanceFieldShadowDistance' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightSourceAngle) == 0x000110, "Member 'FCLSDirectionalLightData::LightSourceAngle' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightSourceSoftAngle) == 0x000114, "Member 'FCLSDirectionalLightData::LightSourceSoftAngle' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowSourceAngleFactor) == 0x000118, "Member 'FCLSDirectionalLightData::ShadowSourceAngleFactor' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, TraceDistance) == 0x00011C, "Member 'FCLSDirectionalLightData::TraceDistance' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, AtmosphereSunLightIndex) == 0x000124, "Member 'FCLSDirectionalLightData::AtmosphereSunLightIndex' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, AtmosphereSunDiskColorScale) == 0x000128, "Member 'FCLSDirectionalLightData::AtmosphereSunDiskColorScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowStrength) == 0x00013C, "Member 'FCLSDirectionalLightData::CloudShadowStrength' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowOnAtmosphereStrength) == 0x000140, "Member 'FCLSDirectionalLightData::CloudShadowOnAtmosphereStrength' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowOnSurfaceStrength) == 0x000144, "Member 'FCLSDirectionalLightData::CloudShadowOnSurfaceStrength' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowDepthBias) == 0x000148, "Member 'FCLSDirectionalLightData::CloudShadowDepthBias' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowExtent) == 0x00014C, "Member 'FCLSDirectionalLightData::CloudShadowExtent' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowMapResolutionScale) == 0x000150, "Member 'FCLSDirectionalLightData::CloudShadowMapResolutionScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudShadowRaySampleCountScale) == 0x000154, "Member 'FCLSDirectionalLightData::CloudShadowRaySampleCountScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, CloudScatteredLuminanceScale) == 0x000158, "Member 'FCLSDirectionalLightData::CloudScatteredLuminanceScale' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, LightmassSettings) == 0x000168, "Member 'FCLSDirectionalLightData::LightmassSettings' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ModulatedShadowColor) == 0x00017C, "Member 'FCLSDirectionalLightData::ModulatedShadowColor' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, ShadowAmount) == 0x000180, "Member 'FCLSDirectionalLightData::ShadowAmount' has a wrong offset!");
static_assert(offsetof(FCLSDirectionalLightData, Rotation) == 0x000188, "Member 'FCLSDirectionalLightData::Rotation' has a wrong offset!");

// ScriptStruct CustomLightSystem.CLSPlayerLightDataBase
// 0x0028 (0x0028 - 0x0000)
struct FCLSPlayerLightDataBase final
{
public:
	float                                         Intensity;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AttenuationRadius;                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCastShadows;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CastShadowMapShadow;                               // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ContactShadowLength;                               // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTemperature;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temperature;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpecularScale;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCLSPlayerLightDataBase) == 0x000004, "Wrong alignment on FCLSPlayerLightDataBase");
static_assert(sizeof(FCLSPlayerLightDataBase) == 0x000028, "Wrong size on FCLSPlayerLightDataBase");
static_assert(offsetof(FCLSPlayerLightDataBase, Intensity) == 0x000000, "Member 'FCLSPlayerLightDataBase::Intensity' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, Color) == 0x000004, "Member 'FCLSPlayerLightDataBase::Color' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, Radius) == 0x000008, "Member 'FCLSPlayerLightDataBase::Radius' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, AttenuationRadius) == 0x00000C, "Member 'FCLSPlayerLightDataBase::AttenuationRadius' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, bCastShadows) == 0x000010, "Member 'FCLSPlayerLightDataBase::bCastShadows' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, CastShadowMapShadow) == 0x000011, "Member 'FCLSPlayerLightDataBase::CastShadowMapShadow' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, ContactShadowLength) == 0x000014, "Member 'FCLSPlayerLightDataBase::ContactShadowLength' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, bUseTemperature) == 0x000018, "Member 'FCLSPlayerLightDataBase::bUseTemperature' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, Temperature) == 0x00001C, "Member 'FCLSPlayerLightDataBase::Temperature' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, VolumetricScatteringIntensity) == 0x000020, "Member 'FCLSPlayerLightDataBase::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FCLSPlayerLightDataBase, SpecularScale) == 0x000024, "Member 'FCLSPlayerLightDataBase::SpecularScale' has a wrong offset!");

// ScriptStruct CustomLightSystem.CLSSkyLightData
// 0x0140 (0x0140 - 0x0000)
struct FCLSSkyLightData final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity;                                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 LightColor;                                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAffectsWorld : 1;                                 // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastShadows : 1;                                   // 0x001C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastStaticShadows : 1;                             // 0x001C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         CastDynamicShadows : 1;                            // 0x001C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectTranslucentLighting : 1;                    // 0x001C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTransmission : 1;                                 // 0x001C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastVolumetricShadow : 1;                         // 0x001C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCastDeepShadow : 1;                               // 0x001C(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ECastRayTracedShadow                          CastRaytracedShadow;                               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAffectReflection : 1;                             // 0x0024(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectGlobalIllumination : 1;                     // 0x0024(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeepShadowLayerDistribution;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IndirectLightingIntensity;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplesPerPixel;                                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRealTimeCapture;                                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkyLightSourceType                           SourceType;                                        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureCube*                           Cubemap;                                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureSceneForReflection;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SourceCubemapAngle;                                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CubemapResolution;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSHIrradianceMap                       IrradianceEnvMapSH;                                // 0x0054(0x0094)(NoDestructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CapturedDataForReflection;                         // 0x00E8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         SkyDistanceThreshold;                              // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureEmissiveOnly;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLowerHemisphereIsBlack;                           // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           LowerHemisphereColor;                              // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionMaxDistance;                              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Contrast;                                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionExponent;                                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinOcclusion;                                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 OcclusionTint;                                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bCloudAmbientOcclusion : 1;                        // 0x0124(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CloudAmbientOcclusionStrength;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudAmbientOcclusionExtent;                       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudAmbientOcclusionMapResolutionScale;           // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudAmbientOcclusionApertureScale;                // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOcclusionCombineMode                         OcclusionCombineMode;                              // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCLSSkyLightData) == 0x000008, "Wrong alignment on FCLSSkyLightData");
static_assert(sizeof(FCLSSkyLightData) == 0x000140, "Wrong size on FCLSSkyLightData");
static_assert(offsetof(FCLSSkyLightData, Name) == 0x000000, "Member 'FCLSSkyLightData::Name' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, bValid) == 0x000010, "Member 'FCLSSkyLightData::bValid' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, Intensity) == 0x000014, "Member 'FCLSSkyLightData::Intensity' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, LightColor) == 0x000018, "Member 'FCLSSkyLightData::LightColor' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CastRaytracedShadow) == 0x000020, "Member 'FCLSSkyLightData::CastRaytracedShadow' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, DeepShadowLayerDistribution) == 0x000028, "Member 'FCLSSkyLightData::DeepShadowLayerDistribution' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, IndirectLightingIntensity) == 0x00002C, "Member 'FCLSSkyLightData::IndirectLightingIntensity' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, VolumetricScatteringIntensity) == 0x000030, "Member 'FCLSSkyLightData::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, SamplesPerPixel) == 0x000034, "Member 'FCLSSkyLightData::SamplesPerPixel' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, bRealTimeCapture) == 0x000038, "Member 'FCLSSkyLightData::bRealTimeCapture' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, SourceType) == 0x000039, "Member 'FCLSSkyLightData::SourceType' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, Cubemap) == 0x000040, "Member 'FCLSSkyLightData::Cubemap' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, bCaptureSceneForReflection) == 0x000048, "Member 'FCLSSkyLightData::bCaptureSceneForReflection' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, SourceCubemapAngle) == 0x00004C, "Member 'FCLSSkyLightData::SourceCubemapAngle' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CubemapResolution) == 0x000050, "Member 'FCLSSkyLightData::CubemapResolution' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, IrradianceEnvMapSH) == 0x000054, "Member 'FCLSSkyLightData::IrradianceEnvMapSH' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CapturedDataForReflection) == 0x0000E8, "Member 'FCLSSkyLightData::CapturedDataForReflection' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, SkyDistanceThreshold) == 0x0000F8, "Member 'FCLSSkyLightData::SkyDistanceThreshold' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, bCaptureEmissiveOnly) == 0x0000FC, "Member 'FCLSSkyLightData::bCaptureEmissiveOnly' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, bLowerHemisphereIsBlack) == 0x0000FD, "Member 'FCLSSkyLightData::bLowerHemisphereIsBlack' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, LowerHemisphereColor) == 0x000100, "Member 'FCLSSkyLightData::LowerHemisphereColor' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, OcclusionMaxDistance) == 0x000110, "Member 'FCLSSkyLightData::OcclusionMaxDistance' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, Contrast) == 0x000114, "Member 'FCLSSkyLightData::Contrast' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, OcclusionExponent) == 0x000118, "Member 'FCLSSkyLightData::OcclusionExponent' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, MinOcclusion) == 0x00011C, "Member 'FCLSSkyLightData::MinOcclusion' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, OcclusionTint) == 0x000120, "Member 'FCLSSkyLightData::OcclusionTint' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CloudAmbientOcclusionStrength) == 0x000128, "Member 'FCLSSkyLightData::CloudAmbientOcclusionStrength' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CloudAmbientOcclusionExtent) == 0x00012C, "Member 'FCLSSkyLightData::CloudAmbientOcclusionExtent' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CloudAmbientOcclusionMapResolutionScale) == 0x000130, "Member 'FCLSSkyLightData::CloudAmbientOcclusionMapResolutionScale' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, CloudAmbientOcclusionApertureScale) == 0x000134, "Member 'FCLSSkyLightData::CloudAmbientOcclusionApertureScale' has a wrong offset!");
static_assert(offsetof(FCLSSkyLightData, OcclusionCombineMode) == 0x000138, "Member 'FCLSSkyLightData::OcclusionCombineMode' has a wrong offset!");

// ScriptStruct CustomLightSystem.CLSAtmosphericFogData
// 0x00B0 (0x00B0 - 0x0000)
struct FCLSAtmosphericFogData final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValid;                                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESkyAtmosphereTransformMode                   TransformMode;                                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BottomRadius;                                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 GroundAlbedo;                                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AtmosphereHeight;                                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MultiScatteringFactor;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceSampleCountScale;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RayleighScatteringScale;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RayleighScattering;                                // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RayleighExponentialDistribution;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieScatteringScale;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MieScattering;                                     // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieAbsorptionScale;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           MieAbsorption;                                     // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieAnisotropy;                                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MieExponentialDistribution;                        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OtherAbsorptionScale;                              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OtherAbsorption;                                   // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTentDistribution                      OtherTentDistribution;                             // 0x0084(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           SkyLuminanceFactor;                                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AerialPespectiveViewDistanceScale;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightFogContribution;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TransmittanceMinLightElevationAngle;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AerialPerspectiveStartDepth;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCLSAtmosphericFogData) == 0x000008, "Wrong alignment on FCLSAtmosphericFogData");
static_assert(sizeof(FCLSAtmosphericFogData) == 0x0000B0, "Wrong size on FCLSAtmosphericFogData");
static_assert(offsetof(FCLSAtmosphericFogData, Name) == 0x000000, "Member 'FCLSAtmosphericFogData::Name' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, bValid) == 0x000010, "Member 'FCLSAtmosphericFogData::bValid' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, TransformMode) == 0x000011, "Member 'FCLSAtmosphericFogData::TransformMode' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, BottomRadius) == 0x000014, "Member 'FCLSAtmosphericFogData::BottomRadius' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, GroundAlbedo) == 0x000018, "Member 'FCLSAtmosphericFogData::GroundAlbedo' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, AtmosphereHeight) == 0x00001C, "Member 'FCLSAtmosphericFogData::AtmosphereHeight' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, MultiScatteringFactor) == 0x000020, "Member 'FCLSAtmosphericFogData::MultiScatteringFactor' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, TraceSampleCountScale) == 0x000024, "Member 'FCLSAtmosphericFogData::TraceSampleCountScale' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, RayleighScatteringScale) == 0x000028, "Member 'FCLSAtmosphericFogData::RayleighScatteringScale' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, RayleighScattering) == 0x00002C, "Member 'FCLSAtmosphericFogData::RayleighScattering' has a wrong offset!");
static_assert(offsetof(FCLSAtmosphericFogData, RayleighExponentialDistribution) == 0x00003C, "Member 'FCLSAtmosphericFogData::RayleighExponentialDistribution' has a wrong offset!");
