#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DataType_Support

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct DataType_Support.DataType_Support
// 0x01B0 (0x01B0 - 0x0000)
struct FDataType_Support final
{
public:
	class FString                                 GeometryCache_10_60EECC624C693307F620398174DF4F78; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StaticMeshes_11_CACE76324DB5B67A06E6BEA8FF4E9134;  // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StaticMeshesEnableWPO_12_589C74A44AC1367B026C8FBFA0045D44; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StaticMeshesEnableWPOCulling_13_177AB1CE478B5AC40D24B791225322F5; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StaticMeshesWPOCullingRadius_14_7BC25E7A4F0CD3C0F47B229B1D9DE927; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkeletalMeshes_15_FFC240AB4BED120417AAC69C70124464; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ProceduralMeshes_21_36D63E534869DBA1D0DA50A3A01827F9; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraMeshes_16_10268FE94CA08A6B9573EAA7DADE014B; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraRibbons_17_B678BB4940773D107B14C2B4BE0095AF; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraSprites_18_05F8C4284E3C7649FE73ECB35F94FF34; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDirectionalLight_32_5B36A08C409AF3F6263AACA6D880682A; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIPointLight_33_41CEC9CA46598970DF2B9EAF7240AF95;  // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIRectLight_34_570E86F346FC898FB785DD9FA7B2CF69;   // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISkyLight_35_24DDF0D54211597D5928CC8279BA2613;    // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISpotLight_36_CA892FD74CE62E79DAC8EEA2A6942E59;   // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsDirectional_37_158E74B94A0A037FDCB9DFA5ECF785C7; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsPoint_38_EE2768114270CF56FBC5729DD8063DAA;  // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsRect_39_ED1CE4DC401687164B18EC89981A8854;   // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowsSpot_40_8D4FCC9F4561A67CCCE062B526D23A3C;   // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableRayTracingCulling_45_51CAE4294A3A6F89F3317988496B5AA1; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RayTracingCullingAngle_46_372A6A3140C6BFC4B19E7AAEBA56C702; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RayTracingCullingRadius_47_E8E0FA1F4B28E157718787819ACC7807; // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GeometryCollection_50_533FAFAA4789DB5A4682C88245C96756; // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraRibbonsReorientation_55_E85B138144FA9078054F87BED77E9DE3; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraSpritesReorientation_56_C32368894CF127C861A7F69410C5D5CA; // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReorientedNiagaraCullingDistance_57_DE807CBA46B92D276D87578C0C00E65F; // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReorientedNiagaraCullingAngle_60_435C37984F971823471C75B0BC63F619; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FDataType_Support) == 0x000008, "Wrong alignment on FDataType_Support");
static_assert(sizeof(FDataType_Support) == 0x0001B0, "Wrong size on FDataType_Support");
static_assert(offsetof(FDataType_Support, GeometryCache_10_60EECC624C693307F620398174DF4F78) == 0x000000, "Member 'FDataType_Support::GeometryCache_10_60EECC624C693307F620398174DF4F78' has a wrong offset!");
static_assert(offsetof(FDataType_Support, StaticMeshes_11_CACE76324DB5B67A06E6BEA8FF4E9134) == 0x000010, "Member 'FDataType_Support::StaticMeshes_11_CACE76324DB5B67A06E6BEA8FF4E9134' has a wrong offset!");
static_assert(offsetof(FDataType_Support, StaticMeshesEnableWPO_12_589C74A44AC1367B026C8FBFA0045D44) == 0x000020, "Member 'FDataType_Support::StaticMeshesEnableWPO_12_589C74A44AC1367B026C8FBFA0045D44' has a wrong offset!");
static_assert(offsetof(FDataType_Support, StaticMeshesEnableWPOCulling_13_177AB1CE478B5AC40D24B791225322F5) == 0x000030, "Member 'FDataType_Support::StaticMeshesEnableWPOCulling_13_177AB1CE478B5AC40D24B791225322F5' has a wrong offset!");
static_assert(offsetof(FDataType_Support, StaticMeshesWPOCullingRadius_14_7BC25E7A4F0CD3C0F47B229B1D9DE927) == 0x000040, "Member 'FDataType_Support::StaticMeshesWPOCullingRadius_14_7BC25E7A4F0CD3C0F47B229B1D9DE927' has a wrong offset!");
static_assert(offsetof(FDataType_Support, SkeletalMeshes_15_FFC240AB4BED120417AAC69C70124464) == 0x000050, "Member 'FDataType_Support::SkeletalMeshes_15_FFC240AB4BED120417AAC69C70124464' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ProceduralMeshes_21_36D63E534869DBA1D0DA50A3A01827F9) == 0x000060, "Member 'FDataType_Support::ProceduralMeshes_21_36D63E534869DBA1D0DA50A3A01827F9' has a wrong offset!");
static_assert(offsetof(FDataType_Support, NiagaraMeshes_16_10268FE94CA08A6B9573EAA7DADE014B) == 0x000070, "Member 'FDataType_Support::NiagaraMeshes_16_10268FE94CA08A6B9573EAA7DADE014B' has a wrong offset!");
static_assert(offsetof(FDataType_Support, NiagaraRibbons_17_B678BB4940773D107B14C2B4BE0095AF) == 0x000080, "Member 'FDataType_Support::NiagaraRibbons_17_B678BB4940773D107B14C2B4BE0095AF' has a wrong offset!");
static_assert(offsetof(FDataType_Support, NiagaraSprites_18_05F8C4284E3C7649FE73ECB35F94FF34) == 0x000090, "Member 'FDataType_Support::NiagaraSprites_18_05F8C4284E3C7649FE73ECB35F94FF34' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GIDirectionalLight_32_5B36A08C409AF3F6263AACA6D880682A) == 0x0000A0, "Member 'FDataType_Support::GIDirectionalLight_32_5B36A08C409AF3F6263AACA6D880682A' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GIPointLight_33_41CEC9CA46598970DF2B9EAF7240AF95) == 0x0000B0, "Member 'FDataType_Support::GIPointLight_33_41CEC9CA46598970DF2B9EAF7240AF95' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GIRectLight_34_570E86F346FC898FB785DD9FA7B2CF69) == 0x0000C0, "Member 'FDataType_Support::GIRectLight_34_570E86F346FC898FB785DD9FA7B2CF69' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GISkyLight_35_24DDF0D54211597D5928CC8279BA2613) == 0x0000D0, "Member 'FDataType_Support::GISkyLight_35_24DDF0D54211597D5928CC8279BA2613' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GISpotLight_36_CA892FD74CE62E79DAC8EEA2A6942E59) == 0x0000E0, "Member 'FDataType_Support::GISpotLight_36_CA892FD74CE62E79DAC8EEA2A6942E59' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ShadowsDirectional_37_158E74B94A0A037FDCB9DFA5ECF785C7) == 0x0000F0, "Member 'FDataType_Support::ShadowsDirectional_37_158E74B94A0A037FDCB9DFA5ECF785C7' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ShadowsPoint_38_EE2768114270CF56FBC5729DD8063DAA) == 0x000100, "Member 'FDataType_Support::ShadowsPoint_38_EE2768114270CF56FBC5729DD8063DAA' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ShadowsRect_39_ED1CE4DC401687164B18EC89981A8854) == 0x000110, "Member 'FDataType_Support::ShadowsRect_39_ED1CE4DC401687164B18EC89981A8854' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ShadowsSpot_40_8D4FCC9F4561A67CCCE062B526D23A3C) == 0x000120, "Member 'FDataType_Support::ShadowsSpot_40_8D4FCC9F4561A67CCCE062B526D23A3C' has a wrong offset!");
static_assert(offsetof(FDataType_Support, EnableRayTracingCulling_45_51CAE4294A3A6F89F3317988496B5AA1) == 0x000130, "Member 'FDataType_Support::EnableRayTracingCulling_45_51CAE4294A3A6F89F3317988496B5AA1' has a wrong offset!");
static_assert(offsetof(FDataType_Support, RayTracingCullingAngle_46_372A6A3140C6BFC4B19E7AAEBA56C702) == 0x000140, "Member 'FDataType_Support::RayTracingCullingAngle_46_372A6A3140C6BFC4B19E7AAEBA56C702' has a wrong offset!");
static_assert(offsetof(FDataType_Support, RayTracingCullingRadius_47_E8E0FA1F4B28E157718787819ACC7807) == 0x000150, "Member 'FDataType_Support::RayTracingCullingRadius_47_E8E0FA1F4B28E157718787819ACC7807' has a wrong offset!");
static_assert(offsetof(FDataType_Support, GeometryCollection_50_533FAFAA4789DB5A4682C88245C96756) == 0x000160, "Member 'FDataType_Support::GeometryCollection_50_533FAFAA4789DB5A4682C88245C96756' has a wrong offset!");
static_assert(offsetof(FDataType_Support, NiagaraRibbonsReorientation_55_E85B138144FA9078054F87BED77E9DE3) == 0x000170, "Member 'FDataType_Support::NiagaraRibbonsReorientation_55_E85B138144FA9078054F87BED77E9DE3' has a wrong offset!");
static_assert(offsetof(FDataType_Support, NiagaraSpritesReorientation_56_C32368894CF127C861A7F69410C5D5CA) == 0x000180, "Member 'FDataType_Support::NiagaraSpritesReorientation_56_C32368894CF127C861A7F69410C5D5CA' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ReorientedNiagaraCullingDistance_57_DE807CBA46B92D276D87578C0C00E65F) == 0x000190, "Member 'FDataType_Support::ReorientedNiagaraCullingDistance_57_DE807CBA46B92D276D87578C0C00E65F' has a wrong offset!");
static_assert(offsetof(FDataType_Support, ReorientedNiagaraCullingAngle_60_435C37984F971823471C75B0BC63F619) == 0x0001A0, "Member 'FDataType_Support::ReorientedNiagaraCullingAngle_60_435C37984F971823471C75B0BC63F619' has a wrong offset!");

}

