#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Debug_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Debug_Parameters.Debug_Parameters
// 0x01B8 (0x01B8 - 0x0000)
struct FDebug_Parameters final
{
public:
	class FString                                 NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF;    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableMaterials_86_49932A5A461504BB59F75CB217B2162E; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572;     // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D;  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 ParallelMeshBatchSize_66_DD9B821743F54A691D43C8A24A9BE556; // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 BuildRayTracingMeshForCaustics_68_BDEEC918403656B6270A94A80C0DE5DB; // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD; // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NonBlockingPipelineCreation_79_48AF81E64271EABF0A7934900DCD8A49; // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DynamicGeometryLastRenderTimeUpdateDistance_82_85FDD70C4ECBD20FDB4138A3032A7F47; // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        RTXTickInterval_71_9F40A6F64535D2EC280D3A931AB6EBC1; // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerMaxVelocityThreshold_73_ED82F8D84E62D435C28326AD3146CBC0; // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAdaptiveRTXRender_76_D6F55266402401FBB0ED1293B4FEA290; // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        UseRasterCaustics_89_538AA5884238B1737615599CDB58D3E3; // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 VolumetricScatteringIntensityScale_92_A6C5C006449DEB6D498E979D106DE13F; // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UseSkeletalMeshLODBias_95_0791AE8B47FA4B1E69C461BD05775B1B; // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AsyncBuild_98_C5509A2A41941095244BB4AF21BA307E;    // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MaxBuiltPrimitivesPerFrame_101_5C3E2B904E972515BCAFE1B2452227C0; // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraUseRayTracingShadow_104_BBA72FFC4AE13955CE1D1D901C9628E3; // 0x0138(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NiagaraShadowSupportLocalLight_106_C8173766479122BE412F13A77FDB4787; // 0x0148(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ParticleIndirectLightingScale_112_5D781F6949A23E70EC5ED29EA799FB3B; // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RayTMinOffset_115_141A9E1E4AF662C272DD98B51FF50B68; // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VolumetricFogGridPixelSize_118_284C27EC4A2299E78E6122BA955BC0D9; // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 VolumetricFogGridSizeZ_120_EDBC7293434C85D7DAE550A91C8B1256; // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          RTArtistParameterOverride_122_A1B6A5EF46D9B7CFC801D199C1E885B5; // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TonemapperSharpen_125_6F7FF43E4B9767E311F20DBFBF88A4E2; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          DLSSRRSSSParameterOverride_127_E71D2B684331350521848A863B97DE14; // 0x01B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FDebug_Parameters) == 0x000008, "Wrong alignment on FDebug_Parameters");
static_assert(sizeof(FDebug_Parameters) == 0x0001B8, "Wrong size on FDebug_Parameters");
static_assert(offsetof(FDebug_Parameters, NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF) == 0x000000, "Member 'FDebug_Parameters::NormalBias_15_8A32C7694BB9E814F5B79080A92D92FF' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2) == 0x000010, "Member 'FDebug_Parameters::DebugForceOpaque_16_C804BF5D4DD6036507DFF789796FA3D2' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6) == 0x000020, "Member 'FDebug_Parameters::DebugDisableTriangleCull_18_F6A8E355470D11CB81EAB8B19AC1C7A6' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977) == 0x000030, "Member 'FDebug_Parameters::EnableReflectionDenoiser_20_12D307E54569217835508CB0D10A7977' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354) == 0x000040, "Member 'FDebug_Parameters::EnableShadowDenoiser_21_66089741487B775E6A06E499B3D14354' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC) == 0x000050, "Member 'FDebug_Parameters::EnableGIDenoiser_22_048015BE4ECE190E94DAC98FC43DBFBC' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, EnableMaterials_86_49932A5A461504BB59F75CB217B2162E) == 0x000060, "Member 'FDebug_Parameters::EnableMaterials_86_49932A5A461504BB59F75CB217B2162E' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572) == 0x000070, "Member 'FDebug_Parameters::RTXSwitch_26_CF19681044E915DF3EE1B7A42E9CE572' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D) == 0x000080, "Member 'FDebug_Parameters::UseShaderWPO_32_EF11C3E64B117CFB7C16B0BAA7F5A01D' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, ParallelMeshBatchSize_66_DD9B821743F54A691D43C8A24A9BE556) == 0x000088, "Member 'FDebug_Parameters::ParallelMeshBatchSize_66_DD9B821743F54A691D43C8A24A9BE556' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, BuildRayTracingMeshForCaustics_68_BDEEC918403656B6270A94A80C0DE5DB) == 0x000098, "Member 'FDebug_Parameters::BuildRayTracingMeshForCaustics_68_BDEEC918403656B6270A94A80C0DE5DB' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD) == 0x0000A8, "Member 'FDebug_Parameters::ParallelMeshBatchSetup_56_86CA6095450FFE588738FC85344DC2FD' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, NonBlockingPipelineCreation_79_48AF81E64271EABF0A7934900DCD8A49) == 0x0000B8, "Member 'FDebug_Parameters::NonBlockingPipelineCreation_79_48AF81E64271EABF0A7934900DCD8A49' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, DynamicGeometryLastRenderTimeUpdateDistance_82_85FDD70C4ECBD20FDB4138A3032A7F47) == 0x0000C8, "Member 'FDebug_Parameters::DynamicGeometryLastRenderTimeUpdateDistance_82_85FDD70C4ECBD20FDB4138A3032A7F47' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, RTXTickInterval_71_9F40A6F64535D2EC280D3A931AB6EBC1) == 0x0000D8, "Member 'FDebug_Parameters::RTXTickInterval_71_9F40A6F64535D2EC280D3A931AB6EBC1' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, PlayerMaxVelocityThreshold_73_ED82F8D84E62D435C28326AD3146CBC0) == 0x0000E0, "Member 'FDebug_Parameters::PlayerMaxVelocityThreshold_73_ED82F8D84E62D435C28326AD3146CBC0' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, EnableAdaptiveRTXRender_76_D6F55266402401FBB0ED1293B4FEA290) == 0x0000E8, "Member 'FDebug_Parameters::EnableAdaptiveRTXRender_76_D6F55266402401FBB0ED1293B4FEA290' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, UseRasterCaustics_89_538AA5884238B1737615599CDB58D3E3) == 0x0000F0, "Member 'FDebug_Parameters::UseRasterCaustics_89_538AA5884238B1737615599CDB58D3E3' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, VolumetricScatteringIntensityScale_92_A6C5C006449DEB6D498E979D106DE13F) == 0x0000F8, "Member 'FDebug_Parameters::VolumetricScatteringIntensityScale_92_A6C5C006449DEB6D498E979D106DE13F' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, UseSkeletalMeshLODBias_95_0791AE8B47FA4B1E69C461BD05775B1B) == 0x000108, "Member 'FDebug_Parameters::UseSkeletalMeshLODBias_95_0791AE8B47FA4B1E69C461BD05775B1B' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, AsyncBuild_98_C5509A2A41941095244BB4AF21BA307E) == 0x000118, "Member 'FDebug_Parameters::AsyncBuild_98_C5509A2A41941095244BB4AF21BA307E' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, MaxBuiltPrimitivesPerFrame_101_5C3E2B904E972515BCAFE1B2452227C0) == 0x000128, "Member 'FDebug_Parameters::MaxBuiltPrimitivesPerFrame_101_5C3E2B904E972515BCAFE1B2452227C0' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, NiagaraUseRayTracingShadow_104_BBA72FFC4AE13955CE1D1D901C9628E3) == 0x000138, "Member 'FDebug_Parameters::NiagaraUseRayTracingShadow_104_BBA72FFC4AE13955CE1D1D901C9628E3' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, NiagaraShadowSupportLocalLight_106_C8173766479122BE412F13A77FDB4787) == 0x000148, "Member 'FDebug_Parameters::NiagaraShadowSupportLocalLight_106_C8173766479122BE412F13A77FDB4787' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, ParticleIndirectLightingScale_112_5D781F6949A23E70EC5ED29EA799FB3B) == 0x000158, "Member 'FDebug_Parameters::ParticleIndirectLightingScale_112_5D781F6949A23E70EC5ED29EA799FB3B' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, RayTMinOffset_115_141A9E1E4AF662C272DD98B51FF50B68) == 0x000168, "Member 'FDebug_Parameters::RayTMinOffset_115_141A9E1E4AF662C272DD98B51FF50B68' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, VolumetricFogGridPixelSize_118_284C27EC4A2299E78E6122BA955BC0D9) == 0x000178, "Member 'FDebug_Parameters::VolumetricFogGridPixelSize_118_284C27EC4A2299E78E6122BA955BC0D9' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, VolumetricFogGridSizeZ_120_EDBC7293434C85D7DAE550A91C8B1256) == 0x000188, "Member 'FDebug_Parameters::VolumetricFogGridSizeZ_120_EDBC7293434C85D7DAE550A91C8B1256' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, RTArtistParameterOverride_122_A1B6A5EF46D9B7CFC801D199C1E885B5) == 0x000198, "Member 'FDebug_Parameters::RTArtistParameterOverride_122_A1B6A5EF46D9B7CFC801D199C1E885B5' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, TonemapperSharpen_125_6F7FF43E4B9767E311F20DBFBF88A4E2) == 0x0001A0, "Member 'FDebug_Parameters::TonemapperSharpen_125_6F7FF43E4B9767E311F20DBFBF88A4E2' has a wrong offset!");
static_assert(offsetof(FDebug_Parameters, DLSSRRSSSParameterOverride_127_E71D2B684331350521848A863B97DE14) == 0x0001B0, "Member 'FDebug_Parameters::DLSSRRSSSParameterOverride_127_E71D2B684331350521848A863B97DE14' has a wrong offset!");

}

