#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Disable

#include "Basic.hpp"

#include "AO_Parameters_structs.hpp"
#include "Reflection_Parameters_structs.hpp"
#include "Debug_Parameters_structs.hpp"
#include "GI_Parameters_structs.hpp"
#include "SkyLight_Parameters_structs.hpp"
#include "LandscapeAndFoliage_Parameter_structs.hpp"
#include "Translucency_Parameters_structs.hpp"
#include "Shadow_Parameters_structs.hpp"
#include "Water_Caustics_Parameters_structs.hpp"
#include "Mesh_Caustics_Parameters_structs.hpp"
#include "DLSS_Parameters_structs.hpp"
#include "RTX_PostProcess_Settings_structs.hpp"
#include "DataType_Support_structs.hpp"
#include "RTXDI_NRD_Parameters_structs.hpp"
#include "Lumen_structs.hpp"


namespace SDK
{

// UserDefinedStruct Disable.Disable
// 0x1ED0 (0x1ED0 - 0x0000)
struct FDisable final
{
public:
	struct FAO_Parameters                         AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7; // 0x0000(0x0050)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDebug_Parameters                      Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698; // 0x0050(0x01B8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGI_Parameters                         GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C; // 0x0208(0x0458)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLandscapeAndFoliage_Parameter         LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94; // 0x0660(0x0140)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FReflection_Parameters                 Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1; // 0x07A0(0x0260)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FShadow_Parameters                     Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684; // 0x0A00(0x0270)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSkyLight_Parameters                   SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC; // 0x0C70(0x00A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FTranslucency_Parameters               Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625; // 0x0D10(0x01A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FWater_Caustics_Parameters             WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39; // 0x0EB0(0x01F8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FMesh_Caustics_Parameters              MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A; // 0x10A8(0x0160)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDLSS_Parameters                       DLSSParameters_310_D94EF156432B307677D00680EBDF73B8; // 0x1208(0x00C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	uint8                                         Pad_12C8[0x8];                                     // 0x12C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRTX_PostProcess_Settings              RTXPostProcessSettings_316_96E0621447558B5C83E4DE968475A475; // 0x12D0(0x07C0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FDataType_Support                      DataTypeSupport_319_ED1531394D2DB4B27AA1D6ACE79150FD; // 0x1A90(0x01B0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRTXDI_NRD_Parameters                  RTXDINRDParameters_322_DD5495E64AD77E8B265497AC9B6C5184; // 0x1C40(0x0108)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FLumen                                 LumenParameters_325_2453614340343B0789EDACBCC95A8A42; // 0x1D48(0x0180)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FDisable) == 0x000010, "Wrong alignment on FDisable");
static_assert(sizeof(FDisable) == 0x001ED0, "Wrong size on FDisable");
static_assert(offsetof(FDisable, AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7) == 0x000000, "Member 'FDisable::AO_Parameters_290_3E5B873044B400F2CBFF3483EB9004F7' has a wrong offset!");
static_assert(offsetof(FDisable, Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698) == 0x000050, "Member 'FDisable::Debug_Parameters_292_8E67B1AD44F1BFE4AA4994BD260F4698' has a wrong offset!");
static_assert(offsetof(FDisable, GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C) == 0x000208, "Member 'FDisable::GI_Parameters_294_5991E68E41477E3C67FBD9B532E65D7C' has a wrong offset!");
static_assert(offsetof(FDisable, LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94) == 0x000660, "Member 'FDisable::LandscapeAndFoliage_Parameter_296_549A67554ED7BBC8A7326BAF09E10B94' has a wrong offset!");
static_assert(offsetof(FDisable, Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1) == 0x0007A0, "Member 'FDisable::Reflection_Parameters_298_A167D2B1452F751451C99E818E7C05E1' has a wrong offset!");
static_assert(offsetof(FDisable, Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684) == 0x000A00, "Member 'FDisable::Shadow_Parameters_301_DD835C514AFAE876A87A799983D13684' has a wrong offset!");
static_assert(offsetof(FDisable, SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC) == 0x000C70, "Member 'FDisable::SkyLight_Parameters_303_98539BB9469068C9E259929CDEF4B9FC' has a wrong offset!");
static_assert(offsetof(FDisable, Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625) == 0x000D10, "Member 'FDisable::Translucency_Parameters_307_94092BBE40B82EF55D80B3858FEEA625' has a wrong offset!");
static_assert(offsetof(FDisable, WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39) == 0x000EB0, "Member 'FDisable::WaterCausticsParameters_285_DD002BE7481CEB47274E64932E70EC39' has a wrong offset!");
static_assert(offsetof(FDisable, MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A) == 0x0010A8, "Member 'FDisable::MeshCausticsParameters_288_16B34040457BC7049BEFDE94A384AB2A' has a wrong offset!");
static_assert(offsetof(FDisable, DLSSParameters_310_D94EF156432B307677D00680EBDF73B8) == 0x001208, "Member 'FDisable::DLSSParameters_310_D94EF156432B307677D00680EBDF73B8' has a wrong offset!");
static_assert(offsetof(FDisable, RTXPostProcessSettings_316_96E0621447558B5C83E4DE968475A475) == 0x0012D0, "Member 'FDisable::RTXPostProcessSettings_316_96E0621447558B5C83E4DE968475A475' has a wrong offset!");
static_assert(offsetof(FDisable, DataTypeSupport_319_ED1531394D2DB4B27AA1D6ACE79150FD) == 0x001A90, "Member 'FDisable::DataTypeSupport_319_ED1531394D2DB4B27AA1D6ACE79150FD' has a wrong offset!");
static_assert(offsetof(FDisable, RTXDINRDParameters_322_DD5495E64AD77E8B265497AC9B6C5184) == 0x001C40, "Member 'FDisable::RTXDINRDParameters_322_DD5495E64AD77E8B265497AC9B6C5184' has a wrong offset!");
static_assert(offsetof(FDisable, LumenParameters_325_2453614340343B0789EDACBCC95A8A42) == 0x001D48, "Member 'FDisable::LumenParameters_325_2453614340343B0789EDACBCC95A8A42' has a wrong offset!");

}

