#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DownloadTookit

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "DownloadTookit_structs.hpp"


namespace SDK
{

// Class DownloadTookit.DownloadProxy
// 0x0188 (0x01B0 - 0x0028)
class UDownloadProxy final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnDownloadCompleteDyMultiDlg;                      // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDownloadPausedDyMultiDlg;                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDownloadCanceledDyMultiDlg;                      // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnDownloadResumedDyMultiDlg;                       // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x148];                                     // 0x0068(0x0148)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Cancel();
	void Pause();
	bool ReDownload();
	void RequestDownload(const class FString& InURL, const class FString& InSavePathOpt, bool bInSliceOpt, int32 InSliceByteSizeOpt, bool bInForceOpt);
	void Reset();
	bool Resume();
	bool Tick(float Delta);

	struct FDownloadFile GetDownloadedFileInfo() const;
	int32 GetDownloadedSize() const;
	float GetDownloadProgress() const;
	int32 GetDownloadSpeed() const;
	float GetDownloadSpeedKbs() const;
	EDownloadStatus GetDownloadStatus() const;
	int32 GetTotalSize() const;
	bool HashCheck(const class FString& InMD5Hash) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DownloadProxy">();
	}
	static class UDownloadProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDownloadProxy>();
	}
};
static_assert(alignof(UDownloadProxy) == 0x000008, "Wrong alignment on UDownloadProxy");
static_assert(sizeof(UDownloadProxy) == 0x0001B0, "Wrong size on UDownloadProxy");
static_assert(offsetof(UDownloadProxy, OnDownloadCompleteDyMultiDlg) == 0x000028, "Member 'UDownloadProxy::OnDownloadCompleteDyMultiDlg' has a wrong offset!");
static_assert(offsetof(UDownloadProxy, OnDownloadPausedDyMultiDlg) == 0x000038, "Member 'UDownloadProxy::OnDownloadPausedDyMultiDlg' has a wrong offset!");
static_assert(offsetof(UDownloadProxy, OnDownloadCanceledDyMultiDlg) == 0x000048, "Member 'UDownloadProxy::OnDownloadCanceledDyMultiDlg' has a wrong offset!");
static_assert(offsetof(UDownloadProxy, OnDownloadResumedDyMultiDlg) == 0x000058, "Member 'UDownloadProxy::OnDownloadResumedDyMultiDlg' has a wrong offset!");

}

