#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Engine

#include "Basic.hpp"

#include "AudioExtensions_structs.hpp"
#include "AudioExtensions_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "NetCore_structs.hpp"
#include "NetCore_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "PhysicsCore_classes.hpp"
#include "Chaos_structs.hpp"
#include "InputCore_structs.hpp"
#include "AudioPlatformConfiguration_structs.hpp"
#include "PacketHandler_classes.hpp"
#include "MeshDescription_classes.hpp"


namespace SDK
{

// Class Engine.SoundNode
// 0x0020 (0x0048 - 0x0028)
class USoundNode : public UObject
{
public:
	TArray<class USoundNode*>                     ChildNodes;                                        // 0x0028(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundNode">();
	}
	static class USoundNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundNode>();
	}
};
static_assert(alignof(USoundNode) == 0x000008, "Wrong alignment on USoundNode");
static_assert(sizeof(USoundNode) == 0x000048, "Wrong size on USoundNode");
static_assert(offsetof(USoundNode, ChildNodes) == 0x000028, "Member 'USoundNode::ChildNodes' has a wrong offset!");

// Class Engine.SoundNodeAttenuation
// 0x03D8 (0x0420 - 0x0048)
class USoundNodeAttenuation final : public USoundNode
{
public:
	class USoundAttenuation*                      AttenuationSettings;                               // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoundAttenuationSettings              AttenuationOverrides;                              // 0x0050(0x03C8)(Edit, NativeAccessSpecifierPublic)
	uint8                                         bOverrideAttenuation : 1;                          // 0x0418(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SoundNodeAttenuation">();
	}
	static class USoundNodeAttenuation* GetDefaultObj()
	{
		return GetDefaultObjImpl<USoundNodeAttenuation>();
	}
};
static_assert(alignof(USoundNodeAttenuation) == 0x000008, "Wrong alignment on USoundNodeAttenuation");
static_assert(sizeof(USoundNodeAttenuation) == 0x000420, "Wrong size on USoundNodeAttenuation");
static_assert(offsetof(USoundNodeAttenuation, AttenuationSettings) == 0x000048, "Member 'USoundNodeAttenuation::AttenuationSettings' has a wrong offset!");
static_assert(offsetof(USoundNodeAttenuation, AttenuationOverrides) == 0x000050, "Member 'USoundNodeAttenuation::AttenuationOverrides' has a wrong offset!");

// Class Engine.BlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintFunctionLibrary : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintFunctionLibrary">();
	}
	static class UBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UBlueprintFunctionLibrary");
static_assert(sizeof(UBlueprintFunctionLibrary) == 0x000028, "Wrong size on UBlueprintFunctionLibrary");

// Class Engine.BlueprintPathsLibrary
// 0x0000 (0x0028 - 0x0028)
class UBlueprintPathsLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class FString AutomationDir();
	static class FString AutomationLogDir();
	static class FString AutomationTransientDir();
	static class FString BugItDir();
	static class FString ChangeExtension(const class FString& InPath, const class FString& InNewExtension);
	static class FString CloudDir();
	static bool CollapseRelativeDirectories(const class FString& InPath, class FString* OutPath);
	static class FString Combine(const TArray<class FString>& InPaths);
	static class FString ConvertFromSandboxPath(const class FString& InPath, const class FString& InSandboxName);
	static class FString ConvertRelativePathToFull(const class FString& InPath, const class FString& InBasePath);
	static class FString ConvertToSandboxPath(const class FString& InPath, const class FString& InSandboxName);
	static class FString CreateTempFilename(const class FString& Path, const class FString& Prefix, const class FString& Extension);
	static class FString DiffDir();
	static bool DirectoryExists(const class FString& InPath);
	static class FString EngineConfigDir();
	static class FString EngineContentDir();
	static class FString EngineDir();
	static class FString EngineIntermediateDir();
	static class FString EnginePluginsDir();
	static class FString EngineSavedDir();
	static class FString EngineSourceDir();
	static class FString EngineUserDir();
	static class FString EngineVersionAgnosticUserDir();
	static class FString EnterpriseDir();
	static class FString EnterpriseFeaturePackDir();
	static class FString EnterprisePluginsDir();
	static class FString FeaturePackDir();
	static bool FileExists(const class FString& InPath);
	static class FString GameAgnosticSavedDir();
	static class FString GameDevelopersDir();
	static class FString GameSourceDir();
	static class FString GameUserDeveloperDir();
	static class FString GeneratedConfigDir();
	static class FString GetBaseFilename(const class FString& InPath, bool bRemovePath);
	static class FString GetCleanFilename(const class FString& InPath);
	static const TArray<class FString> GetEditorLocalizationPaths();
	static const TArray<class FString> GetEngineLocalizationPaths();
	static class FString GetExtension(const class FString& InPath, bool bIncludeDot);
	static const TArray<class FString> GetGameLocalizationPaths();
	static class FString GetInvalidFileSystemChars();
	static class FString GetPath(const class FString& InPath);
	static class FString GetProjectFilePath();
	static const TArray<class FString> GetPropertyNameLocalizationPaths();
	static class FString GetRelativePathToRoot();
	static const TArray<class FString> GetRestrictedFolderNames();
	static const TArray<class FString> GetToolTipLocalizationPaths();
	static bool HasProjectPersistentDownloadDir();
	static bool IsDrive(const class FString& InPath);
	static bool IsProjectFilePathSet();
	static bool IsRelative(const class FString& InPath);
	static bool IsRestrictedPath(const class FString& InPath);
	static bool IsSamePath(const class FString& PathA, const class FString& PathB);
	static class FString LaunchDir();
	static bool MakePathRelativeTo(const class FString& InPath, const class FString& InRelativeTo, class FString* OutPath);
	static void MakePlatformFilename(const class FString& InPath, class FString* OutPath);
	static void MakeStandardFilename(const class FString& InPath, class FString* OutPath);
	static class FString MakeValidFileName(const class FString& InString, const class FString& InReplacementChar);
	static void NormalizeDirectoryName(const class FString& InPath, class FString* OutPath);
	static void NormalizeFilename(const class FString& InPath, class FString* OutPath);
	static class FString ProfilingDir();
	static class FString ProjectConfigDir();
	static class FString ProjectContentDir();
	static class FString ProjectDir();
	static class FString ProjectIntermediateDir();
	static class FString ProjectLogDir();
	static class FString ProjectModsDir();
	static class FString ProjectPersistentDownloadDir();
	static class FString ProjectPluginsDir();
	static class FString ProjectSavedDir();
	static class FString ProjectUserDir();
	static void RemoveDuplicateSlashes(const class FString& InPath, class FString* OutPath);
	static class FString RootDir();
	static class FString SandboxesDir();
	static class FString ScreenShotDir();
	static class FString SetExtension(const class FString& InPath, const class FString& InNewExtension);
	static void SetProjectFilePath(const class FString& NewGameProjectFilePath);
	static class FString ShaderWorkingDir();
	static bool ShouldSaveToUserDir();
	static class FString SourceConfigDir();
	static void Split(const class FString& InPath, class FString* PathPart, class FString* FilenamePart, class FString* ExtensionPart);
	static void ValidatePath(const class FString& InPath, bool* bDidSucceed, class FText* OutReason);
	static class FString VideoCaptureDir();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BlueprintPathsLibrary">();
	}
	static class UBlueprintPathsLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBlueprintPathsLibrary>();
	}
};
static_assert(alignof(UBlueprintPathsLibrary) == 0x000008, "Wrong alignment on UBlueprintPathsLibrary");
static_assert(sizeof(UBlueprintPathsLibrary) == 0x000028, "Wrong size on UBlueprintPathsLibrary");

// Class Engine.ActorComponent
// 0x0088 (0x00B0 - 0x0028)
class UActorComponent : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActorComponentTickFunction            PrimaryComponentTick;                              // 0x0030(0x0030)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                           ComponentTags;                                     // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_80[0x4];                                       // 0x0080(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UCSSerializationIndex;                             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         BitPad_88_0 : 3;                                   // 0x0088(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bNetAddressable : 1;                               // 0x0088(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bReplicates : 1;                                   // 0x0088(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_88_5 : 3;                                   // 0x0088(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_89[0x1];                                       // 0x0089(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoActivate : 1;                                 // 0x008A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsActive : 1;                                     // 0x008A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEditableWhenInherited : 1;                        // 0x008A(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_8A_3 : 1;                                   // 0x008A(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bCanEverAffectNavigation : 1;                      // 0x008A(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Config, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_8A_5 : 1;                                   // 0x008A(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bIsEditorOnly : 1;                                 // 0x008A(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EComponentCreationMethod                      CreationMethod;                                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnComponentActivated;                              // 0x008D(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnComponentDeactivated;                            // 0x008E(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSimpleMemberReference>         UCSModifiedProperties;                             // 0x0090(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Activate(bool bReset);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void Deactivate();
	void K2_DestroyComponent(class UObject* Object);
	void OnRep_IsActive();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void SetActive(bool bNewActive, bool bReset);
	void SetAutoActivate(bool bNewAutoActivate);
	void SetComponentTickEnabled(bool bEnabled);
	void SetComponentTickInterval(float TickInterval);
	void SetComponentTickIntervalAndCooldown(float TickInterval);
	void SetIsReplicated(bool ShouldReplicate);
	void SetTickableWhenPaused(bool bTickableWhenPaused);
	void SetTickGroup(ETickingGroup NewTickGroup);
	void ToggleActive();

	bool ComponentHasTag(class FName Tag) const;
	float GetComponentTickInterval() const;
	class AActor* GetOwner() const;
	bool IsActive() const;
	bool IsBeingDestroyed() const;
	bool IsComponentTickEnabled() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorComponent">();
	}
	static class UActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorComponent>();
	}
};
static_assert(alignof(UActorComponent) == 0x000008, "Wrong alignment on UActorComponent");
static_assert(sizeof(UActorComponent) == 0x0000B0, "Wrong size on UActorComponent");
static_assert(offsetof(UActorComponent, PrimaryComponentTick) == 0x000030, "Member 'UActorComponent::PrimaryComponentTick' has a wrong offset!");
static_assert(offsetof(UActorComponent, ComponentTags) == 0x000060, "Member 'UActorComponent::ComponentTags' has a wrong offset!");
static_assert(offsetof(UActorComponent, AssetUserData) == 0x000070, "Member 'UActorComponent::AssetUserData' has a wrong offset!");
static_assert(offsetof(UActorComponent, UCSSerializationIndex) == 0x000084, "Member 'UActorComponent::UCSSerializationIndex' has a wrong offset!");
static_assert(offsetof(UActorComponent, CreationMethod) == 0x00008C, "Member 'UActorComponent::CreationMethod' has a wrong offset!");
static_assert(offsetof(UActorComponent, OnComponentActivated) == 0x00008D, "Member 'UActorComponent::OnComponentActivated' has a wrong offset!");
static_assert(offsetof(UActorComponent, OnComponentDeactivated) == 0x00008E, "Member 'UActorComponent::OnComponentDeactivated' has a wrong offset!");
static_assert(offsetof(UActorComponent, UCSModifiedProperties) == 0x000090, "Member 'UActorComponent::UCSModifiedProperties' has a wrong offset!");

// Class Engine.AnimBoneCompressionCodec
// 0x0010 (0x0038 - 0x0028)
class UAnimBoneCompressionCodec : public UObject
{
public:
	class FString                                 Description;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimBoneCompressionCodec">();
	}
	static class UAnimBoneCompressionCodec* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBoneCompressionCodec>();
	}
};
static_assert(alignof(UAnimBoneCompressionCodec) == 0x000008, "Wrong alignment on UAnimBoneCompressionCodec");
static_assert(sizeof(UAnimBoneCompressionCodec) == 0x000038, "Wrong size on UAnimBoneCompressionCodec");
static_assert(offsetof(UAnimBoneCompressionCodec, Description) == 0x000028, "Member 'UAnimBoneCompressionCodec::Description' has a wrong offset!");

// Class Engine.InterpTrackInst
// 0x0000 (0x0028 - 0x0028)
class UInterpTrackInst : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpTrackInst">();
	}
	static class UInterpTrackInst* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpTrackInst>();
	}
};
static_assert(alignof(UInterpTrackInst) == 0x000008, "Wrong alignment on UInterpTrackInst");
static_assert(sizeof(UInterpTrackInst) == 0x000028, "Wrong size on UInterpTrackInst");

// Class Engine.InterpTrackInstSound
// 0x0010 (0x0038 - 0x0028)
class UInterpTrackInstSound final : public UInterpTrackInst
{
public:
	float                                         LastUpdatePosition;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        PlayAudioComp;                                     // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InterpTrackInstSound">();
	}
	static class UInterpTrackInstSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInterpTrackInstSound>();
	}
};
static_assert(alignof(UInterpTrackInstSound) == 0x000008, "Wrong alignment on UInterpTrackInstSound");
static_assert(sizeof(UInterpTrackInstSound) == 0x000038, "Wrong size on UInterpTrackInstSound");
static_assert(offsetof(UInterpTrackInstSound, LastUpdatePosition) == 0x000028, "Member 'UInterpTrackInstSound::LastUpdatePosition' has a wrong offset!");
static_assert(offsetof(UInterpTrackInstSound, PlayAudioComp) == 0x000030, "Member 'UInterpTrackInstSound::PlayAudioComp' has a wrong offset!");

// Class Engine.Distribution
// 0x0008 (0x0030 - 0x0028)
class UDistribution : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Distribution">();
	}
	static class UDistribution* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistribution>();
	}
};
static_assert(alignof(UDistribution) == 0x000008, "Wrong alignment on UDistribution");
static_assert(sizeof(UDistribution) == 0x000030, "Wrong size on UDistribution");

// Class Engine.DistributionVector
// 0x0008 (0x0038 - 0x0030)
class UDistributionVector : public UDistribution
{
public:
	uint8                                         bCanBeBaked : 1;                                   // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsDirty : 1;                                      // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bBakedDataSuccesfully : 1;                         // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistributionVector">();
	}
	static class UDistributionVector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistributionVector>();
	}
};
static_assert(alignof(UDistributionVector) == 0x000008, "Wrong alignment on UDistributionVector");
static_assert(sizeof(UDistributionVector) == 0x000038, "Wrong size on UDistributionVector");

// Class Engine.DistributionVectorConstant
// 0x0020 (0x0058 - 0x0038)
class UDistributionVectorConstant : public UDistributionVector
{
public:
	struct FVector                                Constant;                                          // 0x0038(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bLockAxes : 1;                                     // 0x0050(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EDistributionVectorLockFlags                  LockedAxes;                                        // 0x0054(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistributionVectorConstant">();
	}
	static class UDistributionVectorConstant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistributionVectorConstant>();
	}
};
static_assert(alignof(UDistributionVectorConstant) == 0x000008, "Wrong alignment on UDistributionVectorConstant");
static_assert(sizeof(UDistributionVectorConstant) == 0x000058, "Wrong size on UDistributionVectorConstant");
static_assert(offsetof(UDistributionVectorConstant, Constant) == 0x000038, "Member 'UDistributionVectorConstant::Constant' has a wrong offset!");
static_assert(offsetof(UDistributionVectorConstant, LockedAxes) == 0x000054, "Member 'UDistributionVectorConstant::LockedAxes' has a wrong offset!");

// Class Engine.DistributionVectorParameterBase
// 0x0070 (0x00C8 - 0x0058)
class UDistributionVectorParameterBase : public UDistributionVectorConstant
{
public:
	class FName                                   ParameterName;                                     // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinInput;                                          // 0x0060(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxInput;                                          // 0x0078(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MinOutput;                                         // 0x0090(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                MaxOutput;                                         // 0x00A8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDistributionParamMode                        ParamModes[0x3];                                   // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistributionVectorParameterBase">();
	}
	static class UDistributionVectorParameterBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistributionVectorParameterBase>();
	}
};
static_assert(alignof(UDistributionVectorParameterBase) == 0x000008, "Wrong alignment on UDistributionVectorParameterBase");
static_assert(sizeof(UDistributionVectorParameterBase) == 0x0000C8, "Wrong size on UDistributionVectorParameterBase");
static_assert(offsetof(UDistributionVectorParameterBase, ParameterName) == 0x000058, "Member 'UDistributionVectorParameterBase::ParameterName' has a wrong offset!");
static_assert(offsetof(UDistributionVectorParameterBase, MinInput) == 0x000060, "Member 'UDistributionVectorParameterBase::MinInput' has a wrong offset!");
static_assert(offsetof(UDistributionVectorParameterBase, MaxInput) == 0x000078, "Member 'UDistributionVectorParameterBase::MaxInput' has a wrong offset!");
static_assert(offsetof(UDistributionVectorParameterBase, MinOutput) == 0x000090, "Member 'UDistributionVectorParameterBase::MinOutput' has a wrong offset!");
static_assert(offsetof(UDistributionVectorParameterBase, MaxOutput) == 0x0000A8, "Member 'UDistributionVectorParameterBase::MaxOutput' has a wrong offset!");
static_assert(offsetof(UDistributionVectorParameterBase, ParamModes) == 0x0000C0, "Member 'UDistributionVectorParameterBase::ParamModes' has a wrong offset!");

// Class Engine.DistributionVectorParticleParameter
// 0x0000 (0x00C8 - 0x00C8)
class UDistributionVectorParticleParameter final : public UDistributionVectorParameterBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DistributionVectorParticleParameter">();
	}
	static class UDistributionVectorParticleParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDistributionVectorParticleParameter>();
	}
};
static_assert(alignof(UDistributionVectorParticleParameter) == 0x000008, "Wrong alignment on UDistributionVectorParticleParameter");
static_assert(sizeof(UDistributionVectorParticleParameter) == 0x0000C8, "Wrong size on UDistributionVectorParticleParameter");

// Class Engine.SMInstanceElementIdMapTransactor
// 0x0000 (0x0028 - 0x0028)
class USMInstanceElementIdMapTransactor final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SMInstanceElementIdMapTransactor">();
	}
	static class USMInstanceElementIdMapTransactor* GetDefaultObj()
	{
		return GetDefaultObjImpl<USMInstanceElementIdMapTransactor>();
	}
};
static_assert(alignof(USMInstanceElementIdMapTransactor) == 0x000008, "Wrong alignment on USMInstanceElementIdMapTransactor");
static_assert(sizeof(USMInstanceElementIdMapTransactor) == 0x000028, "Wrong size on USMInstanceElementIdMapTransactor");

// Class Engine.AnimationAssetExtensions
// 0x0000 (0x0028 - 0x0028)
class UAnimationAssetExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimationAssetExtensions">();
	}
	static class UAnimationAssetExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimationAssetExtensions>();
	}
};
static_assert(alignof(UAnimationAssetExtensions) == 0x000008, "Wrong alignment on UAnimationAssetExtensions");
static_assert(sizeof(UAnimationAssetExtensions) == 0x000028, "Wrong size on UAnimationAssetExtensions");

// Class Engine.Commandlet
// 0x0058 (0x0080 - 0x0028)
class UCommandlet : public UObject
{
public:
	class FString                                 HelpDescription;                                   // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HelpUsage;                                         // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HelpWebLink;                                       // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         HelpParamNames;                                    // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         HelpParamDescriptions;                             // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         IsServer : 1;                                      // 0x0078(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         IsClient : 1;                                      // 0x0078(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         IsEditor : 1;                                      // 0x0078(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         LogToConsole : 1;                                  // 0x0078(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ShowErrorCount : 1;                                // 0x0078(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         ShowProgress : 1;                                  // 0x0078(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Commandlet">();
	}
	static class UCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandlet>();
	}
};
static_assert(alignof(UCommandlet) == 0x000008, "Wrong alignment on UCommandlet");
static_assert(sizeof(UCommandlet) == 0x000080, "Wrong size on UCommandlet");
static_assert(offsetof(UCommandlet, HelpDescription) == 0x000028, "Member 'UCommandlet::HelpDescription' has a wrong offset!");
static_assert(offsetof(UCommandlet, HelpUsage) == 0x000038, "Member 'UCommandlet::HelpUsage' has a wrong offset!");
static_assert(offsetof(UCommandlet, HelpWebLink) == 0x000048, "Member 'UCommandlet::HelpWebLink' has a wrong offset!");
static_assert(offsetof(UCommandlet, HelpParamNames) == 0x000058, "Member 'UCommandlet::HelpParamNames' has a wrong offset!");
static_assert(offsetof(UCommandlet, HelpParamDescriptions) == 0x000068, "Member 'UCommandlet::HelpParamDescriptions' has a wrong offset!");

// Class Engine.HLODProxy
// 0x0060 (0x0088 - 0x0028)
class UHLODProxy final : public UObject
{
public:
	TArray<struct FHLODProxyMesh>                 ProxyMeshes;                                       // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPrivate)
	TMap<class UHLODProxyDesc*, struct FHLODProxyMesh> HLODActors;                                        // 0x0038(0x0050)(Edit, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HLODProxy">();
	}
	static class UHLODProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHLODProxy>();
	}
};
static_assert(alignof(UHLODProxy) == 0x000008, "Wrong alignment on UHLODProxy");
static_assert(sizeof(UHLODProxy) == 0x000088, "Wrong size on UHLODProxy");
static_assert(offsetof(UHLODProxy, ProxyMeshes) == 0x000028, "Member 'UHLODProxy::ProxyMeshes' has a wrong offset!");
static_assert(offsetof(UHLODProxy, HLODActors) == 0x000038, "Member 'UHLODProxy::HLODActors' has a wrong offset!");

// Class Engine.ObjectElementObjectInterface
// 0x0008 (0x0030 - 0x0028)
class UObjectElementObjectInterface final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ObjectElementObjectInterface">();
	}
	static class UObjectElementObjectInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UObjectElementObjectInterface>();
	}
};
static_assert(alignof(UObjectElementObjectInterface) == 0x000008, "Wrong alignment on UObjectElementObjectInterface");
static_assert(sizeof(UObjectElementObjectInterface) == 0x000030, "Wrong size on UObjectElementObjectInterface");

// Class Engine.MaterialExpression
// 0x0018 (0x0040 - 0x0028)
class UMaterialExpression : public UObject
{
public:
	class UMaterial*                              Material;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialFunction*                      Function;                                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsParameterExpression : 1;                        // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpression">();
	}
	static class UMaterialExpression* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpression>();
	}
};
static_assert(alignof(UMaterialExpression) == 0x000008, "Wrong alignment on UMaterialExpression");
static_assert(sizeof(UMaterialExpression) == 0x000040, "Wrong size on UMaterialExpression");
static_assert(offsetof(UMaterialExpression, Material) == 0x000028, "Member 'UMaterialExpression::Material' has a wrong offset!");
static_assert(offsetof(UMaterialExpression, Function) == 0x000030, "Member 'UMaterialExpression::Function' has a wrong offset!");

// Class Engine.MaterialExpressionTextureBase
// 0x0008 (0x0048 - 0x0040)
class UMaterialExpressionTextureBase : public UMaterialExpression
{
public:
	class UTexture*                               Texture;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MaterialExpressionTextureBase">();
	}
	static class UMaterialExpressionTextureBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMaterialExpressionTextureBase>();
	}
};
static_assert(alignof(UMaterialExpressionTextureBase) == 0x000008, "Wrong alignment on UMaterialExpressionTextureBase");
static_assert(sizeof(UMaterialExpressionTextureBase) == 0x000048, "Wrong size on UMaterialExpressionTextureBase");
static_assert(offsetof(UMaterialExpressionTextureBase, Texture) == 0x000040, "Member 'UMaterialExpressionTextureBase::Texture' has a wrong offset!");

// Class Engine.Subsystem
// 0x0008 (0x0030 - 0x0028)
class USubsystem : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Subsystem">();
	}
	static class USubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubsystem>();
	}
};
static_assert(alignof(USubsystem) == 0x000008, "Wrong alignment on USubsystem");
static_assert(sizeof(USubsystem) == 0x000030, "Wrong size on USubsystem");

// Class Engine.DynamicSubsystem
// 0x0000 (0x0030 - 0x0030)
class UDynamicSubsystem : public USubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicSubsystem">();
	}
	static class UDynamicSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicSubsystem>();
	}
};
static_assert(alignof(UDynamicSubsystem) == 0x000008, "Wrong alignment on UDynamicSubsystem");
static_assert(sizeof(UDynamicSubsystem) == 0x000030, "Wrong size on UDynamicSubsystem");

// Class Engine.EngineSubsystem
// 0x0000 (0x0030 - 0x0030)
class UEngineSubsystem : public UDynamicSubsystem
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EngineSubsystem">();
	}
	static class UEngineSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEngineSubsystem>();
	}
};
static_assert(alignof(UEngineSubsystem) == 0x000008, "Wrong alignment on UEngineSubsystem");
static_assert(sizeof(UEngineSubsystem) == 0x000030, "Wrong size on UEngineSubsystem");

// Class Engine.ActorDescContainer
// 0x0008 (0x0030 - 0x0028)
class UActorDescContainer : public UObject
{
public:
	class UWorld*                                 World;                                             // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActorDescContainer">();
	}
	static class UActorDescContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorDescContainer>();
	}
};
static_assert(alignof(UActorDescContainer) == 0x000008, "Wrong alignment on UActorDescContainer");
static_assert(sizeof(UActorDescContainer) == 0x000030, "Wrong size on UActorDescContainer");
static_assert(offsetof(UActorDescContainer, World) == 0x000028, "Member 'UActorDescContainer::World' has a wrong offset!");

// Class Engine.Actor
// 0x0250 (0x0278 - 0x0028)
class AActor : public UObject
{
public:
	struct FActorTickFunction                     PrimaryActorTick;                                  // 0x0028(0x0030)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                         bNetTemporary : 1;                                 // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetStartup : 1;                                   // 0x0058(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOnlyRelevantToOwner : 1;                          // 0x0058(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAlwaysRelevant : 1;                               // 0x0058(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReplicateMovement : 1;                            // 0x0058(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bCallPreReplication : 1;                           // 0x0058(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bCallPreReplicationForReplay : 1;                  // 0x0058(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bHidden : 1;                                       // 0x0058(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bTearOff : 1;                                      // 0x0059(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bForceNetAddressable : 1;                          // 0x0059(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bExchangedRoles : 1;                               // 0x0059(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetLoadOnClient : 1;                              // 0x0059(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bNetUseOwnerRelevancy : 1;                         // 0x0059(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRelevantForNetworkReplays : 1;                    // 0x0059(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRelevantForLevelBounds : 1;                       // 0x0059(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReplayRewindable : 1;                             // 0x0059(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAllowTickBeforeBeginPlay : 1;                     // 0x005A(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoDestroyWhenFinished : 1;                      // 0x005A(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bCanBeDamaged : 1;                                 // 0x005A(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bBlockInput : 1;                                   // 0x005A(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCollideWhenPlacing : 1;                           // 0x005A(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFindCameraComponentWhenViewTarget : 1;            // 0x005A(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bGenerateOverlapEventsDuringLevelStreaming : 1;    // 0x005A(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIgnoresOriginShifting : 1;                        // 0x005A(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnableAutoLODGeneration : 1;                      // 0x005B(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEditorOnlyActor : 1;                            // 0x005B(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bActorSeamlessTraveled : 1;                        // 0x005B(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bReplicates : 1;                                   // 0x005B(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bCanBeInCluster : 1;                               // 0x005B(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bAllowReceiveTickEventOnDedicatedServer : 1;       // 0x005B(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         BitPad_5B_6 : 2;                                   // 0x005B(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         BitPad_5C_0 : 5;                                   // 0x005C(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bActorEnableCollision : 1;                         // 0x005C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bActorIsBeingDestroyed : 1;                        // 0x005C(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_5D[0x1];                                       // 0x005D(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	EActorUpdateOverlapsMethod                    UpdateOverlapsMethodDuringLevelStreaming;          // 0x005E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EActorUpdateOverlapsMethod                    DefaultUpdateOverlapsMethodDuringLevelStreaming;   // 0x005F(0x0001)(Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENetRole                                      RemoteRole;                                        // 0x0060(0x0001)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepMovement                           ReplicatedMovement;                                // 0x0068(0x0068)(Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate)
	float                                         InitialLifeSpan;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CustomTimeDilation;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRepAttachment                         AttachmentReplication;                             // 0x00E0(0x0060)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class AActor*                                 Owner;                                             // 0x0140(0x0008)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   NetDriverName;                                     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENetRole                                      Role;                                              // 0x0150(0x0001)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ENetDormancy                                  NetDormancy;                                       // 0x0151(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpawnActorCollisionHandlingMethod            SpawnCollisionHandlingMethod;                      // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAutoReceiveInput                             AutoReceiveInput;                                  // 0x0153(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputPriority;                                     // 0x0154(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputComponent*                        InputComponent;                                    // 0x0158(0x0008)(ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetCullDistanceSquared;                            // 0x0160(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetTag;                                            // 0x0164(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetUpdateFrequency;                                // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinNetUpdateFrequency;                             // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NetPriority;                                       // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  Instigator;                                        // 0x0178(0x0008)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         Children;                                          // 0x0180(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class USceneComponent*                        RootComponent;                                     // 0x0190(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_198[0x8];                                      // 0x0198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RayTracingGroupId;                                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Layers;                                            // 0x01A8(0x0010)(Edit, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UChildActorComponent>    ParentComponent;                                   // 0x01B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x8];                                      // 0x01C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Tags;                                              // 0x01C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnTakeAnyDamage;                                   // 0x01D8(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnTakePointDamage;                                 // 0x01D9(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnTakeRadialDamage;                                // 0x01DA(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnActorBeginOverlap;                               // 0x01DB(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnActorEndOverlap;                                 // 0x01DC(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnBeginCursorOver;                                 // 0x01DD(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnEndCursorOver;                                   // 0x01DE(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnClicked;                                         // 0x01DF(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnReleased;                                        // 0x01E0(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnInputTouchBegin;                                 // 0x01E1(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnInputTouchEnd;                                   // 0x01E2(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnInputTouchEnter;                                 // 0x01E3(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnInputTouchLeave;                                 // 0x01E4(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnActorHit;                                        // 0x01E5(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnDestroyed;                                       // 0x01E6(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_             OnEndPlay;                                         // 0x01E7(0x0001)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x60];                                     // 0x01E8(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UActorComponent*>                InstanceComponents;                                // 0x0248(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UActorComponent*>                BlueprintCreatedComponents;                        // 0x0258(0x0010)(ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x10];                                     // 0x0268(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UActorComponent* AddComponent(class FName TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, const class UObject* ComponentTemplateContext, bool bDeferredFinish);
	class UActorComponent* AddComponentByClass(TSubclassOf<class UActorComponent> Class_0, bool bManualAttachment, const struct FTransform& RelativeTransform, bool bDeferredFinish);
	void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
	void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
	void DetachRootComponentFromParent(bool bMaintainWorldPosition);
	void DisableInput(class APlayerController* PlayerController);
	void EnableInput(class APlayerController* PlayerController);
