#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldSystemEngine

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct FieldSystemEngine.FieldObjectCommands
// 0x0030 (0x0030 - 0x0000)
struct FFieldObjectCommands final
{
public:
	TArray<class FName>                           TargetNames;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UFieldNodeBase*>                 RootNodes;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<class UFieldSystemMetaData*>           MetaDatas;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFieldObjectCommands) == 0x000008, "Wrong alignment on FFieldObjectCommands");
static_assert(sizeof(FFieldObjectCommands) == 0x000030, "Wrong size on FFieldObjectCommands");
static_assert(offsetof(FFieldObjectCommands, TargetNames) == 0x000000, "Member 'FFieldObjectCommands::TargetNames' has a wrong offset!");
static_assert(offsetof(FFieldObjectCommands, RootNodes) == 0x000010, "Member 'FFieldObjectCommands::RootNodes' has a wrong offset!");
static_assert(offsetof(FFieldObjectCommands, MetaDatas) == 0x000020, "Member 'FFieldObjectCommands::MetaDatas' has a wrong offset!");

}

