#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GeometryScriptingCore

#include "Basic.hpp"

#include "GeometryScriptingCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.ResetDynamicMeshCollision
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision final
{
public:
	class UDynamicMeshComponent*                  Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmitTransaction;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision) == 0x000008, "Wrong alignment on GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision");
static_assert(sizeof(GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision) == 0x000018, "Wrong size on GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision, Component) == 0x000000, "Member 'GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision::Component' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision, bEmitTransaction) == 0x000008, "Member 'GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision::bEmitTransaction' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision, Debug) == 0x000010, "Member 'GeometryScriptLibrary_CollisionFunctions_ResetDynamicMeshCollision::Debug' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetDynamicMeshCollisionFromMesh
// 0x0040 (0x0040 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMeshComponent*                  ToDynamicMeshComponent;                            // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCollisionFromMeshOptions Options;                                           // 0x0010(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh) == 0x000008, "Wrong alignment on GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh");
static_assert(sizeof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh) == 0x000040, "Wrong size on GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh, FromDynamicMesh) == 0x000000, "Member 'GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh::FromDynamicMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh, ToDynamicMeshComponent) == 0x000008, "Member 'GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh::ToDynamicMeshComponent' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh, Options) == 0x000010, "Member 'GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh::Options' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh, Debug) == 0x000030, "Member 'GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh, ReturnValue) == 0x000038, "Member 'GeometryScriptLibrary_CollisionFunctions_SetDynamicMeshCollisionFromMesh::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetStaticMeshCollisionFromComponent
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent final
{
public:
	class UStaticMesh*                            StaticMeshAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SourceComponent;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptSetSimpleCollisionOptions Options;                                           // 0x0010(0x0001)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent) == 0x000008, "Wrong alignment on GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent");
static_assert(sizeof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent) == 0x000020, "Wrong size on GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent, StaticMeshAsset) == 0x000000, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent::StaticMeshAsset' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent, SourceComponent) == 0x000008, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent::SourceComponent' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent, Options) == 0x000010, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent::Options' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent, Debug) == 0x000018, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromComponent::Debug' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_CollisionFunctions.SetStaticMeshCollisionFromMesh
// 0x0040 (0x0040 - 0x0000)
struct GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh final
{
public:
	class UDynamicMesh*                           FromDynamicMesh;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ToStaticMeshAsset;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptCollisionFromMeshOptions Options;                                           // 0x0010(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh) == 0x000008, "Wrong alignment on GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh");
static_assert(sizeof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh) == 0x000040, "Wrong size on GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh, FromDynamicMesh) == 0x000000, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh::FromDynamicMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh, ToStaticMeshAsset) == 0x000008, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh::ToStaticMeshAsset' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh, Options) == 0x000010, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh::Options' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh, Debug) == 0x000030, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh, ReturnValue) == 0x000038, "Member 'GeometryScriptLibrary_CollisionFunctions_SetStaticMeshCollisionFromMesh::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions.ComputeMeshConvexHull
// 0x0038 (0x0038 - 0x0000)
struct GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMesh;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMeshOut;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptConvexHullOptions       Options;                                           // 0x0018(0x000C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGeometryScriptDebug*                   Debug;                                             // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull");
static_assert(sizeof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull) == 0x000038, "Wrong size on GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, TargetMesh) == 0x000000, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, CopyToMesh) == 0x000008, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::CopyToMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, CopyToMeshOut) == 0x000010, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::CopyToMeshOut' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, Options) == 0x000018, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::Options' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, Debug) == 0x000028, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull, ReturnValue) == 0x000030, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshConvexHull::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ContainmentFunctions.ComputeMeshSweptHull
// 0x00B0 (0x00B0 - 0x0000)
struct GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull final
{
public:
	class UDynamicMesh*                           TargetMesh;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMesh;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           CopyToMeshOut;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ProjectionFrame;                                   // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptSweptHullOptions        Options;                                           // 0x0080(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class UGeometryScriptDebug*                   Debug;                                             // 0x0098(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicMesh*                           ReturnValue;                                       // 0x00A0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull) == 0x000010, "Wrong alignment on GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull");
static_assert(sizeof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull) == 0x0000B0, "Wrong size on GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, TargetMesh) == 0x000000, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::TargetMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, CopyToMesh) == 0x000008, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::CopyToMesh' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, CopyToMeshOut) == 0x000010, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::CopyToMeshOut' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, ProjectionFrame) == 0x000020, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::ProjectionFrame' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, Options) == 0x000080, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::Options' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, Debug) == 0x000098, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::Debug' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull, ReturnValue) == 0x0000A0, "Member 'GeometryScriptLibrary_ContainmentFunctions_ComputeMeshSweptHull::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToColorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList final
{
public:
	TArray<struct FLinearColor>                   ColorArray;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptColorList               ColorList;                                         // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList, ColorArray) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList::ColorArray' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList, ColorList) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToColorList::ColorList' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToIndexList
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList final
{
public:
	TArray<int32>                                 IndexArray;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0010(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	EGeometryScriptIndexType                      IndexType;                                         // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList) == 0x000030, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList, IndexArray) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList::IndexArray' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList, IndexList) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList::IndexList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList, IndexType) == 0x000028, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToIndexList::IndexType' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToTriangleList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList final
{
public:
	TArray<struct FIntVector>                     TriangleArray;                                     // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList, TriangleArray) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList::TriangleArray' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList, TriangleList) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToTriangleList::TriangleList' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToUVList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList final
{
public:
	TArray<struct FVector2D>                      UVArray;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptUVList                  UVList;                                            // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList, UVArray) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList::UVArray' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList, UVList) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToUVList::UVList' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertArrayToVectorList
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList final
{
public:
	TArray<struct FVector>                        VectorArray;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0010(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList, VectorArray) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList::VectorArray' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList, VectorList) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertArrayToVectorList::VectorList' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertColorListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   ColorArray;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray, ColorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray::ColorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray, ColorArray) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertColorListToArray::ColorArray' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertIndexListToArray
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	TArray<int32>                                 IndexArray;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray) == 0x000028, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray, IndexList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray::IndexList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray, IndexArray) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertIndexListToArray::IndexArray' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertTriangleListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FIntVector>                     TriangleArray;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray, TriangleList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray::TriangleList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray, TriangleArray) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertTriangleListToArray::TriangleArray' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertUVListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UVArray;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray, UVList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray::UVList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray, UVArray) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertUVListToArray::UVArray' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.ConvertVectorListToArray
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        VectorArray;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray, VectorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray::VectorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray, VectorArray) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_ConvertVectorListToArray::VectorArray' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem) == 0x000028, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem, ColorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem::ColorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem, Index_0) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem::Index_0' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem, bIsValidIndex) == 0x000014, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem::bIsValidIndex' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListItem::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListLastIndex
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex, ColorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex::ColorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListLastIndex::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetColorListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength final
{
public:
	struct FGeometryScriptColorList               ColorList;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength, ColorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength::ColorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetColorListLength::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem) == 0x000028, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem, IndexList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem::IndexList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem, Index_0) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem::Index_0' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem, bIsValidIndex) == 0x00001C, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem::bIsValidIndex' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem, ReturnValue) == 0x000020, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListItem::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListLastIndex
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex, IndexList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex::IndexList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLastIndex::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetIndexListLength
// 0x0020 (0x0020 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength final
{
public:
	struct FGeometryScriptIndexList               IndexList;                                         // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength) == 0x000020, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength, IndexList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength::IndexList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetIndexListLength::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetTriangleListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Triangle;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidTriangle;                                  // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntVector                             ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem) == 0x000028, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem, TriangleList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem::TriangleList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem, Triangle) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem::Triangle' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem, bIsValidTriangle) == 0x000014, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem::bIsValidTriangle' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListItem::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetTriangleListLastTriangle
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle, TriangleList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle::TriangleList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLastTriangle::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetTriangleListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength final
{
public:
	struct FGeometryScriptTriangleList            TriangleList;                                      // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength, TriangleList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength::TriangleList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetTriangleListLength::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetUVListItem
// 0x0028 (0x0028 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem) == 0x000028, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem, UVList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem::UVList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem, Index_0) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem::Index_0' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem, bIsValidIndex) == 0x000014, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem::bIsValidIndex' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListItem::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetUVListLastIndex
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex, UVList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex::UVList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListLastIndex::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetUVListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength final
{
public:
	struct FGeometryScriptUVList                  UVList;                                            // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength, UVList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength::UVList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetUVListLength::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetVectorListItem
// 0x0030 (0x0030 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValidIndex;                                     // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem) == 0x000030, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem, VectorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem::VectorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem, Index_0) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem::Index_0' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem, bIsValidIndex) == 0x000014, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem::bIsValidIndex' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem, ReturnValue) == 0x000018, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListItem::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetVectorListLastIndex
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex final
{
public:
	struct FGeometryScriptVectorList              VectorList;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex) == 0x000008, "Wrong alignment on GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex");
static_assert(sizeof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex) == 0x000018, "Wrong size on GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex, VectorList) == 0x000000, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex::VectorList' has a wrong offset!");
static_assert(offsetof(GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex, ReturnValue) == 0x000010, "Member 'GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLastIndex::ReturnValue' has a wrong offset!");

// Function GeometryScriptingCore.GeometryScriptLibrary_ListUtilityFunctions.GetVectorListLength
// 0x0018 (0x0018 - 0x0000)
struct GeometryScriptLibrary_ListUtilityFunctions_GetVectorListLength final
{
public:
