#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GI_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct GI_Parameters.GI_Parameters
// 0x0458 (0x0458 - 0x0000)
struct FGI_Parameters final
{
public:
	class FString                                 GItype_13_FEFC00D7428DF3F2EA0F9097A9353822;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMaxBounce_14_9C271AFE40D4E53E4469F8A0B0726358;   // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMaxRayDistance_15_AD8A4E9844AE373D5012FB9DACC25082; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISPP_16_1CA01D6E4CD423E3952E13A05D8EDCF5;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIScreenPercentage_17_51DD44EE4074DBDCF36076B79D47F981; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIUseRussianRoulette_18_03B4F71A41F8B1991B5C9093866E7C8D; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDiffuseThreshold_19_4C91F5304F3E0F86F2DE64BE0555EBFC; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISortMaterials_21_FB1F0EBB431301AE76B7CEB2D0B466E8; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIEnableTwoSidedGeometry_22_F38481B04AA8C5C6C1B93087D28F17CE; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherDistance_23_06E7E9F0467A1E30FB9C0989EBD3E956; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMaxLightCount_26_5B5538634898D5C09E00E0B76188BF5D; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserType_32_B2E8F2D04E72BB68627D6EBCA107C472; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIApplyAO_33_1BA016C145BE87B51CFBDDBEB7FBEE0D;     // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserColorClamp_34_116D4CA9441D9B54F1CC09A4773FC856; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserNormalTolerance_35_B6026F734DEA82ADC79D678F82ED05EA; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiseHistoryLength_41_6444C26341627DFA45693FBF3E6C18CF; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpatialNormalTolerance_38_90A4369D46760D1D3D12B1B90AC93BB2; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpatialFilterIteration_44_43991F984232FCDF0F486A8122EC4EE5; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDiffuseBoost_47_206FAADE4EB4EB482502AFBADB7283BC; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherUseReservoirResampling_51_B645C5324122AF3297A88BA441BBF97D; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMetalicSupport_54_E529B8F747A267DC767E098206DB5CC4; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserSpatialFilterType_57_35EDA4DA4FDAE461034E11A329D5FCE1; // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserUseSH_62_6A8CFE524B495BB040710BA60BBD39E0; // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiserSHSharpness_61_E2DE071B4E3C5411289FF0AC4D8A8D41; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ATrousDepthTolerance_65_1759F98545A1EAAC4D34079C5EF23FAB; // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherIterations_70_4AF615CF472D7320C330A4911D16FB84; // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherFilterWidth_71_D2D42ACB40D4E30DE24D4B917B965521; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIFireflySuppression_72_EEAF55A1422455A4AEE4FC90DA0C1746; // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReservoirResamplingInterval_76_80AB856F43395C864203B9A3135F2DB9; // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherNormalFromDepth_80_8D4264AA4A8998ABC3EEA99265BE762C; // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherMaxReuseWeight_81_2D108C2B4C14D43EC6EC9192CD7C9689; // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherAggressiveReservoirReuse_84_1B3372034365E9F31EB6019F153A3A77; // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIDenoiseATrousFilterWidth_87_985CA20D455F90D2B3A71092519BA3E6; // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIAccumulateEmissive_90_77129ADE421CED99235DF8A2C64DE1FB; // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMultiBounceInterval_92_F65C03A246D2D4273AAA648629A2E8B9; // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpatialReservoirSamples_95_3B6B91134E739B748488E8A9ECB31DB1; // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIEnableSimpleRefractShadow_106_E00CC1074BCE12332F7182A2F91117BE; // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionDiffuseBoost_107_C943572C4919594AF5D1BEB455C5FEF2; // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FirstLayerReflectionGIMaxRoughness_108_720C9E9D4AA910B396ED818A79011587; // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UniformLightSelection_109_EF1FA31740D84E772391288E3FAF01C2; // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISER_110_3CD870CF409CAF5993AC6B9CB1C08C5F;        // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherUseTraceRayInline_111_FED649C548E62AFE57C6D49B4F11BE2F; // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIEnableTransmission_112_8019DBB74D15BA94C2BF7E958584F051; // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TransmissionHitThreshold_113_FC435AE6461C8A37E3E7849A88366397; // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIMaxShadowDistance_116_F4CCB60D4F5476A48E8698B531E7FC64; // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TemporalReservoirSamples_119_B018302E44082CE8D280D79EB7DFF19A; // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReSTIRMode_122_77D1B20A44593125C440FB8ED08E3F44;   // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 IntensityScale_125_0998B98B459B6A93FA587EA2812A819F; // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherSpatialSearchRadiusRatio_141_E59371B745FC97296B1C95A397C65019; // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightLeakFactor_131_9C630E7D4A7F8A52D09D35A1511E269D; // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UseLumenSkyLightLookup_134_C213FBF34F2C8939865DFCBA92CE8C92; // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherMaxIntensity_137_264A924A46CCAF090E416685ADA6F0D1; // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TransmissionIntensityScale_140_0C07DA714B3EFB79419E3CB91F8D96B9; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CreatePointsInHalfRes_145_68F34BFF4C14E2B5AB1B02B88FF50035; // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SharcEnable_149_8B72C4334C7002357CA561B42E660C67;  // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GIEnableSharc_150_A6B327E24261AEA5A1C1618200DD54D3; // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DLSSDRandomFactor_155_84C019744FFA534AC4B83DB1BA4B9C47; // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SharcDownscaleFactor_158_35626650488EAACD0093A9A6D762BB5B; // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SharcMode_161_E6E2AA8E44E581EA7A1708864F903DFE;    // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpatialSampleMaxShadowDistance_164_2A597C2F4987B562071E9E8D969D0926; // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowRayInSpatialReuse_167_74DA0B814F046D0F3E7E33A8B346A8BE; // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowIntensityScale_170_7F01837E4C93B9A072FDF5AE9845F371; // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 GISpecularFactor_173_0DBAA5DB4B97D5D726F0D19BEBE145D3; // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SpecularMaxRoughness_176_C738291F406E272CEB8D858FDA792EE4; // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 NRDSpecularDenoiser_179_52610DAD414DE12D8A4588850998E265; // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HalfResDLSSDRandomFactor_182_EF9740F8423851573F898BB82D175916; // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HalfResDLSSRRGIIntensityScale_185_E8C02F3B4CABB03065EE61AFB00C2B72; // 0x0420(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EnableGIIntensityOverride_188_172304DB4309EF39F03960B657119FA0; // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GILightCullingDistance_191_3BC5909C468B84BB8108D5BB4D59C7AB; // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TransmissionHairScale_194_11B4DF4C4028C3B0A898A4A71BC9F358; // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FGI_Parameters) == 0x000008, "Wrong alignment on FGI_Parameters");
static_assert(sizeof(FGI_Parameters) == 0x000458, "Wrong size on FGI_Parameters");
static_assert(offsetof(FGI_Parameters, GItype_13_FEFC00D7428DF3F2EA0F9097A9353822) == 0x000000, "Member 'FGI_Parameters::GItype_13_FEFC00D7428DF3F2EA0F9097A9353822' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMaxBounce_14_9C271AFE40D4E53E4469F8A0B0726358) == 0x000010, "Member 'FGI_Parameters::GIMaxBounce_14_9C271AFE40D4E53E4469F8A0B0726358' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMaxRayDistance_15_AD8A4E9844AE373D5012FB9DACC25082) == 0x000020, "Member 'FGI_Parameters::GIMaxRayDistance_15_AD8A4E9844AE373D5012FB9DACC25082' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GISPP_16_1CA01D6E4CD423E3952E13A05D8EDCF5) == 0x000030, "Member 'FGI_Parameters::GISPP_16_1CA01D6E4CD423E3952E13A05D8EDCF5' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIScreenPercentage_17_51DD44EE4074DBDCF36076B79D47F981) == 0x000040, "Member 'FGI_Parameters::GIScreenPercentage_17_51DD44EE4074DBDCF36076B79D47F981' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIUseRussianRoulette_18_03B4F71A41F8B1991B5C9093866E7C8D) == 0x000050, "Member 'FGI_Parameters::GIUseRussianRoulette_18_03B4F71A41F8B1991B5C9093866E7C8D' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDiffuseThreshold_19_4C91F5304F3E0F86F2DE64BE0555EBFC) == 0x000060, "Member 'FGI_Parameters::GIDiffuseThreshold_19_4C91F5304F3E0F86F2DE64BE0555EBFC' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GISortMaterials_21_FB1F0EBB431301AE76B7CEB2D0B466E8) == 0x000070, "Member 'FGI_Parameters::GISortMaterials_21_FB1F0EBB431301AE76B7CEB2D0B466E8' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIEnableTwoSidedGeometry_22_F38481B04AA8C5C6C1B93087D28F17CE) == 0x000080, "Member 'FGI_Parameters::GIEnableTwoSidedGeometry_22_F38481B04AA8C5C6C1B93087D28F17CE' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherDistance_23_06E7E9F0467A1E30FB9C0989EBD3E956) == 0x000090, "Member 'FGI_Parameters::FinalGatherDistance_23_06E7E9F0467A1E30FB9C0989EBD3E956' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMaxLightCount_26_5B5538634898D5C09E00E0B76188BF5D) == 0x0000A0, "Member 'FGI_Parameters::GIMaxLightCount_26_5B5538634898D5C09E00E0B76188BF5D' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserType_32_B2E8F2D04E72BB68627D6EBCA107C472) == 0x0000B0, "Member 'FGI_Parameters::GIDenoiserType_32_B2E8F2D04E72BB68627D6EBCA107C472' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIApplyAO_33_1BA016C145BE87B51CFBDDBEB7FBEE0D) == 0x0000C0, "Member 'FGI_Parameters::GIApplyAO_33_1BA016C145BE87B51CFBDDBEB7FBEE0D' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserColorClamp_34_116D4CA9441D9B54F1CC09A4773FC856) == 0x0000D0, "Member 'FGI_Parameters::GIDenoiserColorClamp_34_116D4CA9441D9B54F1CC09A4773FC856' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserNormalTolerance_35_B6026F734DEA82ADC79D678F82ED05EA) == 0x0000E0, "Member 'FGI_Parameters::GIDenoiserNormalTolerance_35_B6026F734DEA82ADC79D678F82ED05EA' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiseHistoryLength_41_6444C26341627DFA45693FBF3E6C18CF) == 0x0000F0, "Member 'FGI_Parameters::GIDenoiseHistoryLength_41_6444C26341627DFA45693FBF3E6C18CF' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SpatialNormalTolerance_38_90A4369D46760D1D3D12B1B90AC93BB2) == 0x000100, "Member 'FGI_Parameters::SpatialNormalTolerance_38_90A4369D46760D1D3D12B1B90AC93BB2' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SpatialFilterIteration_44_43991F984232FCDF0F486A8122EC4EE5) == 0x000110, "Member 'FGI_Parameters::SpatialFilterIteration_44_43991F984232FCDF0F486A8122EC4EE5' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDiffuseBoost_47_206FAADE4EB4EB482502AFBADB7283BC) == 0x000120, "Member 'FGI_Parameters::GIDiffuseBoost_47_206FAADE4EB4EB482502AFBADB7283BC' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherUseReservoirResampling_51_B645C5324122AF3297A88BA441BBF97D) == 0x000130, "Member 'FGI_Parameters::FinalGatherUseReservoirResampling_51_B645C5324122AF3297A88BA441BBF97D' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMetalicSupport_54_E529B8F747A267DC767E098206DB5CC4) == 0x000140, "Member 'FGI_Parameters::GIMetalicSupport_54_E529B8F747A267DC767E098206DB5CC4' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserSpatialFilterType_57_35EDA4DA4FDAE461034E11A329D5FCE1) == 0x000150, "Member 'FGI_Parameters::GIDenoiserSpatialFilterType_57_35EDA4DA4FDAE461034E11A329D5FCE1' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserUseSH_62_6A8CFE524B495BB040710BA60BBD39E0) == 0x000160, "Member 'FGI_Parameters::GIDenoiserUseSH_62_6A8CFE524B495BB040710BA60BBD39E0' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiserSHSharpness_61_E2DE071B4E3C5411289FF0AC4D8A8D41) == 0x000170, "Member 'FGI_Parameters::GIDenoiserSHSharpness_61_E2DE071B4E3C5411289FF0AC4D8A8D41' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ATrousDepthTolerance_65_1759F98545A1EAAC4D34079C5EF23FAB) == 0x000180, "Member 'FGI_Parameters::ATrousDepthTolerance_65_1759F98545A1EAAC4D34079C5EF23FAB' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherIterations_70_4AF615CF472D7320C330A4911D16FB84) == 0x000190, "Member 'FGI_Parameters::FinalGatherIterations_70_4AF615CF472D7320C330A4911D16FB84' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherFilterWidth_71_D2D42ACB40D4E30DE24D4B917B965521) == 0x0001A0, "Member 'FGI_Parameters::FinalGatherFilterWidth_71_D2D42ACB40D4E30DE24D4B917B965521' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIFireflySuppression_72_EEAF55A1422455A4AEE4FC90DA0C1746) == 0x0001B0, "Member 'FGI_Parameters::GIFireflySuppression_72_EEAF55A1422455A4AEE4FC90DA0C1746' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ReservoirResamplingInterval_76_80AB856F43395C864203B9A3135F2DB9) == 0x0001C0, "Member 'FGI_Parameters::ReservoirResamplingInterval_76_80AB856F43395C864203B9A3135F2DB9' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherNormalFromDepth_80_8D4264AA4A8998ABC3EEA99265BE762C) == 0x0001D0, "Member 'FGI_Parameters::FinalGatherNormalFromDepth_80_8D4264AA4A8998ABC3EEA99265BE762C' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherMaxReuseWeight_81_2D108C2B4C14D43EC6EC9192CD7C9689) == 0x0001E0, "Member 'FGI_Parameters::FinalGatherMaxReuseWeight_81_2D108C2B4C14D43EC6EC9192CD7C9689' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherAggressiveReservoirReuse_84_1B3372034365E9F31EB6019F153A3A77) == 0x0001F0, "Member 'FGI_Parameters::FinalGatherAggressiveReservoirReuse_84_1B3372034365E9F31EB6019F153A3A77' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIDenoiseATrousFilterWidth_87_985CA20D455F90D2B3A71092519BA3E6) == 0x000200, "Member 'FGI_Parameters::GIDenoiseATrousFilterWidth_87_985CA20D455F90D2B3A71092519BA3E6' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIAccumulateEmissive_90_77129ADE421CED99235DF8A2C64DE1FB) == 0x000210, "Member 'FGI_Parameters::GIAccumulateEmissive_90_77129ADE421CED99235DF8A2C64DE1FB' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMultiBounceInterval_92_F65C03A246D2D4273AAA648629A2E8B9) == 0x000220, "Member 'FGI_Parameters::GIMultiBounceInterval_92_F65C03A246D2D4273AAA648629A2E8B9' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SpatialReservoirSamples_95_3B6B91134E739B748488E8A9ECB31DB1) == 0x000230, "Member 'FGI_Parameters::SpatialReservoirSamples_95_3B6B91134E739B748488E8A9ECB31DB1' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIEnableSimpleRefractShadow_106_E00CC1074BCE12332F7182A2F91117BE) == 0x000240, "Member 'FGI_Parameters::GIEnableSimpleRefractShadow_106_E00CC1074BCE12332F7182A2F91117BE' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ReflectionDiffuseBoost_107_C943572C4919594AF5D1BEB455C5FEF2) == 0x000250, "Member 'FGI_Parameters::ReflectionDiffuseBoost_107_C943572C4919594AF5D1BEB455C5FEF2' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FirstLayerReflectionGIMaxRoughness_108_720C9E9D4AA910B396ED818A79011587) == 0x000260, "Member 'FGI_Parameters::FirstLayerReflectionGIMaxRoughness_108_720C9E9D4AA910B396ED818A79011587' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, UniformLightSelection_109_EF1FA31740D84E772391288E3FAF01C2) == 0x000270, "Member 'FGI_Parameters::UniformLightSelection_109_EF1FA31740D84E772391288E3FAF01C2' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GISER_110_3CD870CF409CAF5993AC6B9CB1C08C5F) == 0x000280, "Member 'FGI_Parameters::GISER_110_3CD870CF409CAF5993AC6B9CB1C08C5F' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherUseTraceRayInline_111_FED649C548E62AFE57C6D49B4F11BE2F) == 0x000290, "Member 'FGI_Parameters::FinalGatherUseTraceRayInline_111_FED649C548E62AFE57C6D49B4F11BE2F' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIEnableTransmission_112_8019DBB74D15BA94C2BF7E958584F051) == 0x0002A0, "Member 'FGI_Parameters::GIEnableTransmission_112_8019DBB74D15BA94C2BF7E958584F051' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, TransmissionHitThreshold_113_FC435AE6461C8A37E3E7849A88366397) == 0x0002B0, "Member 'FGI_Parameters::TransmissionHitThreshold_113_FC435AE6461C8A37E3E7849A88366397' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIMaxShadowDistance_116_F4CCB60D4F5476A48E8698B531E7FC64) == 0x0002C0, "Member 'FGI_Parameters::GIMaxShadowDistance_116_F4CCB60D4F5476A48E8698B531E7FC64' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, TemporalReservoirSamples_119_B018302E44082CE8D280D79EB7DFF19A) == 0x0002D0, "Member 'FGI_Parameters::TemporalReservoirSamples_119_B018302E44082CE8D280D79EB7DFF19A' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ReSTIRMode_122_77D1B20A44593125C440FB8ED08E3F44) == 0x0002E0, "Member 'FGI_Parameters::ReSTIRMode_122_77D1B20A44593125C440FB8ED08E3F44' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, IntensityScale_125_0998B98B459B6A93FA587EA2812A819F) == 0x0002F0, "Member 'FGI_Parameters::IntensityScale_125_0998B98B459B6A93FA587EA2812A819F' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherSpatialSearchRadiusRatio_141_E59371B745FC97296B1C95A397C65019) == 0x000300, "Member 'FGI_Parameters::FinalGatherSpatialSearchRadiusRatio_141_E59371B745FC97296B1C95A397C65019' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SkyLightLeakFactor_131_9C630E7D4A7F8A52D09D35A1511E269D) == 0x000310, "Member 'FGI_Parameters::SkyLightLeakFactor_131_9C630E7D4A7F8A52D09D35A1511E269D' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, UseLumenSkyLightLookup_134_C213FBF34F2C8939865DFCBA92CE8C92) == 0x000320, "Member 'FGI_Parameters::UseLumenSkyLightLookup_134_C213FBF34F2C8939865DFCBA92CE8C92' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, FinalGatherMaxIntensity_137_264A924A46CCAF090E416685ADA6F0D1) == 0x000330, "Member 'FGI_Parameters::FinalGatherMaxIntensity_137_264A924A46CCAF090E416685ADA6F0D1' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, TransmissionIntensityScale_140_0C07DA714B3EFB79419E3CB91F8D96B9) == 0x000340, "Member 'FGI_Parameters::TransmissionIntensityScale_140_0C07DA714B3EFB79419E3CB91F8D96B9' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, CreatePointsInHalfRes_145_68F34BFF4C14E2B5AB1B02B88FF50035) == 0x000350, "Member 'FGI_Parameters::CreatePointsInHalfRes_145_68F34BFF4C14E2B5AB1B02B88FF50035' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SharcEnable_149_8B72C4334C7002357CA561B42E660C67) == 0x000360, "Member 'FGI_Parameters::SharcEnable_149_8B72C4334C7002357CA561B42E660C67' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GIEnableSharc_150_A6B327E24261AEA5A1C1618200DD54D3) == 0x000370, "Member 'FGI_Parameters::GIEnableSharc_150_A6B327E24261AEA5A1C1618200DD54D3' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, DLSSDRandomFactor_155_84C019744FFA534AC4B83DB1BA4B9C47) == 0x000380, "Member 'FGI_Parameters::DLSSDRandomFactor_155_84C019744FFA534AC4B83DB1BA4B9C47' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SharcDownscaleFactor_158_35626650488EAACD0093A9A6D762BB5B) == 0x000390, "Member 'FGI_Parameters::SharcDownscaleFactor_158_35626650488EAACD0093A9A6D762BB5B' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SharcMode_161_E6E2AA8E44E581EA7A1708864F903DFE) == 0x0003A0, "Member 'FGI_Parameters::SharcMode_161_E6E2AA8E44E581EA7A1708864F903DFE' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SpatialSampleMaxShadowDistance_164_2A597C2F4987B562071E9E8D969D0926) == 0x0003B0, "Member 'FGI_Parameters::SpatialSampleMaxShadowDistance_164_2A597C2F4987B562071E9E8D969D0926' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ShadowRayInSpatialReuse_167_74DA0B814F046D0F3E7E33A8B346A8BE) == 0x0003C0, "Member 'FGI_Parameters::ShadowRayInSpatialReuse_167_74DA0B814F046D0F3E7E33A8B346A8BE' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, ShadowIntensityScale_170_7F01837E4C93B9A072FDF5AE9845F371) == 0x0003D0, "Member 'FGI_Parameters::ShadowIntensityScale_170_7F01837E4C93B9A072FDF5AE9845F371' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GISpecularFactor_173_0DBAA5DB4B97D5D726F0D19BEBE145D3) == 0x0003E0, "Member 'FGI_Parameters::GISpecularFactor_173_0DBAA5DB4B97D5D726F0D19BEBE145D3' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, SpecularMaxRoughness_176_C738291F406E272CEB8D858FDA792EE4) == 0x0003F0, "Member 'FGI_Parameters::SpecularMaxRoughness_176_C738291F406E272CEB8D858FDA792EE4' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, NRDSpecularDenoiser_179_52610DAD414DE12D8A4588850998E265) == 0x000400, "Member 'FGI_Parameters::NRDSpecularDenoiser_179_52610DAD414DE12D8A4588850998E265' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, HalfResDLSSDRandomFactor_182_EF9740F8423851573F898BB82D175916) == 0x000410, "Member 'FGI_Parameters::HalfResDLSSDRandomFactor_182_EF9740F8423851573F898BB82D175916' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, HalfResDLSSRRGIIntensityScale_185_E8C02F3B4CABB03065EE61AFB00C2B72) == 0x000420, "Member 'FGI_Parameters::HalfResDLSSRRGIIntensityScale_185_E8C02F3B4CABB03065EE61AFB00C2B72' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, EnableGIIntensityOverride_188_172304DB4309EF39F03960B657119FA0) == 0x000430, "Member 'FGI_Parameters::EnableGIIntensityOverride_188_172304DB4309EF39F03960B657119FA0' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, GILightCullingDistance_191_3BC5909C468B84BB8108D5BB4D59C7AB) == 0x000438, "Member 'FGI_Parameters::GILightCullingDistance_191_3BC5909C468B84BB8108D5BB4D59C7AB' has a wrong offset!");
static_assert(offsetof(FGI_Parameters, TransmissionHairScale_194_11B4DF4C4028C3B0A898A4A71BC9F358) == 0x000448, "Member 'FGI_Parameters::TransmissionHairScale_194_11B4DF4C4028C3B0A898A4A71BC9F358' has a wrong offset!");

}

