#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSE_FireEmitterSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GSE_FireEmitterSystem.GSE_FireEmitterSystem_C.ExecuteUbergraph_GSE_FireEmitterSystem
// 0x0004 (0x0004 - 0x0000)
struct GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem) == 0x000004, "Wrong alignment on GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem");
static_assert(sizeof(GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem) == 0x000004, "Wrong size on GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem");
static_assert(offsetof(GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem, EntryPoint) == 0x000000, "Member 'GSE_FireEmitterSystem_C_ExecuteUbergraph_GSE_FireEmitterSystem::EntryPoint' has a wrong offset!");

// Function GSE_FireEmitterSystem.GSE_FireEmitterSystem_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct GSE_FireEmitterSystem_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_FloatToVector_InFloat_NarrowingCast; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_OrthoWidth_NarrowingCast;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireEmitterSystem_C_UserConstructionScript) == 0x000008, "Wrong alignment on GSE_FireEmitterSystem_C_UserConstructionScript");
static_assert(sizeof(GSE_FireEmitterSystem_C_UserConstructionScript) == 0x000030, "Wrong size on GSE_FireEmitterSystem_C_UserConstructionScript");
static_assert(offsetof(GSE_FireEmitterSystem_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000000, "Member 'GSE_FireEmitterSystem_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireEmitterSystem_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'GSE_FireEmitterSystem_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireEmitterSystem_C_UserConstructionScript, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000010, "Member 'GSE_FireEmitterSystem_C_UserConstructionScript::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireEmitterSystem_C_UserConstructionScript, CallFunc_Conv_FloatToVector_InFloat_NarrowingCast) == 0x000028, "Member 'GSE_FireEmitterSystem_C_UserConstructionScript::CallFunc_Conv_FloatToVector_InFloat_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GSE_FireEmitterSystem_C_UserConstructionScript, K2Node_VariableSet_OrthoWidth_NarrowingCast) == 0x00002C, "Member 'GSE_FireEmitterSystem_C_UserConstructionScript::K2Node_VariableSet_OrthoWidth_NarrowingCast' has a wrong offset!");

}

