#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSE_FireSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GSE_Fire_RTQuene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GSE_FireSystem.GSE_FireSystem_C.AddToRTQuene
// 0x0020 (0x0020 - 0x0000)
struct GSE_FireSystem_C_AddToRTQuene final
{
public:
	struct FGSE_Fire_RTQuene                      Input;                                             // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireSystem_C_AddToRTQuene) == 0x000008, "Wrong alignment on GSE_FireSystem_C_AddToRTQuene");
static_assert(sizeof(GSE_FireSystem_C_AddToRTQuene) == 0x000020, "Wrong size on GSE_FireSystem_C_AddToRTQuene");
static_assert(offsetof(GSE_FireSystem_C_AddToRTQuene, Input) == 0x000000, "Member 'GSE_FireSystem_C_AddToRTQuene::Input' has a wrong offset!");

// Function GSE_FireSystem.GSE_FireSystem_C.ExecuteUbergraph_GSE_FireSystem
// 0x0410 (0x0410 - 0x0000)
struct GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGSE_Fire_RTQuene                      K2Node_CustomEvent_Input;                          // 0x00B0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSE_Fire_RTQuene                      CallFunc_Array_Get_Item;                           // 0x00D8(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGSE_Fire_RTQuene                      K2Node_CustomEvent_Info;                           // 0x0138(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingleForObjects_OutHit;         // 0x0208(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingleForObjects_ReturnValue;    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0330(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x03C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x03E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_NarrowingCast; // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_WideningCast;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem) == 0x000008, "Wrong alignment on GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem");
static_assert(sizeof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem) == 0x000410, "Wrong size on GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, EntryPoint) == 0x000000, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, Temp_bool_Variable) == 0x000004, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, Temp_object_Variable) == 0x000010, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000030, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_GetActorScale3D_ReturnValue) == 0x000050, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakVector_X) == 0x000080, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakVector_Y) == 0x000088, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakVector_Z) == 0x000090, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000098, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, K2Node_CustomEvent_Input) == 0x0000B0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::K2Node_CustomEvent_Input' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Array_Add_ReturnValue) == 0x0000D0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000100, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000118, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, Temp_int_Loop_Counter_Variable) == 0x000128, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Less_IntInt_ReturnValue) == 0x00012C, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Add_IntInt_ReturnValue) == 0x000130, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, K2Node_CustomEvent_Info) == 0x000138, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::K2Node_CustomEvent_Info' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000158, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_VSize_ReturnValue) == 0x000178, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000180, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000188, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0001A0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0001B0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0001B8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_MakeVector2D_ReturnValue) == 0x0001C0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_MakeVector2D_ReturnValue_1) == 0x0001D0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Add_VectorVector_ReturnValue) == 0x0001E0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, K2Node_MakeArray_Array) == 0x0001F8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_LineTraceSingleForObjects_OutHit) == 0x000208, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_LineTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_LineTraceSingleForObjects_ReturnValue) == 0x0002F0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_LineTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x0002F1, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BooleanAND_ReturnValue) == 0x0002F2, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_bBlockingHit) == 0x0002F3, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002F4, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_Time) == 0x0002F8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_Distance) == 0x0002FC, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_Location) == 0x000300, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_ImpactPoint) == 0x000318, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_Normal) == 0x000330, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_ImpactNormal) == 0x000348, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_PhysMat) == 0x000360, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_HitActor) == 0x000368, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_HitComponent) == 0x000370, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_HitBoneName) == 0x000378, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_BoneName) == 0x000380, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_HitItem) == 0x000388, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_ElementIndex) == 0x00038C, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_FaceIndex) == 0x000390, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_TraceStart) == 0x000398, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_BreakHitResult_TraceEnd) == 0x0003B0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, K2Node_Select_Default) == 0x0003C8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0003E0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0003E8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0003F0, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0003F8, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_SetScalarParameterValue_ParameterValue_NarrowingCast) == 0x000400, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_SetScalarParameterValue_ParameterValue_NarrowingCast' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem, CallFunc_Add_DoubleDouble_B_WideningCast) == 0x000408, "Member 'GSE_FireSystem_C_ExecuteUbergraph_GSE_FireSystem::CallFunc_Add_DoubleDouble_B_WideningCast' has a wrong offset!");

// Function GSE_FireSystem.GSE_FireSystem_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GSE_FireSystem_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireSystem_C_ReceiveTick) == 0x000004, "Wrong alignment on GSE_FireSystem_C_ReceiveTick");
static_assert(sizeof(GSE_FireSystem_C_ReceiveTick) == 0x000004, "Wrong size on GSE_FireSystem_C_ReceiveTick");
static_assert(offsetof(GSE_FireSystem_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GSE_FireSystem_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GSE_FireSystem.GSE_FireSystem_C.SpawnEmitter
// 0x0020 (0x0020 - 0x0000)
struct GSE_FireSystem_C_SpawnEmitter final
{
public:
	struct FGSE_Fire_RTQuene                      Info;                                              // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireSystem_C_SpawnEmitter) == 0x000008, "Wrong alignment on GSE_FireSystem_C_SpawnEmitter");
static_assert(sizeof(GSE_FireSystem_C_SpawnEmitter) == 0x000020, "Wrong size on GSE_FireSystem_C_SpawnEmitter");
static_assert(offsetof(GSE_FireSystem_C_SpawnEmitter, Info) == 0x000000, "Member 'GSE_FireSystem_C_SpawnEmitter::Info' has a wrong offset!");

// Function GSE_FireSystem.GSE_FireSystem_C.SwitchRenderTargetTexture
// 0x0008 (0x0008 - 0x0000)
struct GSE_FireSystem_C_SwitchRenderTargetTexture final
{
public:
	class UTextureRenderTarget2D*                 Temp;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GSE_FireSystem_C_SwitchRenderTargetTexture) == 0x000008, "Wrong alignment on GSE_FireSystem_C_SwitchRenderTargetTexture");
static_assert(sizeof(GSE_FireSystem_C_SwitchRenderTargetTexture) == 0x000008, "Wrong size on GSE_FireSystem_C_SwitchRenderTargetTexture");
static_assert(offsetof(GSE_FireSystem_C_SwitchRenderTargetTexture, Temp) == 0x000000, "Member 'GSE_FireSystem_C_SwitchRenderTargetTexture::Temp' has a wrong offset!");

// Function GSE_FireSystem.GSE_FireSystem_C.UserConstructionScript
// 0x0120 (0x0120 - 0x0000)
struct GSE_FireSystem_C_UserConstructionScript final
{
public:
	double                                        CallFunc_BreakVector_X;                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GSE_FireSystem_C_UserConstructionScript) == 0x000008, "Wrong alignment on GSE_FireSystem_C_UserConstructionScript");
static_assert(sizeof(GSE_FireSystem_C_UserConstructionScript) == 0x000120, "Wrong size on GSE_FireSystem_C_UserConstructionScript");
static_assert(offsetof(GSE_FireSystem_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000000, "Member 'GSE_FireSystem_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000008, "Member 'GSE_FireSystem_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GSE_FireSystem_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000010, "Member 'GSE_FireSystem_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
