#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSEArteries

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GSEArteries_structs.hpp"
#include "Arteries_structs.hpp"


namespace SDK::Params
{

// Function GSEArteries.GSEArteriesSplineComponent.BindSplineToBoxExtent
// 0x0018 (0x0018 - 0x0000)
struct GSEArteriesSplineComponent_BindSplineToBoxExtent final
{
public:
	struct FVector                                InBoxExtent;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesSplineComponent_BindSplineToBoxExtent) == 0x000008, "Wrong alignment on GSEArteriesSplineComponent_BindSplineToBoxExtent");
static_assert(sizeof(GSEArteriesSplineComponent_BindSplineToBoxExtent) == 0x000018, "Wrong size on GSEArteriesSplineComponent_BindSplineToBoxExtent");
static_assert(offsetof(GSEArteriesSplineComponent_BindSplineToBoxExtent, InBoxExtent) == 0x000000, "Member 'GSEArteriesSplineComponent_BindSplineToBoxExtent::InBoxExtent' has a wrong offset!");

// Function GSEArteries.GSEArteriesSplineComponent.IsGSArteriesSplineClosed
// 0x0001 (0x0001 - 0x0000)
struct GSEArteriesSplineComponent_IsGSArteriesSplineClosed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesSplineComponent_IsGSArteriesSplineClosed) == 0x000001, "Wrong alignment on GSEArteriesSplineComponent_IsGSArteriesSplineClosed");
static_assert(sizeof(GSEArteriesSplineComponent_IsGSArteriesSplineClosed) == 0x000001, "Wrong size on GSEArteriesSplineComponent_IsGSArteriesSplineClosed");
static_assert(offsetof(GSEArteriesSplineComponent_IsGSArteriesSplineClosed, ReturnValue) == 0x000000, "Member 'GSEArteriesSplineComponent_IsGSArteriesSplineClosed::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesSplineComponent.MakeGSArteriesSplineClosedAsRect
// 0x0008 (0x0008 - 0x0000)
struct GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect final
{
public:
	float                                         CloseDistance;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect) == 0x000004, "Wrong alignment on GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect");
static_assert(sizeof(GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect) == 0x000008, "Wrong size on GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect");
static_assert(offsetof(GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect, CloseDistance) == 0x000000, "Member 'GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect::CloseDistance' has a wrong offset!");
static_assert(offsetof(GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect, ReturnValue) == 0x000004, "Member 'GSEArteriesSplineComponent_MakeGSArteriesSplineClosedAsRect::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesSplineComponent.SetGSArteriesSplineMinUnitLength
// 0x0004 (0x0004 - 0x0000)
struct GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength) == 0x000004, "Wrong alignment on GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength");
static_assert(sizeof(GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength) == 0x000004, "Wrong size on GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength");
static_assert(offsetof(GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength, Length) == 0x000000, "Member 'GSEArteriesSplineComponent_SetGSArteriesSplineMinUnitLength::Length' has a wrong offset!");

// Function GSEArteries.GSEArteriesActor.CloseSplineAndBuild
// 0x0008 (0x0008 - 0x0000)
struct GSEArteriesActor_CloseSplineAndBuild final
{
public:
	float                                         CloseDistance;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSEArteriesActor_CloseSplineAndBuild) == 0x000004, "Wrong alignment on GSEArteriesActor_CloseSplineAndBuild");
static_assert(sizeof(GSEArteriesActor_CloseSplineAndBuild) == 0x000008, "Wrong size on GSEArteriesActor_CloseSplineAndBuild");
static_assert(offsetof(GSEArteriesActor_CloseSplineAndBuild, CloseDistance) == 0x000000, "Member 'GSEArteriesActor_CloseSplineAndBuild::CloseDistance' has a wrong offset!");
static_assert(offsetof(GSEArteriesActor_CloseSplineAndBuild, ReturnValue) == 0x000004, "Member 'GSEArteriesActor_CloseSplineAndBuild::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesActor.SetSplineUnitLength
// 0x0004 (0x0004 - 0x0000)
struct GSEArteriesActor_SetSplineUnitLength final
{
public:
	float                                         Length;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesActor_SetSplineUnitLength) == 0x000004, "Wrong alignment on GSEArteriesActor_SetSplineUnitLength");
static_assert(sizeof(GSEArteriesActor_SetSplineUnitLength) == 0x000004, "Wrong size on GSEArteriesActor_SetSplineUnitLength");
static_assert(offsetof(GSEArteriesActor_SetSplineUnitLength, Length) == 0x000000, "Member 'GSEArteriesActor_SetSplineUnitLength::Length' has a wrong offset!");

// Function GSEArteries.GSEArteriesBoxComponent.GetSurfacePointsClockWise
// 0x0018 (0x0018 - 0x0000)
struct GSEArteriesBoxComponent_GetSurfacePointsClockWise final
{
public:
	bool                                          bBottomSurface;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesBoxComponent_GetSurfacePointsClockWise) == 0x000008, "Wrong alignment on GSEArteriesBoxComponent_GetSurfacePointsClockWise");
static_assert(sizeof(GSEArteriesBoxComponent_GetSurfacePointsClockWise) == 0x000018, "Wrong size on GSEArteriesBoxComponent_GetSurfacePointsClockWise");
static_assert(offsetof(GSEArteriesBoxComponent_GetSurfacePointsClockWise, bBottomSurface) == 0x000000, "Member 'GSEArteriesBoxComponent_GetSurfacePointsClockWise::bBottomSurface' has a wrong offset!");
static_assert(offsetof(GSEArteriesBoxComponent_GetSurfacePointsClockWise, ReturnValue) == 0x000008, "Member 'GSEArteriesBoxComponent_GetSurfacePointsClockWise::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AddLineAlongSpline
// 0x0018 (0x0018 - 0x0000)
struct GSEArteriesFuncLib_AddLineAlongSpline final
{
public:
	class USplineComponent*                       SplineComp;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AddLineAlongSpline) == 0x000008, "Wrong alignment on GSEArteriesFuncLib_AddLineAlongSpline");
static_assert(sizeof(GSEArteriesFuncLib_AddLineAlongSpline) == 0x000018, "Wrong size on GSEArteriesFuncLib_AddLineAlongSpline");
static_assert(offsetof(GSEArteriesFuncLib_AddLineAlongSpline, SplineComp) == 0x000000, "Member 'GSEArteriesFuncLib_AddLineAlongSpline::SplineComp' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddLineAlongSpline, Length) == 0x000008, "Member 'GSEArteriesFuncLib_AddLineAlongSpline::Length' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddLineAlongSpline, ReturnValue) == 0x000010, "Member 'GSEArteriesFuncLib_AddLineAlongSpline::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AddNoiseToPoints
// 0x0100 (0x0100 - 0x0000)
struct GSEArteriesFuncLib_AddNoiseToPoints final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransformNoiseLow;                                 // 0x0020(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseHigh;                                // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         StepYaw;                                           // 0x00E0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepPitch;                                         // 0x00E4(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepRoll;                                          // 0x00E8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseRatio;                                        // 0x00EC(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArteriesObject*                        ReturnValue;                                       // 0x00F0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSEArteriesFuncLib_AddNoiseToPoints) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AddNoiseToPoints");
static_assert(sizeof(GSEArteriesFuncLib_AddNoiseToPoints) == 0x000100, "Wrong size on GSEArteriesFuncLib_AddNoiseToPoints");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, TransformNoiseLow) == 0x000020, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::TransformNoiseLow' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, TransformNoiseHigh) == 0x000080, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::TransformNoiseHigh' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, StepYaw) == 0x0000E0, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::StepYaw' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, StepPitch) == 0x0000E4, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::StepPitch' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, StepRoll) == 0x0000E8, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::StepRoll' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, NoiseRatio) == 0x0000EC, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::NoiseRatio' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddNoiseToPoints, ReturnValue) == 0x0000F0, "Member 'GSEArteriesFuncLib_AddNoiseToPoints::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AddPerpendicularLinesAlongLine
// 0x0028 (0x0028 - 0x0000)
struct GSEArteriesFuncLib_AddPerpendicularLinesAlongLine final
{
public:
	class UArteriesObject*                        BackBones;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine) == 0x000008, "Wrong alignment on GSEArteriesFuncLib_AddPerpendicularLinesAlongLine");
static_assert(sizeof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine) == 0x000028, "Wrong size on GSEArteriesFuncLib_AddPerpendicularLinesAlongLine");
static_assert(offsetof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine, BackBones) == 0x000000, "Member 'GSEArteriesFuncLib_AddPerpendicularLinesAlongLine::BackBones' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AddPerpendicularLinesAlongLine::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine, Length) == 0x000018, "Member 'GSEArteriesFuncLib_AddPerpendicularLinesAlongLine::Length' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddPerpendicularLinesAlongLine, ReturnValue) == 0x000020, "Member 'GSEArteriesFuncLib_AddPerpendicularLinesAlongLine::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AddRoofToSimpleRect
// 0x0020 (0x0020 - 0x0000)
struct GSEArteriesFuncLib_AddRoofToSimpleRect final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArteriesObject*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AddRoofToSimpleRect) == 0x000008, "Wrong alignment on GSEArteriesFuncLib_AddRoofToSimpleRect");
static_assert(sizeof(GSEArteriesFuncLib_AddRoofToSimpleRect) == 0x000020, "Wrong size on GSEArteriesFuncLib_AddRoofToSimpleRect");
static_assert(offsetof(GSEArteriesFuncLib_AddRoofToSimpleRect, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AddRoofToSimpleRect::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddRoofToSimpleRect, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AddRoofToSimpleRect::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AddRoofToSimpleRect, ReturnValue) == 0x000018, "Member 'GSEArteriesFuncLib_AddRoofToSimpleRect::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToCornerCatenatePointsBySoftPath
// 0x00A0 (0x00A0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         UnitLength;                                        // 0x0090(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCatOutCorner;                                     // 0x0094(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlongCurveOutNormalOnly;                          // 0x0095(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath) == 0x0000A0, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, UnitLength) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::UnitLength' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, bCatOutCorner) == 0x000094, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::bCatOutCorner' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, bAlongCurveOutNormalOnly) == 0x000095, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::bAlongCurveOutNormalOnly' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath, ReturnValue) == 0x000098, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerCatenatePointsBySoftPath::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToCornerPointsBySoftPath
// 0x00A0 (0x00A0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bAsInnerCorner;                                    // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlongCurveOutNormalOnly;                          // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath) == 0x0000A0, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, bAsInnerCorner) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::bAsInnerCorner' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, bAlongCurveOutNormalOnly) == 0x000091, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::bAlongCurveOutNormalOnly' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath, ReturnValue) == 0x000098, "Member 'GSEArteriesFuncLib_AdvancedCopyToCornerPointsBySoftPath::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToEndPointsBySoftPath
// 0x00A0 (0x00A0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InGroup;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bIgnoreDelatZ;                                     // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath) == 0x0000A0, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, InGroup) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::InGroup' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, bIgnoreDelatZ) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::bIgnoreDelatZ' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath, ReturnValue) == 0x000098, "Member 'GSEArteriesFuncLib_AdvancedCopyToEndPointsBySoftPath::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToPoints
// 0x00A0 (0x00A0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToPoints final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Groups;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                        Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UArteriesObject*                        ReturnValue;                                       // 0x0090(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToPoints) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToPoints");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToPoints) == 0x0000A0, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToPoints");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPoints, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToPoints::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPoints, Groups) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToPoints::Groups' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPoints, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToPoints::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPoints, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToPoints::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPoints, ReturnValue) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToPoints::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToPointsBySoftPath
// 0x00A0 (0x00A0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Groups;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCorner;                                     // 0x0090(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCornerAdjacent;                             // 0x0091(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath) == 0x0000A0, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, Groups) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::Groups' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, bIgnoreCorner) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::bIgnoreCorner' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, bIgnoreCornerAdjacent) == 0x000091, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::bIgnoreCornerAdjacent' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath, ReturnValue) == 0x000098, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsBySoftPath::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedCopyToPointsByTrSoftPath
// 0x0170 (0x0170 - 0x0000)
struct GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Groups;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBaseTransformedSoftObject>     Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseLow;                                 // 0x0090(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseHigh;                                // 0x00F0(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                         EachPathWidth;                                     // 0x0150(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCorner;                                     // 0x0154(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreCornerAdjacent;                             // 0x0155(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateMultiPath;                                // 0x0156(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GenPathCount;                                      // 0x0158(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0160(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath) == 0x000170, "Wrong size on GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, Groups) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::Groups' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, TransformNoiseLow) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::TransformNoiseLow' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, TransformNoiseHigh) == 0x0000F0, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::TransformNoiseHigh' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, EachPathWidth) == 0x000150, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::EachPathWidth' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, bIgnoreCorner) == 0x000154, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::bIgnoreCorner' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, bIgnoreCornerAdjacent) == 0x000155, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::bIgnoreCornerAdjacent' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, bGenerateMultiPath) == 0x000156, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::bGenerateMultiPath' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, GenPathCount) == 0x000158, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::GenPathCount' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath, ReturnValue) == 0x000160, "Member 'GSEArteriesFuncLib_AdvancedCopyToPointsByTrSoftPath::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedSmartCopyToPointsByMeshExtents
// 0x0170 (0x0170 - 0x0000)
struct GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Groups;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UStaticMesh*>                    MeshSources;                                       // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0030(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseLow;                                 // 0x0090(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseHigh;                                // 0x00F0(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	EGSATERIES_SAMPLE_AXIS                        SampleAxis;                                        // 0x0150(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StepYaw;                                           // 0x0154(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepPitch;                                         // 0x0158(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepRoll;                                          // 0x015C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineNoiseChance;                                   // 0x0160(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResampleScale;                                     // 0x0164(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArteriesObject*                        ReturnValue;                                       // 0x0168(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents) == 0x000170, "Wrong size on GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, Groups) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::Groups' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, MeshSources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::MeshSources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, LocalTransform) == 0x000030, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, TransformNoiseLow) == 0x000090, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::TransformNoiseLow' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, TransformNoiseHigh) == 0x0000F0, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::TransformNoiseHigh' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, SampleAxis) == 0x000150, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::SampleAxis' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, StepYaw) == 0x000154, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::StepYaw' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, StepPitch) == 0x000158, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::StepPitch' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, StepRoll) == 0x00015C, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::StepRoll' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, LineNoiseChance) == 0x000160, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::LineNoiseChance' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, ResampleScale) == 0x000164, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::ResampleScale' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents, ReturnValue) == 0x000168, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsByMeshExtents::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedSmartCopyToPointsBySoftObjectExtents
// 0x0190 (0x0190 - 0x0000)
struct GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents final
{
public:
	class UArteriesObject*                        Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Groups;                                            // 0x0008(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                Sources;                                           // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<struct FSoftObjectPath>                NoiseSources;                                      // 0x0028(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0040(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseLow;                                 // 0x00A0(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseHigh;                                // 0x0100(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	EGSATERIES_SAMPLE_AXIS                        SampleAxis;                                        // 0x0160(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StepYaw;                                           // 0x0164(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepPitch;                                         // 0x0168(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepRoll;                                          // 0x016C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LineTwistChance;                                   // 0x0170(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UnitNoiseChane;                                    // 0x0174(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ResampleScale;                                     // 0x0178(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCount;                                    // 0x017C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CurvelyAdjusting;                                  // 0x0180(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArteriesObject*                        ReturnValue;                                       // 0x0188(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents) == 0x000010, "Wrong alignment on GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents");
static_assert(sizeof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents) == 0x000190, "Wrong size on GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, Target) == 0x000000, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::Target' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, Groups) == 0x000008, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::Groups' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, Sources) == 0x000018, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::Sources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, NoiseSources) == 0x000028, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::NoiseSources' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, LocalTransform) == 0x000040, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::LocalTransform' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, TransformNoiseLow) == 0x0000A0, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::TransformNoiseLow' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, TransformNoiseHigh) == 0x000100, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::TransformNoiseHigh' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, SampleAxis) == 0x000160, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::SampleAxis' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, StepYaw) == 0x000164, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::StepYaw' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, StepPitch) == 0x000168, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::StepPitch' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, StepRoll) == 0x00016C, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::StepRoll' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, LineTwistChance) == 0x000170, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::LineTwistChance' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, UnitNoiseChane) == 0x000174, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::UnitNoiseChane' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, ResampleScale) == 0x000178, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::ResampleScale' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, IterationCount) == 0x00017C, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::IterationCount' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, CurvelyAdjusting) == 0x000180, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::CurvelyAdjusting' has a wrong offset!");
static_assert(offsetof(GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents, ReturnValue) == 0x000188, "Member 'GSEArteriesFuncLib_AdvancedSmartCopyToPointsBySoftObjectExtents::ReturnValue' has a wrong offset!");

// Function GSEArteries.GSEArteriesFuncLib.AdvancedSmartStackToPointsBySoftPath
// 0x01D0 (0x01D0 - 0x0000)
struct GSEArteriesFuncLib_AdvancedSmartStackToPointsBySoftPath final
{
public:
	class AArteriesActor*                         OwnerActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UArteriesObject*                        Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExpectedObjectsNum;                                // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Groups;                                            // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FSoftObjectPath, struct FGSArteriesStackRule> SoftPathToRuleMap;                                 // 0x0028(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LocalTransform;                                    // 0x0080(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseLow;                                 // 0x00E0(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FTransform                             TransformNoiseHigh;                                // 0x0140(0x0060)(Parm, IsPlainOldData, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
