#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GSNiagara

#include "Basic.hpp"

#include "Niagara_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GSNiagara_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class GSNiagara.GSNiagaraBatchingSpriteConfig
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraBatchingSpriteConfig final : public UNiagaraDataInterface
{
public:
	class UGSNiagaraBatchingSpriteConfigDA*       ConfigInfo;                                        // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraBatchingSpriteConfig">();
	}
	static class UGSNiagaraBatchingSpriteConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraBatchingSpriteConfig>();
	}
};
static_assert(alignof(UGSNiagaraBatchingSpriteConfig) == 0x000008, "Wrong alignment on UGSNiagaraBatchingSpriteConfig");
static_assert(sizeof(UGSNiagaraBatchingSpriteConfig) == 0x000040, "Wrong size on UGSNiagaraBatchingSpriteConfig");
static_assert(offsetof(UGSNiagaraBatchingSpriteConfig, ConfigInfo) == 0x000038, "Member 'UGSNiagaraBatchingSpriteConfig::ConfigInfo' has a wrong offset!");

// Class GSNiagara.GSNiagaraBatchingSpriteConfigDA
// 0x0060 (0x0090 - 0x0030)
class UGSNiagaraBatchingSpriteConfigDA final : public UPrimaryDataAsset
{
public:
	class FString                                 AtlasConfigFilePath;                               // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              AltasTextureSize;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSNiagaraParticleInfoConfig>   ParticleInfoConfigArray;                           // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGSNiagaraParticleSpriteMapping> ParticleSpriteMappingConfig;                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearPaticleConfigData();
	bool InitGSParticlesConfigInfo(bool bForceSet);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraBatchingSpriteConfigDA">();
	}
	static class UGSNiagaraBatchingSpriteConfigDA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraBatchingSpriteConfigDA>();
	}
};
static_assert(alignof(UGSNiagaraBatchingSpriteConfigDA) == 0x000008, "Wrong alignment on UGSNiagaraBatchingSpriteConfigDA");
static_assert(sizeof(UGSNiagaraBatchingSpriteConfigDA) == 0x000090, "Wrong size on UGSNiagaraBatchingSpriteConfigDA");
static_assert(offsetof(UGSNiagaraBatchingSpriteConfigDA, AtlasConfigFilePath) == 0x000030, "Member 'UGSNiagaraBatchingSpriteConfigDA::AtlasConfigFilePath' has a wrong offset!");
static_assert(offsetof(UGSNiagaraBatchingSpriteConfigDA, AltasTextureSize) == 0x000040, "Member 'UGSNiagaraBatchingSpriteConfigDA::AltasTextureSize' has a wrong offset!");
static_assert(offsetof(UGSNiagaraBatchingSpriteConfigDA, ParticleInfoConfigArray) == 0x000050, "Member 'UGSNiagaraBatchingSpriteConfigDA::ParticleInfoConfigArray' has a wrong offset!");
static_assert(offsetof(UGSNiagaraBatchingSpriteConfigDA, ParticleSpriteMappingConfig) == 0x000060, "Member 'UGSNiagaraBatchingSpriteConfigDA::ParticleSpriteMappingConfig' has a wrong offset!");

// Class GSNiagara.GSNiagaraArrayData
// 0x0038 (0x0068 - 0x0030)
class UGSNiagaraArrayData final : public UPrimaryDataAsset
{
public:
	TArray<struct FGSNiagaraParticleInfo>         ParticleInfoArray;                                 // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddParticle(const struct FGSNiagaraParticleInfo& Info);
	void ClearParticleArrayData();
	void ForceSetParticlePos(const TArray<struct FVector>& TargetPosArray);
	void ForceSetParticleSize(const TArray<float>& TargetSizeArray);
	bool RemoveParticle(const struct FGSNiagaraParticleInfo& Info);
	void UpdateParticle(const TArray<struct FGSNiagaraParticleInfo>& InParticleInfoArray);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraArrayData">();
	}
	static class UGSNiagaraArrayData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraArrayData>();
	}
};
static_assert(alignof(UGSNiagaraArrayData) == 0x000008, "Wrong alignment on UGSNiagaraArrayData");
static_assert(sizeof(UGSNiagaraArrayData) == 0x000068, "Wrong size on UGSNiagaraArrayData");
static_assert(offsetof(UGSNiagaraArrayData, ParticleInfoArray) == 0x000030, "Member 'UGSNiagaraArrayData::ParticleInfoArray' has a wrong offset!");

// Class GSNiagara.GSNiagaraParticleArrayData
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraParticleArrayData final : public UNiagaraDataInterface
{
public:
	class UGSNiagaraArrayData*                    ArrayData;                                         // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraParticleArrayData">();
	}
	static class UGSNiagaraParticleArrayData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraParticleArrayData>();
	}
};
static_assert(alignof(UGSNiagaraParticleArrayData) == 0x000008, "Wrong alignment on UGSNiagaraParticleArrayData");
static_assert(sizeof(UGSNiagaraParticleArrayData) == 0x000040, "Wrong size on UGSNiagaraParticleArrayData");
static_assert(offsetof(UGSNiagaraParticleArrayData, ArrayData) == 0x000038, "Member 'UGSNiagaraParticleArrayData::ArrayData' has a wrong offset!");

// Class GSNiagara.GSNiagaraRVTSampler
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraRVTSampler final : public UNiagaraDataInterface
{
public:
	class URuntimeVirtualTexture*                 VirtualTexture;                                    // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraRVTSampler">();
	}
	static class UGSNiagaraRVTSampler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraRVTSampler>();
	}
};
static_assert(alignof(UGSNiagaraRVTSampler) == 0x000008, "Wrong alignment on UGSNiagaraRVTSampler");
static_assert(sizeof(UGSNiagaraRVTSampler) == 0x000040, "Wrong size on UGSNiagaraRVTSampler");
static_assert(offsetof(UGSNiagaraRVTSampler, VirtualTexture) == 0x000038, "Member 'UGSNiagaraRVTSampler::VirtualTexture' has a wrong offset!");

// Class GSNiagara.VATAnimClipsNiagaraData
// 0x0028 (0x0058 - 0x0030)
class UVATAnimClipsNiagaraData final : public UPrimaryDataAsset
{
public:
	struct FVector2D                              GlobalInputDirection;                              // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GlobalInputIntensity;                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      CachedDirs;                                        // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VATAnimClipsNiagaraData">();
	}
	static class UVATAnimClipsNiagaraData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVATAnimClipsNiagaraData>();
	}
};
static_assert(alignof(UVATAnimClipsNiagaraData) == 0x000008, "Wrong alignment on UVATAnimClipsNiagaraData");
static_assert(sizeof(UVATAnimClipsNiagaraData) == 0x000058, "Wrong size on UVATAnimClipsNiagaraData");
static_assert(offsetof(UVATAnimClipsNiagaraData, GlobalInputDirection) == 0x000030, "Member 'UVATAnimClipsNiagaraData::GlobalInputDirection' has a wrong offset!");
static_assert(offsetof(UVATAnimClipsNiagaraData, GlobalInputIntensity) == 0x000040, "Member 'UVATAnimClipsNiagaraData::GlobalInputIntensity' has a wrong offset!");
static_assert(offsetof(UVATAnimClipsNiagaraData, CachedDirs) == 0x000048, "Member 'UVATAnimClipsNiagaraData::CachedDirs' has a wrong offset!");

// Class GSNiagara.GSNiagaraVATAnimMachine
// 0x0008 (0x0040 - 0x0038)
class UGSNiagaraVATAnimMachine final : public UNiagaraDataInterface
{
public:
	class UVATAnimClipsNiagaraData*               VATNiagaraDataContainer;                           // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSNiagaraVATAnimMachine">();
	}
	static class UGSNiagaraVATAnimMachine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSNiagaraVATAnimMachine>();
	}
};
static_assert(alignof(UGSNiagaraVATAnimMachine) == 0x000008, "Wrong alignment on UGSNiagaraVATAnimMachine");
static_assert(sizeof(UGSNiagaraVATAnimMachine) == 0x000040, "Wrong size on UGSNiagaraVATAnimMachine");
static_assert(offsetof(UGSNiagaraVATAnimMachine, VATNiagaraDataContainer) == 0x000038, "Member 'UGSNiagaraVATAnimMachine::VATNiagaraDataContainer' has a wrong offset!");

}

