#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HairStrandsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// Class HairStrandsCore.GroomActor
// 0x0008 (0x0280 - 0x0278)
class AGroomActor final : public AActor
{
public:
	class UGroomComponent*                        GroomComponent;                                    // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomActor">();
	}
	static class AGroomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGroomActor>();
	}
};
static_assert(alignof(AGroomActor) == 0x000008, "Wrong alignment on AGroomActor");
static_assert(sizeof(AGroomActor) == 0x000280, "Wrong size on AGroomActor");
static_assert(offsetof(AGroomActor, GroomComponent) == 0x000278, "Member 'AGroomActor::GroomComponent' has a wrong offset!");

// Class HairStrandsCore.GroomAsset
// 0x00D0 (0x00F8 - 0x0028)
class UGroomAsset final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupInfoWithVisibility>   HairGroupsInfo;                                    // 0x0030(0x0010)(Edit, EditFixedSize, ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsRendering>           HairGroupsRendering;                               // 0x0040(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsPhysics>             HairGroupsPhysics;                                 // 0x0050(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       HairGroupsInterpolation;                           // 0x0060(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsLOD>                 HairGroupsLOD;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsCardsSourceDescription> HairGroupsCards;                                   // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMeshesSourceDescription> HairGroupsMeshes;                                  // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsMaterial>            HairGroupsMaterials;                               // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          EnableGlobalInterpolation;                         // 0x00C0(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationType                       HairInterpolationType;                             // 0x00C1(0x0001)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPerPlatformInt                        MinLOD;                                            // 0x00C4(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FPerPlatformBool                       DisableBelowMinLodStripping;                       // 0x00C8(0x0001)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 EffectiveLODBias;                                  // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAssetUserData*>                 AssetUserData;                                     // 0x00E0(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomAsset">();
	}
	static class UGroomAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAsset>();
	}
};
static_assert(alignof(UGroomAsset) == 0x000008, "Wrong alignment on UGroomAsset");
static_assert(sizeof(UGroomAsset) == 0x0000F8, "Wrong size on UGroomAsset");
static_assert(offsetof(UGroomAsset, HairGroupsInfo) == 0x000030, "Member 'UGroomAsset::HairGroupsInfo' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsRendering) == 0x000040, "Member 'UGroomAsset::HairGroupsRendering' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsPhysics) == 0x000050, "Member 'UGroomAsset::HairGroupsPhysics' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsInterpolation) == 0x000060, "Member 'UGroomAsset::HairGroupsInterpolation' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsLOD) == 0x000070, "Member 'UGroomAsset::HairGroupsLOD' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsCards) == 0x000080, "Member 'UGroomAsset::HairGroupsCards' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsMeshes) == 0x000090, "Member 'UGroomAsset::HairGroupsMeshes' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairGroupsMaterials) == 0x0000A0, "Member 'UGroomAsset::HairGroupsMaterials' has a wrong offset!");
static_assert(offsetof(UGroomAsset, EnableGlobalInterpolation) == 0x0000C0, "Member 'UGroomAsset::EnableGlobalInterpolation' has a wrong offset!");
static_assert(offsetof(UGroomAsset, HairInterpolationType) == 0x0000C1, "Member 'UGroomAsset::HairInterpolationType' has a wrong offset!");
static_assert(offsetof(UGroomAsset, MinLOD) == 0x0000C4, "Member 'UGroomAsset::MinLOD' has a wrong offset!");
static_assert(offsetof(UGroomAsset, DisableBelowMinLodStripping) == 0x0000C8, "Member 'UGroomAsset::DisableBelowMinLodStripping' has a wrong offset!");
static_assert(offsetof(UGroomAsset, EffectiveLODBias) == 0x0000D0, "Member 'UGroomAsset::EffectiveLODBias' has a wrong offset!");
static_assert(offsetof(UGroomAsset, AssetUserData) == 0x0000E0, "Member 'UGroomAsset::AssetUserData' has a wrong offset!");

// Class HairStrandsCore.GroomAssetImportData
// 0x0008 (0x0030 - 0x0028)
class UGroomAssetImportData final : public UAssetImportData
{
public:
	class UGroomImportOptions*                    ImportOptions;                                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomAssetImportData">();
	}
	static class UGroomAssetImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomAssetImportData>();
	}
};
static_assert(alignof(UGroomAssetImportData) == 0x000008, "Wrong alignment on UGroomAssetImportData");
static_assert(sizeof(UGroomAssetImportData) == 0x000030, "Wrong size on UGroomAssetImportData");
static_assert(offsetof(UGroomAssetImportData, ImportOptions) == 0x000028, "Member 'UGroomAssetImportData::ImportOptions' has a wrong offset!");

// Class HairStrandsCore.GroomBindingAsset
// 0x0088 (0x00B0 - 0x0028)
class alignas(0x10) UGroomBindingAsset final : public UObject
{
public:
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            Groom;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingSection;                                   // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGoomBindingGroupInfo>          GroupInfos;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x40];                                      // 0x0070(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomBindingAsset">();
	}
	static class UGroomBindingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBindingAsset>();
	}
};
static_assert(alignof(UGroomBindingAsset) == 0x000010, "Wrong alignment on UGroomBindingAsset");
static_assert(sizeof(UGroomBindingAsset) == 0x0000B0, "Wrong size on UGroomBindingAsset");
static_assert(offsetof(UGroomBindingAsset, GroomBindingType) == 0x000028, "Member 'UGroomBindingAsset::GroomBindingType' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, Groom) == 0x000030, "Member 'UGroomBindingAsset::Groom' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, SourceSkeletalMesh) == 0x000038, "Member 'UGroomBindingAsset::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, TargetSkeletalMesh) == 0x000040, "Member 'UGroomBindingAsset::TargetSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, SourceGeometryCache) == 0x000048, "Member 'UGroomBindingAsset::SourceGeometryCache' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, TargetGeometryCache) == 0x000050, "Member 'UGroomBindingAsset::TargetGeometryCache' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, NumInterpolationPoints) == 0x000058, "Member 'UGroomBindingAsset::NumInterpolationPoints' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, MatchingSection) == 0x00005C, "Member 'UGroomBindingAsset::MatchingSection' has a wrong offset!");
static_assert(offsetof(UGroomBindingAsset, GroupInfos) == 0x000060, "Member 'UGroomBindingAsset::GroupInfos' has a wrong offset!");

// Class HairStrandsCore.GroomBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UGroomBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAsset(class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGeometryCacheGroomBindingAssetWithPath(const class FString& DesiredPackagePath, class UGroomAsset* GroomAsset, class UGeometryCache* GeometryCache, int32 NumInterpolationPoints, class UGeometryCache* SourceGeometryCacheForTransfer, int32 MatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAsset(class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);
	static class UGroomBindingAsset* CreateNewGroomBindingAssetWithPath(const class FString& InDesiredPackagePath, class UGroomAsset* InGroomAsset, class USkeletalMesh* InSkeletalMesh, int32 InNumInterpolationPoints, class USkeletalMesh* InSourceSkeletalMeshForTransfer, int32 InMatchingSection);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomBlueprintLibrary">();
	}
	static class UGroomBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomBlueprintLibrary>();
	}
};
static_assert(alignof(UGroomBlueprintLibrary) == 0x000008, "Wrong alignment on UGroomBlueprintLibrary");
static_assert(sizeof(UGroomBlueprintLibrary) == 0x000028, "Wrong size on UGroomBlueprintLibrary");

// Class HairStrandsCore.GroomCache
// 0x0040 (0x0068 - 0x0028)
class UGroomCache final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroomCacheInfo                        GroomCacheInfo;                                    // 0x0030(0x0028)(Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x10];                                      // 0x0058(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCache">();
	}
	static class UGroomCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCache>();
	}
};
static_assert(alignof(UGroomCache) == 0x000008, "Wrong alignment on UGroomCache");
static_assert(sizeof(UGroomCache) == 0x000068, "Wrong size on UGroomCache");
static_assert(offsetof(UGroomCache, GroomCacheInfo) == 0x000030, "Member 'UGroomCache::GroomCacheInfo' has a wrong offset!");

// Class HairStrandsCore.GroomCacheImportOptions
// 0x0028 (0x0050 - 0x0028)
class UGroomCacheImportOptions final : public UObject
{
public:
	struct FGroomCacheImportSettings              ImportSettings;                                    // 0x0028(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCacheImportOptions">();
	}
	static class UGroomCacheImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportOptions>();
	}
};
static_assert(alignof(UGroomCacheImportOptions) == 0x000008, "Wrong alignment on UGroomCacheImportOptions");
static_assert(sizeof(UGroomCacheImportOptions) == 0x000050, "Wrong size on UGroomCacheImportOptions");
static_assert(offsetof(UGroomCacheImportOptions, ImportSettings) == 0x000028, "Member 'UGroomCacheImportOptions::ImportSettings' has a wrong offset!");

// Class HairStrandsCore.GroomCacheImportData
// 0x0028 (0x0050 - 0x0028)
class UGroomCacheImportData final : public UAssetImportData
{
public:
	struct FGroomCacheImportSettings              Settings;                                          // 0x0028(0x0028)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCacheImportData">();
	}
	static class UGroomCacheImportData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCacheImportData>();
	}
};
static_assert(alignof(UGroomCacheImportData) == 0x000008, "Wrong alignment on UGroomCacheImportData");
static_assert(sizeof(UGroomCacheImportData) == 0x000050, "Wrong size on UGroomCacheImportData");
static_assert(offsetof(UGroomCacheImportData, Settings) == 0x000028, "Member 'UGroomCacheImportData::Settings' has a wrong offset!");

// Class HairStrandsCore.GroomComponent
// 0x0240 (0x07C0 - 0x0580)
class UGroomComponent final : public UMeshComponent
{
public:
	uint8                                         Pad_580[0x8];                                      // 0x0580(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroomAsset*                            GroomAsset;                                        // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomCache*                            GroomCache;                                        // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UNiagaraComponent*>              NiagaraComponents;                                 // 0x0598(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGroomBindingAsset*                     BindingAsset;                                      // 0x05B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                          PhysicsAsset;                                      // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C0[0x10];                                     // 0x05C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHairSimulationSettings                SimulationSettings;                                // 0x05D0(0x0090)(Edit, BlueprintVisible, Interp, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Strands_DebugMaterial;                             // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Strands_DefaultMaterial;                           // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Cards_DefaultMaterial;                             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Meshes_DefaultMaterial;                            // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         AngularSpringsSystem;                              // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         CosseratRodsSystem;                                // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AttachmentName;                                    // 0x0690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Interp, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6A0[0x90];                                     // 0x06A0(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHairGroupDesc>                 GroomGroupsDesc;                                   // 0x0730(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bUseCards;                                         // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRunning;                                          // 0x0741(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLooping;                                          // 0x0742(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bManualTick;                                       // 0x0743(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ElapsedTime;                                       // 0x0744(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_748[0x78];                                     // 0x0748(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddCollisionComponent(class USkeletalMeshComponent* SkeletalMeshComponent);
	bool GetIsHairLengthScaleEnabled();
	void ResetCollisionComponents();
	void ResetSimulation();
	void SetBindingAsset(class UGroomBindingAsset* InBinding);
	void SetEnableSimulation(bool bInEnableSimulation);
	void SetGroomAsset(class UGroomAsset* Asset);
	void SetHairLengthScale(float Scale);
	void SetHairLengthScaleEnable(bool bEnable);
	void SetPhysicsAsset(class UPhysicsAsset* InPhysicsAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomComponent">();
	}
	static class UGroomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomComponent>();
	}
};
static_assert(alignof(UGroomComponent) == 0x000010, "Wrong alignment on UGroomComponent");
static_assert(sizeof(UGroomComponent) == 0x0007C0, "Wrong size on UGroomComponent");
static_assert(offsetof(UGroomComponent, GroomAsset) == 0x000588, "Member 'UGroomComponent::GroomAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, GroomCache) == 0x000590, "Member 'UGroomComponent::GroomCache' has a wrong offset!");
static_assert(offsetof(UGroomComponent, NiagaraComponents) == 0x000598, "Member 'UGroomComponent::NiagaraComponents' has a wrong offset!");
static_assert(offsetof(UGroomComponent, SourceSkeletalMesh) == 0x0005A8, "Member 'UGroomComponent::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomComponent, BindingAsset) == 0x0005B0, "Member 'UGroomComponent::BindingAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, PhysicsAsset) == 0x0005B8, "Member 'UGroomComponent::PhysicsAsset' has a wrong offset!");
static_assert(offsetof(UGroomComponent, SimulationSettings) == 0x0005D0, "Member 'UGroomComponent::SimulationSettings' has a wrong offset!");
static_assert(offsetof(UGroomComponent, Strands_DebugMaterial) == 0x000660, "Member 'UGroomComponent::Strands_DebugMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, Strands_DefaultMaterial) == 0x000668, "Member 'UGroomComponent::Strands_DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, Cards_DefaultMaterial) == 0x000670, "Member 'UGroomComponent::Cards_DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, Meshes_DefaultMaterial) == 0x000678, "Member 'UGroomComponent::Meshes_DefaultMaterial' has a wrong offset!");
static_assert(offsetof(UGroomComponent, AngularSpringsSystem) == 0x000680, "Member 'UGroomComponent::AngularSpringsSystem' has a wrong offset!");
static_assert(offsetof(UGroomComponent, CosseratRodsSystem) == 0x000688, "Member 'UGroomComponent::CosseratRodsSystem' has a wrong offset!");
static_assert(offsetof(UGroomComponent, AttachmentName) == 0x000690, "Member 'UGroomComponent::AttachmentName' has a wrong offset!");
static_assert(offsetof(UGroomComponent, GroomGroupsDesc) == 0x000730, "Member 'UGroomComponent::GroomGroupsDesc' has a wrong offset!");
static_assert(offsetof(UGroomComponent, bUseCards) == 0x000740, "Member 'UGroomComponent::bUseCards' has a wrong offset!");
static_assert(offsetof(UGroomComponent, bRunning) == 0x000741, "Member 'UGroomComponent::bRunning' has a wrong offset!");
static_assert(offsetof(UGroomComponent, bLooping) == 0x000742, "Member 'UGroomComponent::bLooping' has a wrong offset!");
static_assert(offsetof(UGroomComponent, bManualTick) == 0x000743, "Member 'UGroomComponent::bManualTick' has a wrong offset!");
static_assert(offsetof(UGroomComponent, ElapsedTime) == 0x000744, "Member 'UGroomComponent::ElapsedTime' has a wrong offset!");

// Class HairStrandsCore.GroomCreateBindingOptions
// 0x0030 (0x0058 - 0x0028)
class UGroomCreateBindingOptions final : public UObject
{
public:
	EGroomBindingMeshType                         GroomBindingType;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          SourceSkeletalMesh;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          TargetSkeletalMesh;                                // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         SourceGeometryCache;                               // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGeometryCache*                         TargetGeometryCache;                               // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumInterpolationPoints;                            // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MatchingSection;                                   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCreateBindingOptions">();
	}
	static class UGroomCreateBindingOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateBindingOptions>();
	}
};
static_assert(alignof(UGroomCreateBindingOptions) == 0x000008, "Wrong alignment on UGroomCreateBindingOptions");
static_assert(sizeof(UGroomCreateBindingOptions) == 0x000058, "Wrong size on UGroomCreateBindingOptions");
static_assert(offsetof(UGroomCreateBindingOptions, GroomBindingType) == 0x000028, "Member 'UGroomCreateBindingOptions::GroomBindingType' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, SourceSkeletalMesh) == 0x000030, "Member 'UGroomCreateBindingOptions::SourceSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, TargetSkeletalMesh) == 0x000038, "Member 'UGroomCreateBindingOptions::TargetSkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, SourceGeometryCache) == 0x000040, "Member 'UGroomCreateBindingOptions::SourceGeometryCache' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, TargetGeometryCache) == 0x000048, "Member 'UGroomCreateBindingOptions::TargetGeometryCache' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, NumInterpolationPoints) == 0x000050, "Member 'UGroomCreateBindingOptions::NumInterpolationPoints' has a wrong offset!");
static_assert(offsetof(UGroomCreateBindingOptions, MatchingSection) == 0x000054, "Member 'UGroomCreateBindingOptions::MatchingSection' has a wrong offset!");

// Class HairStrandsCore.GroomCreateFollicleMaskOptions
// 0x0018 (0x0040 - 0x0028)
class UGroomCreateFollicleMaskOptions final : public UObject
{
public:
	int32                                         Resolution;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RootRadius;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFollicleMaskOptions>           Grooms;                                            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCreateFollicleMaskOptions">();
	}
	static class UGroomCreateFollicleMaskOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateFollicleMaskOptions>();
	}
};
static_assert(alignof(UGroomCreateFollicleMaskOptions) == 0x000008, "Wrong alignment on UGroomCreateFollicleMaskOptions");
static_assert(sizeof(UGroomCreateFollicleMaskOptions) == 0x000040, "Wrong size on UGroomCreateFollicleMaskOptions");
static_assert(offsetof(UGroomCreateFollicleMaskOptions, Resolution) == 0x000028, "Member 'UGroomCreateFollicleMaskOptions::Resolution' has a wrong offset!");
static_assert(offsetof(UGroomCreateFollicleMaskOptions, RootRadius) == 0x00002C, "Member 'UGroomCreateFollicleMaskOptions::RootRadius' has a wrong offset!");
static_assert(offsetof(UGroomCreateFollicleMaskOptions, Grooms) == 0x000030, "Member 'UGroomCreateFollicleMaskOptions::Grooms' has a wrong offset!");

// Class HairStrandsCore.GroomCreateStrandsTexturesOptions
// 0x0040 (0x0068 - 0x0028)
class UGroomCreateStrandsTexturesOptions final : public UObject
{
public:
	int32                                         Resolution;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesTraceType                     TraceType;                                         // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceDistance;                                     // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStrandsTexturesMeshType                      MeshType;                                          // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            StaticMesh;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SectionIndex;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannelIndex;                                    // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 GroupIndex;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomCreateStrandsTexturesOptions">();
	}
	static class UGroomCreateStrandsTexturesOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomCreateStrandsTexturesOptions>();
	}
};
static_assert(alignof(UGroomCreateStrandsTexturesOptions) == 0x000008, "Wrong alignment on UGroomCreateStrandsTexturesOptions");
static_assert(sizeof(UGroomCreateStrandsTexturesOptions) == 0x000068, "Wrong size on UGroomCreateStrandsTexturesOptions");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, Resolution) == 0x000028, "Member 'UGroomCreateStrandsTexturesOptions::Resolution' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, TraceType) == 0x00002C, "Member 'UGroomCreateStrandsTexturesOptions::TraceType' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, TraceDistance) == 0x000030, "Member 'UGroomCreateStrandsTexturesOptions::TraceDistance' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, MeshType) == 0x000034, "Member 'UGroomCreateStrandsTexturesOptions::MeshType' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, StaticMesh) == 0x000038, "Member 'UGroomCreateStrandsTexturesOptions::StaticMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, SkeletalMesh) == 0x000040, "Member 'UGroomCreateStrandsTexturesOptions::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, LODIndex) == 0x000048, "Member 'UGroomCreateStrandsTexturesOptions::LODIndex' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, SectionIndex) == 0x00004C, "Member 'UGroomCreateStrandsTexturesOptions::SectionIndex' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, UVChannelIndex) == 0x000050, "Member 'UGroomCreateStrandsTexturesOptions::UVChannelIndex' has a wrong offset!");
static_assert(offsetof(UGroomCreateStrandsTexturesOptions, GroupIndex) == 0x000058, "Member 'UGroomCreateStrandsTexturesOptions::GroupIndex' has a wrong offset!");

// Class HairStrandsCore.GroomImportOptions
// 0x0040 (0x0068 - 0x0028)
class UGroomImportOptions final : public UObject
{
public:
	struct FGroomConversionSettings               ConversionSettings;                                // 0x0028(0x0030)(Edit, BlueprintVisible, Config, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FHairGroupsInterpolation>       InterpolationSettings;                             // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomImportOptions">();
	}
	static class UGroomImportOptions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomImportOptions>();
	}
};
static_assert(alignof(UGroomImportOptions) == 0x000008, "Wrong alignment on UGroomImportOptions");
static_assert(sizeof(UGroomImportOptions) == 0x000068, "Wrong size on UGroomImportOptions");
static_assert(offsetof(UGroomImportOptions, ConversionSettings) == 0x000028, "Member 'UGroomImportOptions::ConversionSettings' has a wrong offset!");
static_assert(offsetof(UGroomImportOptions, InterpolationSettings) == 0x000058, "Member 'UGroomImportOptions::InterpolationSettings' has a wrong offset!");

// Class HairStrandsCore.GroomHairGroupsPreview
// 0x0010 (0x0038 - 0x0028)
class UGroomHairGroupsPreview final : public UObject
{
public:
	TArray<struct FGroomHairGroupPreview>         Groups;                                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomHairGroupsPreview">();
	}
	static class UGroomHairGroupsPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomHairGroupsPreview>();
	}
};
static_assert(alignof(UGroomHairGroupsPreview) == 0x000008, "Wrong alignment on UGroomHairGroupsPreview");
static_assert(sizeof(UGroomHairGroupsPreview) == 0x000038, "Wrong size on UGroomHairGroupsPreview");
static_assert(offsetof(UGroomHairGroupsPreview, Groups) == 0x000028, "Member 'UGroomHairGroupsPreview::Groups' has a wrong offset!");

// Class HairStrandsCore.GroomPluginSettings
// 0x0008 (0x0030 - 0x0028)
class UGroomPluginSettings final : public UObject
{
public:
	float                                         GroomCacheLookAheadBuffer;                         // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroomPluginSettings">();
	}
	static class UGroomPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroomPluginSettings>();
	}
};
static_assert(alignof(UGroomPluginSettings) == 0x000008, "Wrong alignment on UGroomPluginSettings");
static_assert(sizeof(UGroomPluginSettings) == 0x000030, "Wrong size on UGroomPluginSettings");
static_assert(offsetof(UGroomPluginSettings, GroomCacheLookAheadBuffer) == 0x000028, "Member 'UGroomPluginSettings::GroomCacheLookAheadBuffer' has a wrong offset!");

// Class HairStrandsCore.MovieSceneGroomCacheSection
// 0x0020 (0x0108 - 0x00E8)
class UMovieSceneGroomCacheSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneGroomCacheParams            Params_0;                                          // 0x00E8(0x0020)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGroomCacheSection">();
	}
	static class UMovieSceneGroomCacheSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheSection>();
	}
};
static_assert(alignof(UMovieSceneGroomCacheSection) == 0x000008, "Wrong alignment on UMovieSceneGroomCacheSection");
static_assert(sizeof(UMovieSceneGroomCacheSection) == 0x000108, "Wrong size on UMovieSceneGroomCacheSection");
static_assert(offsetof(UMovieSceneGroomCacheSection, Params_0) == 0x0000E8, "Member 'UMovieSceneGroomCacheSection::Params_0' has a wrong offset!");

// Class HairStrandsCore.MovieSceneGroomCacheTrack
// 0x0018 (0x00A8 - 0x0090)
class UMovieSceneGroomCacheTrack final : public UMovieSceneNameableTrack
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieSceneSection*>             AnimationSections;                                 // 0x0098(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneGroomCacheTrack">();
	}
	static class UMovieSceneGroomCacheTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneGroomCacheTrack>();
	}
};
static_assert(alignof(UMovieSceneGroomCacheTrack) == 0x000008, "Wrong alignment on UMovieSceneGroomCacheTrack");
static_assert(sizeof(UMovieSceneGroomCacheTrack) == 0x0000A8, "Wrong size on UMovieSceneGroomCacheTrack");
static_assert(offsetof(UMovieSceneGroomCacheTrack, AnimationSections) == 0x000098, "Member 'UMovieSceneGroomCacheTrack::AnimationSections' has a wrong offset!");

// Class HairStrandsCore.NiagaraDataInterfaceHairStrands
// 0x0018 (0x0050 - 0x0038)
class UNiagaraDataInterfaceHairStrands final : public UNiagaraDataInterface
{
public:
	class UGroomAsset*                            DefaultSource;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceActor;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceHairStrands">();
	}
	static class UNiagaraDataInterfaceHairStrands* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceHairStrands>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceHairStrands) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceHairStrands");
static_assert(sizeof(UNiagaraDataInterfaceHairStrands) == 0x000050, "Wrong size on UNiagaraDataInterfaceHairStrands");
static_assert(offsetof(UNiagaraDataInterfaceHairStrands, DefaultSource) == 0x000038, "Member 'UNiagaraDataInterfaceHairStrands::DefaultSource' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceHairStrands, SourceActor) == 0x000040, "Member 'UNiagaraDataInterfaceHairStrands::SourceActor' has a wrong offset!");

// Class HairStrandsCore.NiagaraDataInterfacePhysicsAsset
// 0x0050 (0x0088 - 0x0038)
class UNiagaraDataInterfacePhysicsAsset final : public UNiagaraDataInterface
{
public:
	class UPhysicsAsset*                          DefaultSource;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SourceActor;                                       // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           MeshUserParameter;                                 // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
	uint8                                         Pad_68[0x20];                                      // 0x0068(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfacePhysicsAsset">();
	}
	static class UNiagaraDataInterfacePhysicsAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfacePhysicsAsset>();
	}
};
static_assert(alignof(UNiagaraDataInterfacePhysicsAsset) == 0x000008, "Wrong alignment on UNiagaraDataInterfacePhysicsAsset");
static_assert(sizeof(UNiagaraDataInterfacePhysicsAsset) == 0x000088, "Wrong size on UNiagaraDataInterfacePhysicsAsset");
static_assert(offsetof(UNiagaraDataInterfacePhysicsAsset, DefaultSource) == 0x000038, "Member 'UNiagaraDataInterfacePhysicsAsset::DefaultSource' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfacePhysicsAsset, SourceActor) == 0x000040, "Member 'UNiagaraDataInterfacePhysicsAsset::SourceActor' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfacePhysicsAsset, MeshUserParameter) == 0x000048, "Member 'UNiagaraDataInterfacePhysicsAsset::MeshUserParameter' has a wrong offset!");

// Class HairStrandsCore.NiagaraDataInterfaceVelocityGrid
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceVelocityGrid : public UNiagaraDataInterfaceRWBase
{
public:
	struct FIntVector                             GridSize;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceVelocityGrid">();
	}
	static class UNiagaraDataInterfaceVelocityGrid* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceVelocityGrid>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceVelocityGrid) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceVelocityGrid");
static_assert(sizeof(UNiagaraDataInterfaceVelocityGrid) == 0x000048, "Wrong size on UNiagaraDataInterfaceVelocityGrid");
static_assert(offsetof(UNiagaraDataInterfaceVelocityGrid, GridSize) == 0x000038, "Member 'UNiagaraDataInterfaceVelocityGrid::GridSize' has a wrong offset!");

// Class HairStrandsCore.NiagaraDataInterfacePressureGrid
// 0x0000 (0x0048 - 0x0048)
class UNiagaraDataInterfacePressureGrid final : public UNiagaraDataInterfaceVelocityGrid
{
public:
	static class UClass* StaticClass()
	{
