#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HairStrandsCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Enum HairStrandsCore.EHairCardsClusterType
// NumValues: 0x0003
enum class EHairCardsClusterType : uint8
{
	Low                                      = 0,
	High                                     = 1,
	EHairCardsClusterType_MAX                = 2,
};

// Enum HairStrandsCore.EHairCardsGenerationType
// NumValues: 0x0003
enum class EHairCardsGenerationType : uint8
{
	CardsCount                               = 0,
	UseGuides                                = 1,
	EHairCardsGenerationType_MAX             = 2,
};

// Enum HairStrandsCore.EHairCardsSourceType
// NumValues: 0x0003
enum class EHairCardsSourceType : uint8
{
	Procedural                               = 0,
	Imported                                 = 1,
	EHairCardsSourceType_MAX                 = 2,
};

// Enum HairStrandsCore.EHairInterpolationQuality
// NumValues: 0x0005
enum class EHairInterpolationQuality : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Unknown                                  = 3,
	EHairInterpolationQuality_MAX            = 4,
};

// Enum HairStrandsCore.EHairInterpolationWeight
// NumValues: 0x0005
enum class EHairInterpolationWeight : uint8
{
	Parametric                               = 0,
	Root                                     = 1,
	Index                                    = 2,
	Unknown                                  = 3,
	EHairInterpolationWeight_MAX             = 4,
};

// Enum HairStrandsCore.EGroomGeometryType
// NumValues: 0x0004
enum class EGroomGeometryType : uint8
{
	Strands                                  = 0,
	Cards                                    = 1,
	Meshes                                   = 2,
	EGroomGeometryType_MAX                   = 3,
};

// Enum HairStrandsCore.EGroomBindingType
// NumValues: 0x0004
enum class EGroomBindingType : uint8
{
	NoneBinding                              = 0,
	Rigid                                    = 1,
	Skinning                                 = 2,
	EGroomBindingType_MAX                    = 3,
};

// Enum HairStrandsCore.EGroomOverrideType
// NumValues: 0x0004
enum class EGroomOverrideType : uint8
{
	Auto                                     = 0,
	Enable                                   = 1,
	Disable                                  = 2,
	EGroomOverrideType_MAX                   = 3,
};

// Enum HairStrandsCore.EGroomNiagaraSolvers
// NumValues: 0x0005
enum class EGroomNiagaraSolvers : uint8
{
	None                                     = 0,
	CosseratRods                             = 2,
	AngularSprings                           = 4,
	CustomSolver                             = 8,
	EGroomNiagaraSolvers_MAX                 = 9,
};

// Enum HairStrandsCore.EGroomStrandsSize
// NumValues: 0x0007
enum class EGroomStrandsSize : uint8
{
	None                                     = 0,
	Size2                                    = 2,
	Size4                                    = 4,
	Size8                                    = 8,
	Size16                                   = 16,
	Size32                                   = 32,
	EGroomStrandsSize_MAX                    = 33,
};

// Enum HairStrandsCore.EGroomInterpolationType
// NumValues: 0x0005
enum class EGroomInterpolationType : uint8
{
	None                                     = 0,
	RigidTransform                           = 2,
	OffsetTransform                          = 4,
	SmoothTransform                          = 8,
	EGroomInterpolationType_MAX              = 9,
};

// Enum HairStrandsCore.EGroomBindingMeshType
// NumValues: 0x0003
enum class EGroomBindingMeshType : uint8
{
	SkeletalMesh                             = 0,
	GeometryCache                            = 1,
	EGroomBindingMeshType_MAX                = 2,
};

// Enum HairStrandsCore.EGroomCacheAttributes
// NumValues: 0x0009
enum class EGroomCacheAttributes : uint8
{
	None                                     = 0,
	Position                                 = 1,
	Width                                    = 2,
	Color                                    = 4,
	PositionWidth                            = 3,
	PositionColor                            = 5,
	WidthColor                               = 5,
	PositionWidthColor                       = 7,
	EGroomCacheAttributes_MAX                = 8,
};

// Enum HairStrandsCore.EGroomCacheType
// NumValues: 0x0004
enum class EGroomCacheType : uint8
{
	None                                     = 0,
	Strands                                  = 1,
	Guides                                   = 2,
	EGroomCacheType_MAX                      = 3,
};

// Enum HairStrandsCore.EFollicleMaskChannel
// NumValues: 0x0005
enum class EFollicleMaskChannel : uint8
{
	R                                        = 0,
	G                                        = 1,
	B                                        = 2,
	A                                        = 3,
	EFollicleMaskChannel_MAX                 = 4,
};

// Enum HairStrandsCore.EStrandsTexturesTraceType
// NumValues: 0x0004
enum class EStrandsTexturesTraceType : uint8
{
	TraceInside                              = 0,
	TraceOuside                              = 1,
	TraceBidirectional                       = 2,
	EStrandsTexturesTraceType_MAX            = 3,
};

// Enum HairStrandsCore.EStrandsTexturesMeshType
// NumValues: 0x0003
enum class EStrandsTexturesMeshType : uint8
{
	Static                                   = 0,
	Skeletal                                 = 1,
	EStrandsTexturesMeshType_MAX             = 2,
};

// Enum HairStrandsCore.EGroomInterpolationQuality
// NumValues: 0x0005
enum class EGroomInterpolationQuality : uint8
{
	Low                                      = 0,
	Medium                                   = 1,
	High                                     = 2,
	Unknown                                  = 3,
	EGroomInterpolationQuality_MAX           = 4,
};

// Enum HairStrandsCore.EGroomInterpolationWeight
// NumValues: 0x0005
enum class EGroomInterpolationWeight : uint8
{
	Parametric                               = 0,
	Root                                     = 1,
	Index                                    = 2,
	Unknown                                  = 3,
	EGroomInterpolationWeight_MAX            = 4,
};

// ScriptStruct HairStrandsCore.GroomBuildSettings
// 0x000C (0x000C - 0x0000)
struct FGroomBuildSettings final
{
public:
	bool                                          bOverrideGuides;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HairToGuideDensity;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationQuality                    InterpolationQuality;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomInterpolationWeight                     InterpolationDistance;                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomizeGuide;                                   // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUniqueGuide;                                   // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGroomBuildSettings) == 0x000004, "Wrong alignment on FGroomBuildSettings");
static_assert(sizeof(FGroomBuildSettings) == 0x00000C, "Wrong size on FGroomBuildSettings");
static_assert(offsetof(FGroomBuildSettings, bOverrideGuides) == 0x000000, "Member 'FGroomBuildSettings::bOverrideGuides' has a wrong offset!");
static_assert(offsetof(FGroomBuildSettings, HairToGuideDensity) == 0x000004, "Member 'FGroomBuildSettings::HairToGuideDensity' has a wrong offset!");
static_assert(offsetof(FGroomBuildSettings, InterpolationQuality) == 0x000008, "Member 'FGroomBuildSettings::InterpolationQuality' has a wrong offset!");
static_assert(offsetof(FGroomBuildSettings, InterpolationDistance) == 0x000009, "Member 'FGroomBuildSettings::InterpolationDistance' has a wrong offset!");
static_assert(offsetof(FGroomBuildSettings, bRandomizeGuide) == 0x00000A, "Member 'FGroomBuildSettings::bRandomizeGuide' has a wrong offset!");
static_assert(offsetof(FGroomBuildSettings, bUseUniqueGuide) == 0x00000B, "Member 'FGroomBuildSettings::bUseUniqueGuide' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupInfo
// 0x0024 (0x0024 - 0x0000)
struct FHairGroupInfo
{
public:
	int32                                         GroupId;                                           // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   GroupName;                                         // 0x0004(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCurves;                                         // 0x000C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumGuides;                                         // 0x0010(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCurveVertices;                                  // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumGuideVertices;                                  // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCurveLength;                                    // 0x001C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxImportedWidth;                                  // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupInfo) == 0x000004, "Wrong alignment on FHairGroupInfo");
static_assert(sizeof(FHairGroupInfo) == 0x000024, "Wrong size on FHairGroupInfo");
static_assert(offsetof(FHairGroupInfo, GroupId) == 0x000000, "Member 'FHairGroupInfo::GroupId' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, GroupName) == 0x000004, "Member 'FHairGroupInfo::GroupName' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, NumCurves) == 0x00000C, "Member 'FHairGroupInfo::NumCurves' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, NumGuides) == 0x000010, "Member 'FHairGroupInfo::NumGuides' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, NumCurveVertices) == 0x000014, "Member 'FHairGroupInfo::NumCurveVertices' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, NumGuideVertices) == 0x000018, "Member 'FHairGroupInfo::NumGuideVertices' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, MaxCurveLength) == 0x00001C, "Member 'FHairGroupInfo::MaxCurveLength' has a wrong offset!");
static_assert(offsetof(FHairGroupInfo, MaxImportedWidth) == 0x000020, "Member 'FHairGroupInfo::MaxImportedWidth' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsMaterial
// 0x0010 (0x0010 - 0x0000)
struct FHairGroupsMaterial final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SlotName;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsMaterial) == 0x000008, "Wrong alignment on FHairGroupsMaterial");
static_assert(sizeof(FHairGroupsMaterial) == 0x000010, "Wrong size on FHairGroupsMaterial");
static_assert(offsetof(FHairGroupsMaterial, Material) == 0x000000, "Member 'FHairGroupsMaterial::Material' has a wrong offset!");
static_assert(offsetof(FHairGroupsMaterial, SlotName) == 0x000008, "Member 'FHairGroupsMaterial::SlotName' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupInfoWithVisibility
// 0x0004 (0x0028 - 0x0024)
struct FHairGroupInfoWithVisibility final : public FHairGroupInfo
{
public:
	bool                                          bIsVisible;                                        // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHairGroupInfoWithVisibility) == 0x000004, "Wrong alignment on FHairGroupInfoWithVisibility");
static_assert(sizeof(FHairGroupInfoWithVisibility) == 0x000028, "Wrong size on FHairGroupInfoWithVisibility");
static_assert(offsetof(FHairGroupInfoWithVisibility, bIsVisible) == 0x000024, "Member 'FHairGroupInfoWithVisibility::bIsVisible' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairCardsClusterSettings
// 0x0008 (0x0008 - 0x0000)
struct FHairCardsClusterSettings final
{
public:
	float                                         ClusterDecimation;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHairCardsClusterType                         Type;                                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseGuide;                                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHairCardsClusterSettings) == 0x000004, "Wrong alignment on FHairCardsClusterSettings");
static_assert(sizeof(FHairCardsClusterSettings) == 0x000008, "Wrong size on FHairCardsClusterSettings");
static_assert(offsetof(FHairCardsClusterSettings, ClusterDecimation) == 0x000000, "Member 'FHairCardsClusterSettings::ClusterDecimation' has a wrong offset!");
static_assert(offsetof(FHairCardsClusterSettings, Type) == 0x000004, "Member 'FHairCardsClusterSettings::Type' has a wrong offset!");
static_assert(offsetof(FHairCardsClusterSettings, bUseGuide) == 0x000005, "Member 'FHairCardsClusterSettings::bUseGuide' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairCardsGeometrySettings
// 0x001C (0x001C - 0x0000)
struct FHairCardsGeometrySettings final
{
public:
	EHairCardsGenerationType                      GenerationType;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CardsCount;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHairCardsClusterType                         ClusterType;                                       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinSegmentLength;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularThreshold;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinCardsLength;                                    // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxCardsLength;                                    // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairCardsGeometrySettings) == 0x000004, "Wrong alignment on FHairCardsGeometrySettings");
static_assert(sizeof(FHairCardsGeometrySettings) == 0x00001C, "Wrong size on FHairCardsGeometrySettings");
static_assert(offsetof(FHairCardsGeometrySettings, GenerationType) == 0x000000, "Member 'FHairCardsGeometrySettings::GenerationType' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, CardsCount) == 0x000004, "Member 'FHairCardsGeometrySettings::CardsCount' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, ClusterType) == 0x000008, "Member 'FHairCardsGeometrySettings::ClusterType' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, MinSegmentLength) == 0x00000C, "Member 'FHairCardsGeometrySettings::MinSegmentLength' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, AngularThreshold) == 0x000010, "Member 'FHairCardsGeometrySettings::AngularThreshold' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, MinCardsLength) == 0x000014, "Member 'FHairCardsGeometrySettings::MinCardsLength' has a wrong offset!");
static_assert(offsetof(FHairCardsGeometrySettings, MaxCardsLength) == 0x000018, "Member 'FHairCardsGeometrySettings::MaxCardsLength' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairCardsTextureSettings
// 0x0010 (0x0010 - 0x0000)
struct FHairCardsTextureSettings final
{
public:
	int32                                         AtlasMaxResolution;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PixelPerCentimeters;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LengthTextureCount;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DensityTextureCount;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairCardsTextureSettings) == 0x000004, "Wrong alignment on FHairCardsTextureSettings");
static_assert(sizeof(FHairCardsTextureSettings) == 0x000010, "Wrong size on FHairCardsTextureSettings");
static_assert(offsetof(FHairCardsTextureSettings, AtlasMaxResolution) == 0x000000, "Member 'FHairCardsTextureSettings::AtlasMaxResolution' has a wrong offset!");
static_assert(offsetof(FHairCardsTextureSettings, PixelPerCentimeters) == 0x000004, "Member 'FHairCardsTextureSettings::PixelPerCentimeters' has a wrong offset!");
static_assert(offsetof(FHairCardsTextureSettings, LengthTextureCount) == 0x000008, "Member 'FHairCardsTextureSettings::LengthTextureCount' has a wrong offset!");
static_assert(offsetof(FHairCardsTextureSettings, DensityTextureCount) == 0x00000C, "Member 'FHairCardsTextureSettings::DensityTextureCount' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsProceduralCards
// 0x0038 (0x0038 - 0x0000)
struct FHairGroupsProceduralCards final
{
public:
	struct FHairCardsClusterSettings              ClusterSettings;                                   // 0x0000(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FHairCardsGeometrySettings             GeometrySettings;                                  // 0x0008(0x001C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHairCardsTextureSettings              TextureSettings;                                   // 0x0024(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Version;                                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsProceduralCards) == 0x000004, "Wrong alignment on FHairGroupsProceduralCards");
static_assert(sizeof(FHairGroupsProceduralCards) == 0x000038, "Wrong size on FHairGroupsProceduralCards");
static_assert(offsetof(FHairGroupsProceduralCards, ClusterSettings) == 0x000000, "Member 'FHairGroupsProceduralCards::ClusterSettings' has a wrong offset!");
static_assert(offsetof(FHairGroupsProceduralCards, GeometrySettings) == 0x000008, "Member 'FHairGroupsProceduralCards::GeometrySettings' has a wrong offset!");
static_assert(offsetof(FHairGroupsProceduralCards, TextureSettings) == 0x000024, "Member 'FHairGroupsProceduralCards::TextureSettings' has a wrong offset!");
static_assert(offsetof(FHairGroupsProceduralCards, Version) == 0x000034, "Member 'FHairGroupsProceduralCards::Version' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupCardsInfo
// 0x0008 (0x0008 - 0x0000)
struct FHairGroupCardsInfo final
{
public:
	int32                                         NumCards;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCardVertices;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupCardsInfo) == 0x000004, "Wrong alignment on FHairGroupCardsInfo");
static_assert(sizeof(FHairGroupCardsInfo) == 0x000008, "Wrong size on FHairGroupCardsInfo");
static_assert(offsetof(FHairGroupCardsInfo, NumCards) == 0x000000, "Member 'FHairGroupCardsInfo::NumCards' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsInfo, NumCardVertices) == 0x000004, "Member 'FHairGroupCardsInfo::NumCardVertices' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupCardsTextures
// 0x0038 (0x0038 - 0x0000)
struct FHairGroupCardsTextures final
{
public:
	class UTexture2D*                             DepthTexture;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             CoverageTexture;                                   // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             TangentTexture;                                    // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             AttributeTexture;                                  // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             AuxilaryDataTexture;                               // 0x0020(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             MaterialTexture;                                   // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHairGroupCardsTextures) == 0x000008, "Wrong alignment on FHairGroupCardsTextures");
static_assert(sizeof(FHairGroupCardsTextures) == 0x000038, "Wrong size on FHairGroupCardsTextures");
static_assert(offsetof(FHairGroupCardsTextures, DepthTexture) == 0x000000, "Member 'FHairGroupCardsTextures::DepthTexture' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsTextures, CoverageTexture) == 0x000008, "Member 'FHairGroupCardsTextures::CoverageTexture' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsTextures, TangentTexture) == 0x000010, "Member 'FHairGroupCardsTextures::TangentTexture' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsTextures, AttributeTexture) == 0x000018, "Member 'FHairGroupCardsTextures::AttributeTexture' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsTextures, AuxilaryDataTexture) == 0x000020, "Member 'FHairGroupCardsTextures::AuxilaryDataTexture' has a wrong offset!");
static_assert(offsetof(FHairGroupCardsTextures, MaterialTexture) == 0x000028, "Member 'FHairGroupCardsTextures::MaterialTexture' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsCardsSourceDescription
// 0x00C8 (0x00C8 - 0x0000)
struct FHairGroupsCardsSourceDescription final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialSlotName;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHairCardsSourceType                          SourceType;                                        // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            ProceduralMesh;                                    // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProceduralMeshKey;                                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ImportedMesh;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHairGroupsProceduralCards             ProceduralSettings;                                // 0x0038(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHairGroupCardsTextures                Textures;                                          // 0x0070(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GroupIndex;                                        // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHairGroupCardsInfo                    CardsInfo;                                         // 0x00B0(0x0008)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ImportedMeshKey;                                   // 0x00B8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsCardsSourceDescription) == 0x000008, "Wrong alignment on FHairGroupsCardsSourceDescription");
static_assert(sizeof(FHairGroupsCardsSourceDescription) == 0x0000C8, "Wrong size on FHairGroupsCardsSourceDescription");
static_assert(offsetof(FHairGroupsCardsSourceDescription, Material) == 0x000000, "Member 'FHairGroupsCardsSourceDescription::Material' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, MaterialSlotName) == 0x000008, "Member 'FHairGroupsCardsSourceDescription::MaterialSlotName' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, SourceType) == 0x000010, "Member 'FHairGroupsCardsSourceDescription::SourceType' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, ProceduralMesh) == 0x000018, "Member 'FHairGroupsCardsSourceDescription::ProceduralMesh' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, ProceduralMeshKey) == 0x000020, "Member 'FHairGroupsCardsSourceDescription::ProceduralMeshKey' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, ImportedMesh) == 0x000030, "Member 'FHairGroupsCardsSourceDescription::ImportedMesh' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, ProceduralSettings) == 0x000038, "Member 'FHairGroupsCardsSourceDescription::ProceduralSettings' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, Textures) == 0x000070, "Member 'FHairGroupsCardsSourceDescription::Textures' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, GroupIndex) == 0x0000A8, "Member 'FHairGroupsCardsSourceDescription::GroupIndex' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, LODIndex) == 0x0000AC, "Member 'FHairGroupsCardsSourceDescription::LODIndex' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, CardsInfo) == 0x0000B0, "Member 'FHairGroupsCardsSourceDescription::CardsInfo' has a wrong offset!");
static_assert(offsetof(FHairGroupsCardsSourceDescription, ImportedMeshKey) == 0x0000B8, "Member 'FHairGroupsCardsSourceDescription::ImportedMeshKey' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairLODSettings
// 0x001C (0x001C - 0x0000)
struct FHairLODSettings final
{
public:
	float                                         CurveDecimation;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VertexDecimation;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngularThreshold;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenSize;                                        // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThicknessScale;                                    // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVisible;                                          // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomGeometryType                            GeometryType;                                      // 0x0015(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomBindingType                             BindingType;                                       // 0x0016(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomOverrideType                            Simulation;                                        // 0x0017(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomOverrideType                            GlobalInterpolation;                               // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHairLODSettings) == 0x000004, "Wrong alignment on FHairLODSettings");
static_assert(sizeof(FHairLODSettings) == 0x00001C, "Wrong size on FHairLODSettings");
static_assert(offsetof(FHairLODSettings, CurveDecimation) == 0x000000, "Member 'FHairLODSettings::CurveDecimation' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, VertexDecimation) == 0x000004, "Member 'FHairLODSettings::VertexDecimation' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, AngularThreshold) == 0x000008, "Member 'FHairLODSettings::AngularThreshold' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, ScreenSize) == 0x00000C, "Member 'FHairLODSettings::ScreenSize' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, ThicknessScale) == 0x000010, "Member 'FHairLODSettings::ThicknessScale' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, bVisible) == 0x000014, "Member 'FHairLODSettings::bVisible' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, GeometryType) == 0x000015, "Member 'FHairLODSettings::GeometryType' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, BindingType) == 0x000016, "Member 'FHairLODSettings::BindingType' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, Simulation) == 0x000017, "Member 'FHairLODSettings::Simulation' has a wrong offset!");
static_assert(offsetof(FHairLODSettings, GlobalInterpolation) == 0x000018, "Member 'FHairLODSettings::GlobalInterpolation' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairDecimationSettings
// 0x0008 (0x0008 - 0x0000)
struct FHairDecimationSettings final
{
public:
	float                                         CurveDecimation;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VertexDecimation;                                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairDecimationSettings) == 0x000004, "Wrong alignment on FHairDecimationSettings");
static_assert(sizeof(FHairDecimationSettings) == 0x000008, "Wrong size on FHairDecimationSettings");
static_assert(offsetof(FHairDecimationSettings, CurveDecimation) == 0x000000, "Member 'FHairDecimationSettings::CurveDecimation' has a wrong offset!");
static_assert(offsetof(FHairDecimationSettings, VertexDecimation) == 0x000004, "Member 'FHairDecimationSettings::VertexDecimation' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairInterpolationSettings
// 0x000C (0x000C - 0x0000)
struct FHairInterpolationSettings final
{
public:
	bool                                          bOverrideGuides;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HairToGuideDensity;                                // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHairInterpolationQuality                     InterpolationQuality;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHairInterpolationWeight                      InterpolationDistance;                             // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRandomizeGuide;                                   // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseUniqueGuide;                                   // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairInterpolationSettings) == 0x000004, "Wrong alignment on FHairInterpolationSettings");
static_assert(sizeof(FHairInterpolationSettings) == 0x00000C, "Wrong size on FHairInterpolationSettings");
static_assert(offsetof(FHairInterpolationSettings, bOverrideGuides) == 0x000000, "Member 'FHairInterpolationSettings::bOverrideGuides' has a wrong offset!");
static_assert(offsetof(FHairInterpolationSettings, HairToGuideDensity) == 0x000004, "Member 'FHairInterpolationSettings::HairToGuideDensity' has a wrong offset!");
static_assert(offsetof(FHairInterpolationSettings, InterpolationQuality) == 0x000008, "Member 'FHairInterpolationSettings::InterpolationQuality' has a wrong offset!");
static_assert(offsetof(FHairInterpolationSettings, InterpolationDistance) == 0x000009, "Member 'FHairInterpolationSettings::InterpolationDistance' has a wrong offset!");
static_assert(offsetof(FHairInterpolationSettings, bRandomizeGuide) == 0x00000A, "Member 'FHairInterpolationSettings::bRandomizeGuide' has a wrong offset!");
static_assert(offsetof(FHairInterpolationSettings, bUseUniqueGuide) == 0x00000B, "Member 'FHairInterpolationSettings::bUseUniqueGuide' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsInterpolation
// 0x0014 (0x0014 - 0x0000)
struct FHairGroupsInterpolation final
{
public:
	struct FHairDecimationSettings                DecimationSettings;                                // 0x0000(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FHairInterpolationSettings             InterpolationSettings;                             // 0x0008(0x000C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsInterpolation) == 0x000004, "Wrong alignment on FHairGroupsInterpolation");
static_assert(sizeof(FHairGroupsInterpolation) == 0x000014, "Wrong size on FHairGroupsInterpolation");
static_assert(offsetof(FHairGroupsInterpolation, DecimationSettings) == 0x000000, "Member 'FHairGroupsInterpolation::DecimationSettings' has a wrong offset!");
static_assert(offsetof(FHairGroupsInterpolation, InterpolationSettings) == 0x000008, "Member 'FHairGroupsInterpolation::InterpolationSettings' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsLOD
// 0x0018 (0x0018 - 0x0000)
struct FHairGroupsLOD final
{
public:
	TArray<struct FHairLODSettings>               LODs;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ClusterWorldSize;                                  // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClusterScreenSizeScale;                            // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsLOD) == 0x000008, "Wrong alignment on FHairGroupsLOD");
static_assert(sizeof(FHairGroupsLOD) == 0x000018, "Wrong size on FHairGroupsLOD");
static_assert(offsetof(FHairGroupsLOD, LODs) == 0x000000, "Member 'FHairGroupsLOD::LODs' has a wrong offset!");
static_assert(offsetof(FHairGroupsLOD, ClusterWorldSize) == 0x000010, "Member 'FHairGroupsLOD::ClusterWorldSize' has a wrong offset!");
static_assert(offsetof(FHairGroupsLOD, ClusterScreenSizeScale) == 0x000014, "Member 'FHairGroupsLOD::ClusterScreenSizeScale' has a wrong offset!");

// ScriptStruct HairStrandsCore.GroomAnimationInfo
// 0x0020 (0x0020 - 0x0000)
struct FGroomAnimationInfo final
{
public:
	uint32                                        NumFrames;                                         // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondsPerFrame;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartTime;                                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndTime;                                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StartFrame;                                        // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndFrame;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomCacheAttributes                         Attributes;                                        // 0x001C(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGroomAnimationInfo) == 0x000004, "Wrong alignment on FGroomAnimationInfo");
static_assert(sizeof(FGroomAnimationInfo) == 0x000020, "Wrong size on FGroomAnimationInfo");
static_assert(offsetof(FGroomAnimationInfo, NumFrames) == 0x000000, "Member 'FGroomAnimationInfo::NumFrames' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, SecondsPerFrame) == 0x000004, "Member 'FGroomAnimationInfo::SecondsPerFrame' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, Duration) == 0x000008, "Member 'FGroomAnimationInfo::Duration' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, StartTime) == 0x00000C, "Member 'FGroomAnimationInfo::StartTime' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, EndTime) == 0x000010, "Member 'FGroomAnimationInfo::EndTime' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, StartFrame) == 0x000014, "Member 'FGroomAnimationInfo::StartFrame' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, EndFrame) == 0x000018, "Member 'FGroomAnimationInfo::EndFrame' has a wrong offset!");
static_assert(offsetof(FGroomAnimationInfo, Attributes) == 0x00001C, "Member 'FGroomAnimationInfo::Attributes' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairGroupsMeshesSourceDescription
// 0x0068 (0x0068 - 0x0000)
struct FHairGroupsMeshesSourceDescription final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialSlotName;                                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            ImportedMesh;                                      // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHairGroupCardsTextures                Textures;                                          // 0x0018(0x0038)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         GroupIndex;                                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LODIndex;                                          // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImportedMeshKey;                                   // 0x0058(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairGroupsMeshesSourceDescription) == 0x000008, "Wrong alignment on FHairGroupsMeshesSourceDescription");
static_assert(sizeof(FHairGroupsMeshesSourceDescription) == 0x000068, "Wrong size on FHairGroupsMeshesSourceDescription");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, Material) == 0x000000, "Member 'FHairGroupsMeshesSourceDescription::Material' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, MaterialSlotName) == 0x000008, "Member 'FHairGroupsMeshesSourceDescription::MaterialSlotName' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, ImportedMesh) == 0x000010, "Member 'FHairGroupsMeshesSourceDescription::ImportedMesh' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, Textures) == 0x000018, "Member 'FHairGroupsMeshesSourceDescription::Textures' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, GroupIndex) == 0x000050, "Member 'FHairGroupsMeshesSourceDescription::GroupIndex' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, LODIndex) == 0x000054, "Member 'FHairGroupsMeshesSourceDescription::LODIndex' has a wrong offset!");
static_assert(offsetof(FHairGroupsMeshesSourceDescription, ImportedMeshKey) == 0x000058, "Member 'FHairGroupsMeshesSourceDescription::ImportedMeshKey' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairSolverSettings
// 0x0038 (0x0038 - 0x0000)
struct FHairSolverSettings final
{
public:
	bool                                          EnableSimulation;                                  // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroomNiagaraSolvers                          NiagaraSolver;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraSystem>          CustomSystem;                                      // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SubSteps;                                          // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IterationCount;                                    // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairSolverSettings) == 0x000008, "Wrong alignment on FHairSolverSettings");
static_assert(sizeof(FHairSolverSettings) == 0x000038, "Wrong size on FHairSolverSettings");
static_assert(offsetof(FHairSolverSettings, EnableSimulation) == 0x000000, "Member 'FHairSolverSettings::EnableSimulation' has a wrong offset!");
static_assert(offsetof(FHairSolverSettings, NiagaraSolver) == 0x000001, "Member 'FHairSolverSettings::NiagaraSolver' has a wrong offset!");
static_assert(offsetof(FHairSolverSettings, CustomSystem) == 0x000008, "Member 'FHairSolverSettings::CustomSystem' has a wrong offset!");
static_assert(offsetof(FHairSolverSettings, SubSteps) == 0x000030, "Member 'FHairSolverSettings::SubSteps' has a wrong offset!");
static_assert(offsetof(FHairSolverSettings, IterationCount) == 0x000034, "Member 'FHairSolverSettings::IterationCount' has a wrong offset!");

// ScriptStruct HairStrandsCore.GroomConversionSettings
// 0x0030 (0x0030 - 0x0000)
struct FGroomConversionSettings final
{
public:
	struct FVector                                Rotation;                                          // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGroomConversionSettings) == 0x000008, "Wrong alignment on FGroomConversionSettings");
static_assert(sizeof(FGroomConversionSettings) == 0x000030, "Wrong size on FGroomConversionSettings");
static_assert(offsetof(FGroomConversionSettings, Rotation) == 0x000000, "Member 'FGroomConversionSettings::Rotation' has a wrong offset!");
static_assert(offsetof(FGroomConversionSettings, Scale) == 0x000018, "Member 'FGroomConversionSettings::Scale' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairExternalForces
// 0x0038 (0x0038 - 0x0000)
struct FHairExternalForces final
{
public:
	struct FVector                                GravityVector;                                     // 0x0000(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AirDrag;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AirVelocity;                                       // 0x0020(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairExternalForces) == 0x000008, "Wrong alignment on FHairExternalForces");
static_assert(sizeof(FHairExternalForces) == 0x000038, "Wrong size on FHairExternalForces");
static_assert(offsetof(FHairExternalForces, GravityVector) == 0x000000, "Member 'FHairExternalForces::GravityVector' has a wrong offset!");
static_assert(offsetof(FHairExternalForces, AirDrag) == 0x000018, "Member 'FHairExternalForces::AirDrag' has a wrong offset!");
static_assert(offsetof(FHairExternalForces, AirVelocity) == 0x000020, "Member 'FHairExternalForces::AirVelocity' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairBendConstraint
// 0x0098 (0x0098 - 0x0000)
struct FHairBendConstraint final
{
public:
	bool                                          SolveBend;                                         // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ProjectBend;                                       // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BendDamping;                                       // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BendStiffness;                                     // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     BendScale;                                         // 0x0010(0x0088)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairBendConstraint) == 0x000008, "Wrong alignment on FHairBendConstraint");
static_assert(sizeof(FHairBendConstraint) == 0x000098, "Wrong size on FHairBendConstraint");
static_assert(offsetof(FHairBendConstraint, SolveBend) == 0x000000, "Member 'FHairBendConstraint::SolveBend' has a wrong offset!");
static_assert(offsetof(FHairBendConstraint, ProjectBend) == 0x000001, "Member 'FHairBendConstraint::ProjectBend' has a wrong offset!");
static_assert(offsetof(FHairBendConstraint, BendDamping) == 0x000004, "Member 'FHairBendConstraint::BendDamping' has a wrong offset!");
static_assert(offsetof(FHairBendConstraint, BendStiffness) == 0x000008, "Member 'FHairBendConstraint::BendStiffness' has a wrong offset!");
static_assert(offsetof(FHairBendConstraint, BendScale) == 0x000010, "Member 'FHairBendConstraint::BendScale' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairStretchConstraint
// 0x0098 (0x0098 - 0x0000)
struct FHairStretchConstraint final
{
public:
	bool                                          SolveStretch;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ProjectStretch;                                    // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StretchDamping;                                    // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StretchStiffness;                                  // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     StretchScale;                                      // 0x0010(0x0088)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHairStretchConstraint) == 0x000008, "Wrong alignment on FHairStretchConstraint");
static_assert(sizeof(FHairStretchConstraint) == 0x000098, "Wrong size on FHairStretchConstraint");
static_assert(offsetof(FHairStretchConstraint, SolveStretch) == 0x000000, "Member 'FHairStretchConstraint::SolveStretch' has a wrong offset!");
static_assert(offsetof(FHairStretchConstraint, ProjectStretch) == 0x000001, "Member 'FHairStretchConstraint::ProjectStretch' has a wrong offset!");
static_assert(offsetof(FHairStretchConstraint, StretchDamping) == 0x000004, "Member 'FHairStretchConstraint::StretchDamping' has a wrong offset!");
static_assert(offsetof(FHairStretchConstraint, StretchStiffness) == 0x000008, "Member 'FHairStretchConstraint::StretchStiffness' has a wrong offset!");
static_assert(offsetof(FHairStretchConstraint, StretchScale) == 0x000010, "Member 'FHairStretchConstraint::StretchScale' has a wrong offset!");

// ScriptStruct HairStrandsCore.FollicleMaskOptions
// 0x0010 (0x0010 - 0x0000)
struct FFollicleMaskOptions final
{
public:
	class UGroomAsset*                            Groom;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFollicleMaskChannel                          Channel;                                           // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFollicleMaskOptions) == 0x000008, "Wrong alignment on FFollicleMaskOptions");
static_assert(sizeof(FFollicleMaskOptions) == 0x000010, "Wrong size on FFollicleMaskOptions");
static_assert(offsetof(FFollicleMaskOptions, Groom) == 0x000000, "Member 'FFollicleMaskOptions::Groom' has a wrong offset!");
static_assert(offsetof(FFollicleMaskOptions, Channel) == 0x000008, "Member 'FFollicleMaskOptions::Channel' has a wrong offset!");

// ScriptStruct HairStrandsCore.HairCollisionConstraint
// 0x00A8 (0x00A8 - 0x0000)
struct FHairCollisionConstraint final
{
public:
	bool                                          SolveCollision;                                    // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
