#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HeadMountedDisplay

#include "Basic.hpp"

#include "HeadMountedDisplay_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.BreakKey
// 0x0058 (0x0058 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_BreakKey final
{
public:
	struct FKey                                   InKey;                                             // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InteractionProfile;                                // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControllerHand                               Hand;                                              // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MotionSource;                                      // 0x002C(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Indentifier;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Component;                                         // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_BreakKey) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_BreakKey");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_BreakKey) == 0x000058, "Wrong size on HeadMountedDisplayFunctionLibrary_BreakKey");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, InKey) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::InKey' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, InteractionProfile) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::InteractionProfile' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, Hand) == 0x000028, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::Hand' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, MotionSource) == 0x00002C, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::MotionSource' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, Indentifier) == 0x000038, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::Indentifier' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_BreakKey, Component) == 0x000048, "Member 'HeadMountedDisplayFunctionLibrary_BreakKey::Component' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.CalibrateExternalTrackingToHMD
// 0x0060 (0x0060 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD final
{
public:
	struct FTransform                             ExternalTrackingTransform;                         // 0x0000(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD) == 0x000010, "Wrong alignment on HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD) == 0x000060, "Wrong size on HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD, ExternalTrackingTransform) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_CalibrateExternalTrackingToHMD::ExternalTrackingTransform' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.ClearXRTimedInputActionDelegate
// 0x0008 (0x0008 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate final
{
public:
	class FName                                   ActionPath;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate) == 0x000008, "Wrong size on HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate, ActionPath) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_ClearXRTimedInputActionDelegate::ActionPath' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.ConfigureGestures
// 0x0007 (0x0007 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_ConfigureGestures final
{
public:
	struct FXRGestureConfig                       GestureConfig;                                     // 0x0000(0x0006)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_ConfigureGestures) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_ConfigureGestures");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_ConfigureGestures) == 0x000007, "Wrong size on HeadMountedDisplayFunctionLibrary_ConfigureGestures");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ConfigureGestures, GestureConfig) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_ConfigureGestures::GestureConfig' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ConfigureGestures, ReturnValue) == 0x000006, "Member 'HeadMountedDisplayFunctionLibrary_ConfigureGestures::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.ConnectRemoteXRDevice
// 0x0018 (0x0018 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice final
{
public:
	class FString                                 IPAddress;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BitRate;                                           // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXRDeviceConnectionResult                     ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice) == 0x000018, "Wrong size on HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice, IPAddress) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice::IPAddress' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice, BitRate) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice::BitRate' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice, ReturnValue) == 0x000014, "Member 'HeadMountedDisplayFunctionLibrary_ConnectRemoteXRDevice::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.EnableHMD
// 0x0002 (0x0002 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_EnableHMD final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_EnableHMD) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_EnableHMD");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_EnableHMD) == 0x000002, "Wrong size on HeadMountedDisplayFunctionLibrary_EnableHMD");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnableHMD, bEnable) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_EnableHMD::bEnable' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnableHMD, ReturnValue) == 0x000001, "Member 'HeadMountedDisplayFunctionLibrary_EnableHMD::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.EnableLowPersistenceMode
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode, bEnable) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_EnableLowPersistenceMode::bEnable' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.EnumerateTrackedDevices
// 0x0020 (0x0020 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices final
{
public:
	class FName                                   SystemId;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXRTrackedDeviceType                          DeviceType;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FXRDeviceId>                    ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices) == 0x000020, "Wrong size on HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices, SystemId) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices::SystemId' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices, DeviceType) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices::DeviceType' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices, ReturnValue) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_EnumerateTrackedDevices::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetControllerTransformForTime
// 0x00C0 (0x00C0 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ControllerIndex;                                   // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MotionSource;                                      // 0x000C(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              Time;                                              // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTimeWasUsed;                                      // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Orientation;                                       // 0x0028(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Position;                                          // 0x0040(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvidedLinearVelocity;                           // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearVelocity;                                    // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvidedAngularVelocity;                          // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                AngularVelocityRadPerSec;                          // 0x0080(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProvidedLinearAcceleration;                       // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LinearAcceleration;                                // 0x00A0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00B8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime) == 0x0000C0, "Wrong size on HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, ControllerIndex) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::ControllerIndex' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, MotionSource) == 0x00000C, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::MotionSource' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, Time) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::Time' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, bTimeWasUsed) == 0x000020, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::bTimeWasUsed' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, Orientation) == 0x000028, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::Orientation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, Position) == 0x000040, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::Position' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, bProvidedLinearVelocity) == 0x000058, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::bProvidedLinearVelocity' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, LinearVelocity) == 0x000060, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::LinearVelocity' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, bProvidedAngularVelocity) == 0x000078, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::bProvidedAngularVelocity' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, AngularVelocityRadPerSec) == 0x000080, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::AngularVelocityRadPerSec' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, bProvidedLinearAcceleration) == 0x000098, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::bProvidedLinearAcceleration' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, LinearAcceleration) == 0x0000A0, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::LinearAcceleration' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime, ReturnValue) == 0x0000B8, "Member 'HeadMountedDisplayFunctionLibrary_GetControllerTransformForTime::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetDevicePose
// 0x0048 (0x0048 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetDevicePose final
{
public:
	struct FXRDeviceId                            XRDeviceId;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsTracked;                                        // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Orientation;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasPositionalTracking;                            // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetDevicePose) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetDevicePose");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetDevicePose) == 0x000048, "Wrong size on HeadMountedDisplayFunctionLibrary_GetDevicePose");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDevicePose, XRDeviceId) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetDevicePose::XRDeviceId' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDevicePose, bIsTracked) == 0x00000C, "Member 'HeadMountedDisplayFunctionLibrary_GetDevicePose::bIsTracked' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDevicePose, Orientation) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_GetDevicePose::Orientation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDevicePose, bHasPositionalTracking) == 0x000028, "Member 'HeadMountedDisplayFunctionLibrary_GetDevicePose::bHasPositionalTracking' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDevicePose, Position) == 0x000030, "Member 'HeadMountedDisplayFunctionLibrary_GetDevicePose::Position' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetDeviceWorldPose
// 0x0050 (0x0050 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FXRDeviceId                            XRDeviceId;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsTracked;                                        // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Orientation;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bHasPositionalTracking;                            // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Position;                                          // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose) == 0x000050, "Wrong size on HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, XRDeviceId) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::XRDeviceId' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, bIsTracked) == 0x000014, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::bIsTracked' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, Orientation) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::Orientation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, bHasPositionalTracking) == 0x000030, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::bHasPositionalTracking' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose, Position) == 0x000038, "Member 'HeadMountedDisplayFunctionLibrary_GetDeviceWorldPose::Position' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetHMDData
// 0x0070 (0x0070 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetHMDData final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FXRHMDData                             HMDData;                                           // 0x0010(0x0060)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetHMDData) == 0x000010, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetHMDData");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetHMDData) == 0x000070, "Wrong size on HeadMountedDisplayFunctionLibrary_GetHMDData");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetHMDData, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetHMDData::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetHMDData, HMDData) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_GetHMDData::HMDData' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetHMDDeviceName
// 0x0008 (0x0008 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetHMDDeviceName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetHMDDeviceName) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetHMDDeviceName");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetHMDDeviceName) == 0x000008, "Wrong size on HeadMountedDisplayFunctionLibrary_GetHMDDeviceName");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetHMDDeviceName, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetHMDDeviceName::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetHMDWornState
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetHMDWornState final
{
public:
	EHMDWornState                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetHMDWornState) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetHMDWornState");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetHMDWornState) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_GetHMDWornState");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetHMDWornState, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetHMDWornState::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetMotionControllerData
// 0x00F0 (0x00F0 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetMotionControllerData final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EControllerHand                               Hand;                                              // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FXRMotionControllerData                MotionControllerData;                              // 0x0010(0x00E0)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetMotionControllerData) == 0x000010, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetMotionControllerData");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetMotionControllerData) == 0x0000F0, "Wrong size on HeadMountedDisplayFunctionLibrary_GetMotionControllerData");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetMotionControllerData, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetMotionControllerData::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetMotionControllerData, Hand) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_GetMotionControllerData::Hand' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetMotionControllerData, MotionControllerData) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_GetMotionControllerData::MotionControllerData' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetNumOfTrackingSensors
// 0x0004 (0x0004 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors) == 0x000004, "Wrong size on HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetNumOfTrackingSensors::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetOrientationAndPosition
// 0x0030 (0x0030 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition final
{
public:
	struct FRotator                               DeviceRotation;                                    // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                DevicePosition;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition) == 0x000030, "Wrong size on HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition, DeviceRotation) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition::DeviceRotation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition, DevicePosition) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_GetOrientationAndPosition::DevicePosition' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetPixelDensity
// 0x0004 (0x0004 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetPixelDensity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetPixelDensity) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetPixelDensity");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetPixelDensity) == 0x000004, "Wrong size on HeadMountedDisplayFunctionLibrary_GetPixelDensity");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPixelDensity, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetPixelDensity::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetPlayAreaBounds
// 0x0018 (0x0018 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds final
{
public:
	EHMDTrackingOrigin                            Origin;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds) == 0x000018, "Wrong size on HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds, Origin) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds::Origin' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds, ReturnValue) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_GetPlayAreaBounds::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetPositionalTrackingCameraParameters
// 0x0048 (0x0048 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters final
{
public:
	struct FVector                                CameraOrigin;                                      // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         HFOV;                                              // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VFOV;                                              // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraDistance;                                    // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearPlane;                                         // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarPlane;                                          // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters) == 0x000048, "Wrong size on HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, CameraOrigin) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::CameraOrigin' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, CameraRotation) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::CameraRotation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, HFOV) == 0x000030, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::HFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, VFOV) == 0x000034, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::VFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, CameraDistance) == 0x000038, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::CameraDistance' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, NearPlane) == 0x00003C, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::NearPlane' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters, FarPlane) == 0x000040, "Member 'HeadMountedDisplayFunctionLibrary_GetPositionalTrackingCameraParameters::FarPlane' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetScreenPercentage
// 0x0004 (0x0004 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetScreenPercentage final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetScreenPercentage) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetScreenPercentage");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetScreenPercentage) == 0x000004, "Wrong size on HeadMountedDisplayFunctionLibrary_GetScreenPercentage");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetScreenPercentage, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetScreenPercentage::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetTrackingOrigin
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetTrackingOrigin final
{
public:
	EHMDTrackingOrigin                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetTrackingOrigin) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetTrackingOrigin");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetTrackingOrigin) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_GetTrackingOrigin");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingOrigin, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingOrigin::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetTrackingSensorParameters
// 0x0058 (0x0058 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         LeftFOV;                                           // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightFOV;                                          // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TopFOV;                                            // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BottomFOV;                                         // 0x003C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0040(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NearPlane;                                         // 0x0044(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FarPlane;                                          // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsActive;                                          // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters) == 0x000058, "Wrong size on HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, Origin) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::Origin' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, Rotation) == 0x000018, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::Rotation' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, LeftFOV) == 0x000030, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::LeftFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, RightFOV) == 0x000034, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::RightFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, TopFOV) == 0x000038, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::TopFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, BottomFOV) == 0x00003C, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::BottomFOV' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, Distance) == 0x000040, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::Distance' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, NearPlane) == 0x000044, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::NearPlane' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, FarPlane) == 0x000048, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::FarPlane' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, IsActive) == 0x00004C, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::IsActive' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters, Index_0) == 0x000050, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingSensorParameters::Index_0' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetTrackingToWorldTransform
// 0x0070 (0x0070 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform) == 0x000010, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform) == 0x000070, "Wrong size on HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform, ReturnValue) == 0x000010, "Member 'HeadMountedDisplayFunctionLibrary_GetTrackingToWorldTransform::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetVersionString
// 0x0010 (0x0010 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetVersionString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetVersionString) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetVersionString");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetVersionString) == 0x000010, "Wrong size on HeadMountedDisplayFunctionLibrary_GetVersionString");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetVersionString, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetVersionString::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetVRFocusState
// 0x0002 (0x0002 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetVRFocusState final
{
public:
	bool                                          bUseFocus;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasFocus;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetVRFocusState) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetVRFocusState");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetVRFocusState) == 0x000002, "Wrong size on HeadMountedDisplayFunctionLibrary_GetVRFocusState");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetVRFocusState, bUseFocus) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetVRFocusState::bUseFocus' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetVRFocusState, bHasFocus) == 0x000001, "Member 'HeadMountedDisplayFunctionLibrary_GetVRFocusState::bHasFocus' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetWorldToMetersScale
// 0x0010 (0x0010 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale final
{
public:
	class UObject*                                WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale) == 0x000008, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale) == 0x000010, "Wrong size on HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale, WorldContext) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale::WorldContext' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale, ReturnValue) == 0x000008, "Member 'HeadMountedDisplayFunctionLibrary_GetWorldToMetersScale::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.GetXRSystemFlags
// 0x0004 (0x0004 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_GetXRSystemFlags final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_GetXRSystemFlags) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_GetXRSystemFlags");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_GetXRSystemFlags) == 0x000004, "Wrong size on HeadMountedDisplayFunctionLibrary_GetXRSystemFlags");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_GetXRSystemFlags, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_GetXRSystemFlags::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.HasValidTrackingPosition
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_HasValidTrackingPosition::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.IsDeviceTracking
// 0x0010 (0x0010 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_IsDeviceTracking final
{
public:
	struct FXRDeviceId                            XRDeviceId;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_IsDeviceTracking) == 0x000004, "Wrong alignment on HeadMountedDisplayFunctionLibrary_IsDeviceTracking");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_IsDeviceTracking) == 0x000010, "Wrong size on HeadMountedDisplayFunctionLibrary_IsDeviceTracking");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_IsDeviceTracking, XRDeviceId) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_IsDeviceTracking::XRDeviceId' has a wrong offset!");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_IsDeviceTracking, ReturnValue) == 0x00000C, "Member 'HeadMountedDisplayFunctionLibrary_IsDeviceTracking::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.IsHeadMountedDisplayConnected
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected");
static_assert(offsetof(HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected, ReturnValue) == 0x000000, "Member 'HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayConnected::ReturnValue' has a wrong offset!");

// Function HeadMountedDisplay.HeadMountedDisplayFunctionLibrary.IsHeadMountedDisplayEnabled
// 0x0001 (0x0001 - 0x0000)
struct HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayEnabled) == 0x000001, "Wrong alignment on HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayEnabled");
static_assert(sizeof(HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayEnabled) == 0x000001, "Wrong size on HeadMountedDisplayFunctionLibrary_IsHeadMountedDisplayEnabled");
