#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "HoudiniEngineRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class HoudiniEngineRuntime.HoudiniParameter
// 0x00E0 (0x0108 - 0x0028)
class UHoudiniParameter : public UObject
{
public:
	class FString                                 Name_0;                                            // 0x0028(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Label;                                             // 0x0038(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniParameterType                         ParmType;                                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        TupleSize;                                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NodeId;                                            // 0x0050(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParmId;                                            // 0x0054(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ParentParmId;                                      // 0x0058(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ChildIndex;                                        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVisible;                                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsParentFolderVisible;                            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDisabled;                                       // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasChanged;                                       // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNeedsToTriggerUpdate;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDefault;                                        // 0x0065(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSpare;                                          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bJoinNext;                                         // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsChildOfMultiParm;                               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsDirectChildOfMultiParm;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingRevertToDefault;                           // 0x006A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 TuplePendingRevertToDefault;                       // 0x0070(0x0010)(ZeroConstructor, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	class FString                                 Help;                                              // 0x0080(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        TagCount;                                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ValueIndex;                                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasExpression;                                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShowExpression;                                   // 0x0099(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ParamExpression;                                   // 0x00A0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FString, class FString>            Tags;                                              // 0x00B0(0x0050)(Protected, NativeAccessSpecifierProtected)
	bool                                          bAutoUpdate;                                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniParameter">();
	}
	static class UHoudiniParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameter>();
	}
};
static_assert(alignof(UHoudiniParameter) == 0x000008, "Wrong alignment on UHoudiniParameter");
static_assert(sizeof(UHoudiniParameter) == 0x000108, "Wrong size on UHoudiniParameter");
static_assert(offsetof(UHoudiniParameter, Name_0) == 0x000028, "Member 'UHoudiniParameter::Name_0' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, Label) == 0x000038, "Member 'UHoudiniParameter::Label' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ParmType) == 0x000048, "Member 'UHoudiniParameter::ParmType' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, TupleSize) == 0x00004C, "Member 'UHoudiniParameter::TupleSize' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, NodeId) == 0x000050, "Member 'UHoudiniParameter::NodeId' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ParmId) == 0x000054, "Member 'UHoudiniParameter::ParmId' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ParentParmId) == 0x000058, "Member 'UHoudiniParameter::ParentParmId' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ChildIndex) == 0x00005C, "Member 'UHoudiniParameter::ChildIndex' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsVisible) == 0x000060, "Member 'UHoudiniParameter::bIsVisible' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsParentFolderVisible) == 0x000061, "Member 'UHoudiniParameter::bIsParentFolderVisible' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsDisabled) == 0x000062, "Member 'UHoudiniParameter::bIsDisabled' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bHasChanged) == 0x000063, "Member 'UHoudiniParameter::bHasChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bNeedsToTriggerUpdate) == 0x000064, "Member 'UHoudiniParameter::bNeedsToTriggerUpdate' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsDefault) == 0x000065, "Member 'UHoudiniParameter::bIsDefault' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsSpare) == 0x000066, "Member 'UHoudiniParameter::bIsSpare' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bJoinNext) == 0x000067, "Member 'UHoudiniParameter::bJoinNext' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsChildOfMultiParm) == 0x000068, "Member 'UHoudiniParameter::bIsChildOfMultiParm' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bIsDirectChildOfMultiParm) == 0x000069, "Member 'UHoudiniParameter::bIsDirectChildOfMultiParm' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bPendingRevertToDefault) == 0x00006A, "Member 'UHoudiniParameter::bPendingRevertToDefault' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, TuplePendingRevertToDefault) == 0x000070, "Member 'UHoudiniParameter::TuplePendingRevertToDefault' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, Help) == 0x000080, "Member 'UHoudiniParameter::Help' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, TagCount) == 0x000090, "Member 'UHoudiniParameter::TagCount' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ValueIndex) == 0x000094, "Member 'UHoudiniParameter::ValueIndex' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bHasExpression) == 0x000098, "Member 'UHoudiniParameter::bHasExpression' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bShowExpression) == 0x000099, "Member 'UHoudiniParameter::bShowExpression' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, ParamExpression) == 0x0000A0, "Member 'UHoudiniParameter::ParamExpression' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, Tags) == 0x0000B0, "Member 'UHoudiniParameter::Tags' has a wrong offset!");
static_assert(offsetof(UHoudiniParameter, bAutoUpdate) == 0x000100, "Member 'UHoudiniParameter::bAutoUpdate' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniParameterButtonStrip
// 0x0028 (0x0130 - 0x0108)
class UHoudiniParameterButtonStrip final : public UHoudiniParameter
{
public:
	int32                                         Count;                                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Labels;                                            // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Values;                                            // 0x0120(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniParameterButtonStrip">();
	}
	static class UHoudiniParameterButtonStrip* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameterButtonStrip>();
	}
};
static_assert(alignof(UHoudiniParameterButtonStrip) == 0x000008, "Wrong alignment on UHoudiniParameterButtonStrip");
static_assert(sizeof(UHoudiniParameterButtonStrip) == 0x000130, "Wrong size on UHoudiniParameterButtonStrip");
static_assert(offsetof(UHoudiniParameterButtonStrip, Count) == 0x000108, "Member 'UHoudiniParameterButtonStrip::Count' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterButtonStrip, Labels) == 0x000110, "Member 'UHoudiniParameterButtonStrip::Labels' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterButtonStrip, Values) == 0x000120, "Member 'UHoudiniParameterButtonStrip::Values' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAsset
// 0x0028 (0x0050 - 0x0028)
class UHoudiniAsset final : public UObject
{
public:
	class FString                                 AssetFileName;                                     // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 AssetBytes;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint32                                        AssetBytesCount;                                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetLimitedCommercial;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetNonCommercial;                               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAssetExpanded;                                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAsset">();
	}
	static class UHoudiniAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAsset>();
	}
};
static_assert(alignof(UHoudiniAsset) == 0x000008, "Wrong alignment on UHoudiniAsset");
static_assert(sizeof(UHoudiniAsset) == 0x000050, "Wrong size on UHoudiniAsset");
static_assert(offsetof(UHoudiniAsset, AssetFileName) == 0x000028, "Member 'UHoudiniAsset::AssetFileName' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, AssetBytes) == 0x000038, "Member 'UHoudiniAsset::AssetBytes' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, AssetBytesCount) == 0x000048, "Member 'UHoudiniAsset::AssetBytesCount' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetLimitedCommercial) == 0x00004C, "Member 'UHoudiniAsset::bAssetLimitedCommercial' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetNonCommercial) == 0x00004D, "Member 'UHoudiniAsset::bAssetNonCommercial' has a wrong offset!");
static_assert(offsetof(UHoudiniAsset, bAssetExpanded) == 0x00004E, "Member 'UHoudiniAsset::bAssetExpanded' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetParameter
// 0x0058 (0x0080 - 0x0028)
class UHoudiniAssetParameter : public UObject
{
public:
	uint8                                         Pad_28[0x58];                                      // 0x0028(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameter">();
	}
	static class UHoudiniAssetParameter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameter>();
	}
};
static_assert(alignof(UHoudiniAssetParameter) == 0x000008, "Wrong alignment on UHoudiniAssetParameter");
static_assert(sizeof(UHoudiniAssetParameter) == 0x000080, "Wrong size on UHoudiniAssetParameter");

// Class HoudiniEngineRuntime.HoudiniAssetParameterFile
// 0x0028 (0x00A8 - 0x0080)
class UHoudiniAssetParameterFile final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x28];                                      // 0x0080(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterFile">();
	}
	static class UHoudiniAssetParameterFile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFile>();
	}
};
static_assert(alignof(UHoudiniAssetParameterFile) == 0x000008, "Wrong alignment on UHoudiniAssetParameterFile");
static_assert(sizeof(UHoudiniAssetParameterFile) == 0x0000A8, "Wrong size on UHoudiniAssetParameterFile");

// Class HoudiniEngineRuntime.HoudiniAssetActor
// 0x0008 (0x0280 - 0x0278)
class AHoudiniAssetActor final : public AActor
{
public:
	class UHoudiniAssetComponent*                 HoudiniAssetComponent;                             // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetActor">();
	}
	static class AHoudiniAssetActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHoudiniAssetActor>();
	}
};
static_assert(alignof(AHoudiniAssetActor) == 0x000008, "Wrong alignment on AHoudiniAssetActor");
static_assert(sizeof(AHoudiniAssetActor) == 0x000280, "Wrong size on AHoudiniAssetActor");
static_assert(offsetof(AHoudiniAssetActor, HoudiniAssetComponent) == 0x000278, "Member 'AHoudiniAssetActor::HoudiniAssetComponent' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetComponent
// 0x0550 (0x0AB0 - 0x0560)
class UHoudiniAssetComponent : public UPrimitiveComponent
{
public:
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnParameterChange;                            // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUploadTransformsToHoudiniEngine;                  // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnTransformChange;                            // 0x056A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCookOnAssetInputCook;                             // 0x056B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputless;                                       // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTemplateGeos;                               // 0x056D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseOutputNodes;                                   // 0x056E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56F[0x1];                                      // 0x056F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDirectoryPath                         TemporaryCookFolder;                               // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDirectoryPath                         BakeFolder;                                        // 0x0580(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniStaticMeshMethod                      StaticMeshMethod;                                  // 0x0590(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniStaticMeshGenerationProperties StaticMeshGenerationProperties;                    // 0x0598(0x01E0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FMeshBuildSettings                     StaticMeshBuildSettings;                           // 0x0778(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideGlobalProxyStaticMeshSettings;            // 0x07C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshOverride;                    // 0x07C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementByTimerOverride;   // 0x07C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C3[0x1];                                      // 0x07C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProxyMeshAutoRefineTimeoutSecondsOverride;         // 0x07C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride; // 0x07C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride; // 0x07C9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7CA[0x2];                                      // 0x07CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AssetId;                                           // 0x07CC(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<int32>                                 NodeIdsToCook;                                     // 0x07D0(0x0010)(ZeroConstructor, Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TMap<int32, int32>                            OutputNodeCookCounts;                              // 0x07E0(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	TSet<class UHoudiniAssetComponent*>           DownstreamHoudiniAssets;                           // 0x0830(0x0050)(ExportObject, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  ComponentGUID;                                     // 0x0880(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  HapiGUID;                                          // 0x0890(0x0010)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 HapiAssetName;                                     // 0x08A0(0x0010)(ZeroConstructor, DuplicateTransient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            AssetState;                                        // 0x08B0(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetState                            DebugLastAssetState;                               // 0x08B1(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EHoudiniAssetStateResult                      AssetStateResult;                                  // 0x08B2(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8B3[0xD];                                      // 0x08B3(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             LastComponentTransform;                            // 0x08C0(0x0060)(DuplicateTransient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint32                                        SubAssetIndex;                                     // 0x0920(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AssetCookCount;                                    // 0x0924(0x0004)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenLoaded;                                    // 0x0928(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasBeenDuplicated;                                // 0x0929(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPendingDelete;                                    // 0x092A(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRecookRequested;                                  // 0x092B(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRebuildRequested;                                 // 0x092C(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableCooking;                                    // 0x092D(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceNeedUpdate;                                  // 0x092E(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLastCookSuccess;                                  // 0x092F(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParameterDefinitionUpdateNeeded;                  // 0x0930(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintStructureModified;                       // 0x0931(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bBlueprintModified;                                // 0x0932(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_933[0x5];                                      // 0x0933(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UHoudiniParameter*>              Parameters;                                        // 0x0938(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x0948(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UHoudiniOutput*>                 Outputs;                                           // 0x0958(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FHoudiniBakedOutput>            BakedOutputs;                                      // 0x0968(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          UntrackedOutputs;                                  // 0x0978(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UHoudiniHandleComponent*>        HandleComponents;                                  // 0x0988(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bHasComponentTransformChanged;                     // 0x0998(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFullyLoaded;                                      // 0x0999(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_99A[0x6];                                      // 0x099A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHoudiniPDGAssetLink*                   PDGAssetLink;                                      // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTimerHandle                           RefineMeshesTimer;                                 // 0x09A8(0x0008)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B0[0x18];                                     // 0x09B0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bNoProxyMeshNextCookRequested;                     // 0x09C8(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C9[0x7];                                      // 0x09C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UObject*, int32>                   InputPresets;                                      // 0x09D0(0x0050)(Transient, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	bool                                          bBakeAfterNextCook;                                // 0x0A20(0x0001)(ZeroConstructor, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A21[0x5F];                                     // 0x0A21(0x005F)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bCachedIsPreview;                                  // 0x0A80(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A81[0xF];                                      // 0x0A81(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LastTickTime;                                      // 0x0A90(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A98[0x18];                                     // 0x0A98(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetComponent">();
	}
	static class UHoudiniAssetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetComponent>();
	}
};
static_assert(alignof(UHoudiniAssetComponent) == 0x000010, "Wrong alignment on UHoudiniAssetComponent");
static_assert(sizeof(UHoudiniAssetComponent) == 0x000AB0, "Wrong size on UHoudiniAssetComponent");
static_assert(offsetof(UHoudiniAssetComponent, HoudiniAsset) == 0x000560, "Member 'UHoudiniAssetComponent::HoudiniAsset' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnParameterChange) == 0x000568, "Member 'UHoudiniAssetComponent::bCookOnParameterChange' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bUploadTransformsToHoudiniEngine) == 0x000569, "Member 'UHoudiniAssetComponent::bUploadTransformsToHoudiniEngine' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnTransformChange) == 0x00056A, "Member 'UHoudiniAssetComponent::bCookOnTransformChange' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCookOnAssetInputCook) == 0x00056B, "Member 'UHoudiniAssetComponent::bCookOnAssetInputCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOutputless) == 0x00056C, "Member 'UHoudiniAssetComponent::bOutputless' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOutputTemplateGeos) == 0x00056D, "Member 'UHoudiniAssetComponent::bOutputTemplateGeos' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bUseOutputNodes) == 0x00056E, "Member 'UHoudiniAssetComponent::bUseOutputNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, TemporaryCookFolder) == 0x000570, "Member 'UHoudiniAssetComponent::TemporaryCookFolder' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, BakeFolder) == 0x000580, "Member 'UHoudiniAssetComponent::BakeFolder' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshMethod) == 0x000590, "Member 'UHoudiniAssetComponent::StaticMeshMethod' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshGenerationProperties) == 0x000598, "Member 'UHoudiniAssetComponent::StaticMeshGenerationProperties' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, StaticMeshBuildSettings) == 0x000778, "Member 'UHoudiniAssetComponent::StaticMeshBuildSettings' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bOverrideGlobalProxyStaticMeshSettings) == 0x0007C0, "Member 'UHoudiniAssetComponent::bOverrideGlobalProxyStaticMeshSettings' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshOverride) == 0x0007C1, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementByTimerOverride) == 0x0007C2, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementByTimerOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, ProxyMeshAutoRefineTimeoutSecondsOverride) == 0x0007C4, "Member 'UHoudiniAssetComponent::ProxyMeshAutoRefineTimeoutSecondsOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride) == 0x0007C8, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementOnPreSaveWorldOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride) == 0x0007C9, "Member 'UHoudiniAssetComponent::bEnableProxyStaticMeshRefinementOnPreBeginPIEOverride' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetId) == 0x0007CC, "Member 'UHoudiniAssetComponent::AssetId' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, NodeIdsToCook) == 0x0007D0, "Member 'UHoudiniAssetComponent::NodeIdsToCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, OutputNodeCookCounts) == 0x0007E0, "Member 'UHoudiniAssetComponent::OutputNodeCookCounts' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, DownstreamHoudiniAssets) == 0x000830, "Member 'UHoudiniAssetComponent::DownstreamHoudiniAssets' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, ComponentGUID) == 0x000880, "Member 'UHoudiniAssetComponent::ComponentGUID' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HapiGUID) == 0x000890, "Member 'UHoudiniAssetComponent::HapiGUID' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HapiAssetName) == 0x0008A0, "Member 'UHoudiniAssetComponent::HapiAssetName' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetState) == 0x0008B0, "Member 'UHoudiniAssetComponent::AssetState' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, DebugLastAssetState) == 0x0008B1, "Member 'UHoudiniAssetComponent::DebugLastAssetState' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetStateResult) == 0x0008B2, "Member 'UHoudiniAssetComponent::AssetStateResult' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, LastComponentTransform) == 0x0008C0, "Member 'UHoudiniAssetComponent::LastComponentTransform' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, SubAssetIndex) == 0x000920, "Member 'UHoudiniAssetComponent::SubAssetIndex' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, AssetCookCount) == 0x000924, "Member 'UHoudiniAssetComponent::AssetCookCount' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasBeenLoaded) == 0x000928, "Member 'UHoudiniAssetComponent::bHasBeenLoaded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasBeenDuplicated) == 0x000929, "Member 'UHoudiniAssetComponent::bHasBeenDuplicated' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bPendingDelete) == 0x00092A, "Member 'UHoudiniAssetComponent::bPendingDelete' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bRecookRequested) == 0x00092B, "Member 'UHoudiniAssetComponent::bRecookRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bRebuildRequested) == 0x00092C, "Member 'UHoudiniAssetComponent::bRebuildRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bEnableCooking) == 0x00092D, "Member 'UHoudiniAssetComponent::bEnableCooking' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bForceNeedUpdate) == 0x00092E, "Member 'UHoudiniAssetComponent::bForceNeedUpdate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bLastCookSuccess) == 0x00092F, "Member 'UHoudiniAssetComponent::bLastCookSuccess' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bParameterDefinitionUpdateNeeded) == 0x000930, "Member 'UHoudiniAssetComponent::bParameterDefinitionUpdateNeeded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBlueprintStructureModified) == 0x000931, "Member 'UHoudiniAssetComponent::bBlueprintStructureModified' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBlueprintModified) == 0x000932, "Member 'UHoudiniAssetComponent::bBlueprintModified' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Parameters) == 0x000938, "Member 'UHoudiniAssetComponent::Parameters' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Inputs) == 0x000948, "Member 'UHoudiniAssetComponent::Inputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, Outputs) == 0x000958, "Member 'UHoudiniAssetComponent::Outputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, BakedOutputs) == 0x000968, "Member 'UHoudiniAssetComponent::BakedOutputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, UntrackedOutputs) == 0x000978, "Member 'UHoudiniAssetComponent::UntrackedOutputs' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, HandleComponents) == 0x000988, "Member 'UHoudiniAssetComponent::HandleComponents' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bHasComponentTransformChanged) == 0x000998, "Member 'UHoudiniAssetComponent::bHasComponentTransformChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bFullyLoaded) == 0x000999, "Member 'UHoudiniAssetComponent::bFullyLoaded' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, PDGAssetLink) == 0x0009A0, "Member 'UHoudiniAssetComponent::PDGAssetLink' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, RefineMeshesTimer) == 0x0009A8, "Member 'UHoudiniAssetComponent::RefineMeshesTimer' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bNoProxyMeshNextCookRequested) == 0x0009C8, "Member 'UHoudiniAssetComponent::bNoProxyMeshNextCookRequested' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, InputPresets) == 0x0009D0, "Member 'UHoudiniAssetComponent::InputPresets' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bBakeAfterNextCook) == 0x000A20, "Member 'UHoudiniAssetComponent::bBakeAfterNextCook' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, bCachedIsPreview) == 0x000A80, "Member 'UHoudiniAssetComponent::bCachedIsPreview' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetComponent, LastTickTime) == 0x000A90, "Member 'UHoudiniAssetComponent::LastTickTime' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetBlueprintComponent
// 0x0100 (0x0BB0 - 0x0AB0)
class UHoudiniAssetBlueprintComponent final : public UHoudiniAssetComponent
{
public:
	uint8                                         Pad_AB0[0x48];                                     // 0x0AB0(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          FauxBPProperty;                                    // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHoudiniAssetChanged;                              // 0x0AF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUpdatedFromTemplate;                              // 0x0AFA(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsInBlueprintEditor;                              // 0x0AFB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCanDeleteHoudiniNodes;                            // 0x0AFC(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRegisteredComponentTemplate;                   // 0x0AFD(0x0001)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AFE[0xA];                                      // 0x0AFE(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FHoudiniOutputObjectIdentifier, struct FGuid> CachedOutputNodes;                                 // 0x0B08(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, struct FGuid>              CachedInputNodes;                                  // 0x0B58(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_BA8[0x8];                                      // 0x0BA8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool HasParameter(const class FString& Name_0);
	void SetFloatParameter(const class FString& Name_0, float Value, int32 Index_0);
	void SetToggleValueAt(const class FString& Name_0, bool Value, int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetBlueprintComponent">();
	}
	static class UHoudiniAssetBlueprintComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetBlueprintComponent>();
	}
};
static_assert(alignof(UHoudiniAssetBlueprintComponent) == 0x000010, "Wrong alignment on UHoudiniAssetBlueprintComponent");
static_assert(sizeof(UHoudiniAssetBlueprintComponent) == 0x000BB0, "Wrong size on UHoudiniAssetBlueprintComponent");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, FauxBPProperty) == 0x000AF8, "Member 'UHoudiniAssetBlueprintComponent::FauxBPProperty' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bHoudiniAssetChanged) == 0x000AF9, "Member 'UHoudiniAssetBlueprintComponent::bHoudiniAssetChanged' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bUpdatedFromTemplate) == 0x000AFA, "Member 'UHoudiniAssetBlueprintComponent::bUpdatedFromTemplate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bIsInBlueprintEditor) == 0x000AFB, "Member 'UHoudiniAssetBlueprintComponent::bIsInBlueprintEditor' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bCanDeleteHoudiniNodes) == 0x000AFC, "Member 'UHoudiniAssetBlueprintComponent::bCanDeleteHoudiniNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, bHasRegisteredComponentTemplate) == 0x000AFD, "Member 'UHoudiniAssetBlueprintComponent::bHasRegisteredComponentTemplate' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, CachedOutputNodes) == 0x000B08, "Member 'UHoudiniAssetBlueprintComponent::CachedOutputNodes' has a wrong offset!");
static_assert(offsetof(UHoudiniAssetBlueprintComponent, CachedInputNodes) == 0x000B58, "Member 'UHoudiniAssetBlueprintComponent::CachedInputNodes' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniParameterFloat
// 0x0050 (0x0158 - 0x0108)
class UHoudiniParameterFloat final : public UHoudiniParameter
{
public:
	TArray<float>                                 Values;                                            // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<float>                                 DefaultValues;                                     // 0x0118(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FString                                 Unit;                                              // 0x0128(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bNoSwap;                                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasMin;                                           // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasMax;                                           // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasUIMin;                                         // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasUIMax;                                         // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsLogarithmic;                                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Min;                                               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Max;                                               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UIMin;                                             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         UIMax;                                             // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsChildOfRamp;                                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniParameterFloat">();
	}
	static class UHoudiniParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniParameterFloat>();
	}
};
static_assert(alignof(UHoudiniParameterFloat) == 0x000008, "Wrong alignment on UHoudiniParameterFloat");
static_assert(sizeof(UHoudiniParameterFloat) == 0x000158, "Wrong size on UHoudiniParameterFloat");
static_assert(offsetof(UHoudiniParameterFloat, Values) == 0x000108, "Member 'UHoudiniParameterFloat::Values' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, DefaultValues) == 0x000118, "Member 'UHoudiniParameterFloat::DefaultValues' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, Unit) == 0x000128, "Member 'UHoudiniParameterFloat::Unit' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bNoSwap) == 0x000138, "Member 'UHoudiniParameterFloat::bNoSwap' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bHasMin) == 0x000139, "Member 'UHoudiniParameterFloat::bHasMin' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bHasMax) == 0x00013A, "Member 'UHoudiniParameterFloat::bHasMax' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bHasUIMin) == 0x00013B, "Member 'UHoudiniParameterFloat::bHasUIMin' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bHasUIMax) == 0x00013C, "Member 'UHoudiniParameterFloat::bHasUIMax' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bIsLogarithmic) == 0x00013D, "Member 'UHoudiniParameterFloat::bIsLogarithmic' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, Min) == 0x000140, "Member 'UHoudiniParameterFloat::Min' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, Max) == 0x000144, "Member 'UHoudiniParameterFloat::Max' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, UIMin) == 0x000148, "Member 'UHoudiniParameterFloat::UIMin' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, UIMax) == 0x00014C, "Member 'UHoudiniParameterFloat::UIMax' has a wrong offset!");
static_assert(offsetof(UHoudiniParameterFloat, bIsChildOfRamp) == 0x000150, "Member 'UHoudiniParameterFloat::bIsChildOfRamp' has a wrong offset!");

// Class HoudiniEngineRuntime.HoudiniAssetParameterInt
// 0x0030 (0x00B0 - 0x0080)
class UHoudiniAssetParameterInt final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x30];                                      // 0x0080(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterInt">();
	}
	static class UHoudiniAssetParameterInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterInt>();
	}
};
static_assert(alignof(UHoudiniAssetParameterInt) == 0x000008, "Wrong alignment on UHoudiniAssetParameterInt");
static_assert(sizeof(UHoudiniAssetParameterInt) == 0x0000B0, "Wrong size on UHoudiniAssetParameterInt");

// Class HoudiniEngineRuntime.HoudiniAssetParameterButton
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterButton final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterButton">();
	}
	static class UHoudiniAssetParameterButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterButton>();
	}
};
static_assert(alignof(UHoudiniAssetParameterButton) == 0x000008, "Wrong alignment on UHoudiniAssetParameterButton");
static_assert(sizeof(UHoudiniAssetParameterButton) == 0x000080, "Wrong size on UHoudiniAssetParameterButton");

// Class HoudiniEngineRuntime.HoudiniAssetParameterColor
// 0x0010 (0x0090 - 0x0080)
class UHoudiniAssetParameterColor final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterColor">();
	}
	static class UHoudiniAssetParameterColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterColor>();
	}
};
static_assert(alignof(UHoudiniAssetParameterColor) == 0x000008, "Wrong alignment on UHoudiniAssetParameterColor");
static_assert(sizeof(UHoudiniAssetParameterColor) == 0x000090, "Wrong size on UHoudiniAssetParameterColor");

// Class HoudiniEngineRuntime.HoudiniAssetParameterChoice
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterChoice final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterChoice">();
	}
	static class UHoudiniAssetParameterChoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterChoice>();
	}
};
static_assert(alignof(UHoudiniAssetParameterChoice) == 0x000008, "Wrong alignment on UHoudiniAssetParameterChoice");
static_assert(sizeof(UHoudiniAssetParameterChoice) == 0x0000B8, "Wrong size on UHoudiniAssetParameterChoice");

// Class HoudiniEngineRuntime.HoudiniAssetParameterFloat
// 0x0038 (0x00B8 - 0x0080)
class UHoudiniAssetParameterFloat final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x38];                                      // 0x0080(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterFloat">();
	}
	static class UHoudiniAssetParameterFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFloat>();
	}
};
static_assert(alignof(UHoudiniAssetParameterFloat) == 0x000008, "Wrong alignment on UHoudiniAssetParameterFloat");
static_assert(sizeof(UHoudiniAssetParameterFloat) == 0x0000B8, "Wrong size on UHoudiniAssetParameterFloat");

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolder
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolder final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterFolder">();
	}
	static class UHoudiniAssetParameterFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolder>();
	}
};
static_assert(alignof(UHoudiniAssetParameterFolder) == 0x000008, "Wrong alignment on UHoudiniAssetParameterFolder");
static_assert(sizeof(UHoudiniAssetParameterFolder) == 0x000080, "Wrong size on UHoudiniAssetParameterFolder");

// Class HoudiniEngineRuntime.HoudiniAssetParameterFolderList
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterFolderList final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterFolderList">();
	}
	static class UHoudiniAssetParameterFolderList* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterFolderList>();
	}
};
static_assert(alignof(UHoudiniAssetParameterFolderList) == 0x000008, "Wrong alignment on UHoudiniAssetParameterFolderList");
static_assert(sizeof(UHoudiniAssetParameterFolderList) == 0x000080, "Wrong size on UHoudiniAssetParameterFolderList");

// Class HoudiniEngineRuntime.HoudiniAssetParameterLabel
// 0x0000 (0x0080 - 0x0080)
class UHoudiniAssetParameterLabel final : public UHoudiniAssetParameter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HoudiniAssetParameterLabel">();
	}
	static class UHoudiniAssetParameterLabel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoudiniAssetParameterLabel>();
	}
};
static_assert(alignof(UHoudiniAssetParameterLabel) == 0x000008, "Wrong alignment on UHoudiniAssetParameterLabel");
static_assert(sizeof(UHoudiniAssetParameterLabel) == 0x000080, "Wrong size on UHoudiniAssetParameterLabel");

// Class HoudiniEngineRuntime.HoudiniAssetParameterMultiparm
// 0x0008 (0x0088 - 0x0080)
class UHoudiniAssetParameterMultiparm final : public UHoudiniAssetParameter
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
