#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HoudiniEngineRuntime.HoudiniAssetBlueprintComponent.HasParameter
// 0x0018 (0x0018 - 0x0000)
struct HoudiniAssetBlueprintComponent_HasParameter final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HoudiniAssetBlueprintComponent_HasParameter) == 0x000008, "Wrong alignment on HoudiniAssetBlueprintComponent_HasParameter");
static_assert(sizeof(HoudiniAssetBlueprintComponent_HasParameter) == 0x000018, "Wrong size on HoudiniAssetBlueprintComponent_HasParameter");
static_assert(offsetof(HoudiniAssetBlueprintComponent_HasParameter, Name_0) == 0x000000, "Member 'HoudiniAssetBlueprintComponent_HasParameter::Name_0' has a wrong offset!");
static_assert(offsetof(HoudiniAssetBlueprintComponent_HasParameter, ReturnValue) == 0x000010, "Member 'HoudiniAssetBlueprintComponent_HasParameter::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniAssetBlueprintComponent.SetFloatParameter
// 0x0018 (0x0018 - 0x0000)
struct HoudiniAssetBlueprintComponent_SetFloatParameter final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniAssetBlueprintComponent_SetFloatParameter) == 0x000008, "Wrong alignment on HoudiniAssetBlueprintComponent_SetFloatParameter");
static_assert(sizeof(HoudiniAssetBlueprintComponent_SetFloatParameter) == 0x000018, "Wrong size on HoudiniAssetBlueprintComponent_SetFloatParameter");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetFloatParameter, Name_0) == 0x000000, "Member 'HoudiniAssetBlueprintComponent_SetFloatParameter::Name_0' has a wrong offset!");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetFloatParameter, Value) == 0x000010, "Member 'HoudiniAssetBlueprintComponent_SetFloatParameter::Value' has a wrong offset!");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetFloatParameter, Index_0) == 0x000014, "Member 'HoudiniAssetBlueprintComponent_SetFloatParameter::Index_0' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniAssetBlueprintComponent.SetToggleValueAt
// 0x0018 (0x0018 - 0x0000)
struct HoudiniAssetBlueprintComponent_SetToggleValueAt final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniAssetBlueprintComponent_SetToggleValueAt) == 0x000008, "Wrong alignment on HoudiniAssetBlueprintComponent_SetToggleValueAt");
static_assert(sizeof(HoudiniAssetBlueprintComponent_SetToggleValueAt) == 0x000018, "Wrong size on HoudiniAssetBlueprintComponent_SetToggleValueAt");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetToggleValueAt, Name_0) == 0x000000, "Member 'HoudiniAssetBlueprintComponent_SetToggleValueAt::Name_0' has a wrong offset!");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetToggleValueAt, Value) == 0x000010, "Member 'HoudiniAssetBlueprintComponent_SetToggleValueAt::Value' has a wrong offset!");
static_assert(offsetof(HoudiniAssetBlueprintComponent_SetToggleValueAt, Index_0) == 0x000014, "Member 'HoudiniAssetBlueprintComponent_SetToggleValueAt::Index_0' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.AddStaticMaterial
// 0x0038 (0x0038 - 0x0000)
struct HoudiniStaticMesh_AddStaticMaterial final
{
public:
	struct FStaticMaterial                        InStaticMaterial;                                  // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint32                                        ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(HoudiniStaticMesh_AddStaticMaterial) == 0x000008, "Wrong alignment on HoudiniStaticMesh_AddStaticMaterial");
static_assert(sizeof(HoudiniStaticMesh_AddStaticMaterial) == 0x000038, "Wrong size on HoudiniStaticMesh_AddStaticMaterial");
static_assert(offsetof(HoudiniStaticMesh_AddStaticMaterial, InStaticMaterial) == 0x000000, "Member 'HoudiniStaticMesh_AddStaticMaterial::InStaticMaterial' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_AddStaticMaterial, ReturnValue) == 0x000030, "Member 'HoudiniStaticMesh_AddStaticMaterial::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.CalculateNormals
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_CalculateNormals final
{
public:
	bool                                          bInComputeWeightedNormals;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_CalculateNormals) == 0x000001, "Wrong alignment on HoudiniStaticMesh_CalculateNormals");
static_assert(sizeof(HoudiniStaticMesh_CalculateNormals) == 0x000001, "Wrong size on HoudiniStaticMesh_CalculateNormals");
static_assert(offsetof(HoudiniStaticMesh_CalculateNormals, bInComputeWeightedNormals) == 0x000000, "Member 'HoudiniStaticMesh_CalculateNormals::bInComputeWeightedNormals' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.CalculateTangents
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_CalculateTangents final
{
public:
	bool                                          bInComputeWeightedNormals;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_CalculateTangents) == 0x000001, "Wrong alignment on HoudiniStaticMesh_CalculateTangents");
static_assert(sizeof(HoudiniStaticMesh_CalculateTangents) == 0x000001, "Wrong size on HoudiniStaticMesh_CalculateTangents");
static_assert(offsetof(HoudiniStaticMesh_CalculateTangents, bInComputeWeightedNormals) == 0x000000, "Member 'HoudiniStaticMesh_CalculateTangents::bInComputeWeightedNormals' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetMaterial
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetMaterial final
{
public:
	int32                                         InMaterialIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetMaterial) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetMaterial");
static_assert(sizeof(HoudiniStaticMesh_GetMaterial) == 0x000010, "Wrong size on HoudiniStaticMesh_GetMaterial");
static_assert(offsetof(HoudiniStaticMesh_GetMaterial, InMaterialIndex) == 0x000000, "Member 'HoudiniStaticMesh_GetMaterial::InMaterialIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_GetMaterial, ReturnValue) == 0x000008, "Member 'HoudiniStaticMesh_GetMaterial::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.Initialize
// 0x0014 (0x0014 - 0x0000)
struct HoudiniStaticMesh_Initialize final
{
public:
	uint32                                        InNumVertices;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InNumTriangles;                                    // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InNumUVLayers;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        InInitialNumStaticMaterials;                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasNormals;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasTangents;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasColors;                                      // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInHasPerFaceMaterials;                            // 0x0013(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_Initialize) == 0x000004, "Wrong alignment on HoudiniStaticMesh_Initialize");
static_assert(sizeof(HoudiniStaticMesh_Initialize) == 0x000014, "Wrong size on HoudiniStaticMesh_Initialize");
static_assert(offsetof(HoudiniStaticMesh_Initialize, InNumVertices) == 0x000000, "Member 'HoudiniStaticMesh_Initialize::InNumVertices' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, InNumTriangles) == 0x000004, "Member 'HoudiniStaticMesh_Initialize::InNumTriangles' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, InNumUVLayers) == 0x000008, "Member 'HoudiniStaticMesh_Initialize::InNumUVLayers' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, InInitialNumStaticMaterials) == 0x00000C, "Member 'HoudiniStaticMesh_Initialize::InInitialNumStaticMaterials' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, bInHasNormals) == 0x000010, "Member 'HoudiniStaticMesh_Initialize::bInHasNormals' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, bInHasTangents) == 0x000011, "Member 'HoudiniStaticMesh_Initialize::bInHasTangents' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, bInHasColors) == 0x000012, "Member 'HoudiniStaticMesh_Initialize::bInHasColors' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_Initialize, bInHasPerFaceMaterials) == 0x000013, "Member 'HoudiniStaticMesh_Initialize::bInHasPerFaceMaterials' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetHasColors
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_SetHasColors final
{
public:
	bool                                          bInHasColors;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetHasColors) == 0x000001, "Wrong alignment on HoudiniStaticMesh_SetHasColors");
static_assert(sizeof(HoudiniStaticMesh_SetHasColors) == 0x000001, "Wrong size on HoudiniStaticMesh_SetHasColors");
static_assert(offsetof(HoudiniStaticMesh_SetHasColors, bInHasColors) == 0x000000, "Member 'HoudiniStaticMesh_SetHasColors::bInHasColors' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetHasNormals
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_SetHasNormals final
{
public:
	bool                                          bInHasNormals;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetHasNormals) == 0x000001, "Wrong alignment on HoudiniStaticMesh_SetHasNormals");
static_assert(sizeof(HoudiniStaticMesh_SetHasNormals) == 0x000001, "Wrong size on HoudiniStaticMesh_SetHasNormals");
static_assert(offsetof(HoudiniStaticMesh_SetHasNormals, bInHasNormals) == 0x000000, "Member 'HoudiniStaticMesh_SetHasNormals::bInHasNormals' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetHasPerFaceMaterials
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_SetHasPerFaceMaterials final
{
public:
	bool                                          bInHasPerFaceMaterials;                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetHasPerFaceMaterials) == 0x000001, "Wrong alignment on HoudiniStaticMesh_SetHasPerFaceMaterials");
static_assert(sizeof(HoudiniStaticMesh_SetHasPerFaceMaterials) == 0x000001, "Wrong size on HoudiniStaticMesh_SetHasPerFaceMaterials");
static_assert(offsetof(HoudiniStaticMesh_SetHasPerFaceMaterials, bInHasPerFaceMaterials) == 0x000000, "Member 'HoudiniStaticMesh_SetHasPerFaceMaterials::bInHasPerFaceMaterials' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetHasTangents
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_SetHasTangents final
{
public:
	bool                                          bInHasTangents;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetHasTangents) == 0x000001, "Wrong alignment on HoudiniStaticMesh_SetHasTangents");
static_assert(sizeof(HoudiniStaticMesh_SetHasTangents) == 0x000001, "Wrong size on HoudiniStaticMesh_SetHasTangents");
static_assert(offsetof(HoudiniStaticMesh_SetHasTangents, bInHasTangents) == 0x000000, "Member 'HoudiniStaticMesh_SetHasTangents::bInHasTangents' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetNumStaticMaterials
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_SetNumStaticMaterials final
{
public:
	uint32                                        InNumStaticMaterials;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetNumStaticMaterials) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetNumStaticMaterials");
static_assert(sizeof(HoudiniStaticMesh_SetNumStaticMaterials) == 0x000004, "Wrong size on HoudiniStaticMesh_SetNumStaticMaterials");
static_assert(offsetof(HoudiniStaticMesh_SetNumStaticMaterials, InNumStaticMaterials) == 0x000000, "Member 'HoudiniStaticMesh_SetNumStaticMaterials::InNumStaticMaterials' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetNumUVLayers
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_SetNumUVLayers final
{
public:
	uint32                                        InNumUVLayers;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetNumUVLayers) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetNumUVLayers");
static_assert(sizeof(HoudiniStaticMesh_SetNumUVLayers) == 0x000004, "Wrong size on HoudiniStaticMesh_SetNumUVLayers");
static_assert(offsetof(HoudiniStaticMesh_SetNumUVLayers, InNumUVLayers) == 0x000000, "Member 'HoudiniStaticMesh_SetNumUVLayers::InNumUVLayers' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetStaticMaterial
// 0x0038 (0x0038 - 0x0000)
struct HoudiniStaticMesh_SetStaticMaterial final
{
public:
	uint32                                        InMaterialIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStaticMaterial                        InStaticMaterial;                                  // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetStaticMaterial) == 0x000008, "Wrong alignment on HoudiniStaticMesh_SetStaticMaterial");
static_assert(sizeof(HoudiniStaticMesh_SetStaticMaterial) == 0x000038, "Wrong size on HoudiniStaticMesh_SetStaticMaterial");
static_assert(offsetof(HoudiniStaticMesh_SetStaticMaterial, InMaterialIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetStaticMaterial::InMaterialIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetStaticMaterial, InStaticMaterial) == 0x000008, "Member 'HoudiniStaticMesh_SetStaticMaterial::InStaticMaterial' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleMaterialID
// 0x0008 (0x0008 - 0x0000)
struct HoudiniStaticMesh_SetTriangleMaterialID final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaterialID;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleMaterialID) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleMaterialID");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleMaterialID) == 0x000008, "Wrong size on HoudiniStaticMesh_SetTriangleMaterialID");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleMaterialID, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleMaterialID::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleMaterialID, InMaterialID) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleMaterialID::InMaterialID' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexColor
// 0x000C (0x000C - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexColor final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTriangleVertexIndex;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 InColor;                                           // 0x0008(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexColor) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexColor");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexColor) == 0x00000C, "Wrong size on HoudiniStaticMesh_SetTriangleVertexColor");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexColor, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexColor::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexColor, InTriangleVertexIndex) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexColor::InTriangleVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexColor, InColor) == 0x000008, "Member 'HoudiniStaticMesh_SetTriangleVertexColor::InColor' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexIndices
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexIndices final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntVector                             InTriangleVertexIndices;                           // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexIndices) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexIndices");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexIndices) == 0x000010, "Wrong size on HoudiniStaticMesh_SetTriangleVertexIndices");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexIndices, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexIndices::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexIndices, InTriangleVertexIndices) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexIndices::InTriangleVertexIndices' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexNormal
// 0x0014 (0x0014 - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexNormal final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTriangleVertexIndex;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3f                              InNormal;                                          // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexNormal) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexNormal");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexNormal) == 0x000014, "Wrong size on HoudiniStaticMesh_SetTriangleVertexNormal");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexNormal, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexNormal::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexNormal, InTriangleVertexIndex) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexNormal::InTriangleVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexNormal, InNormal) == 0x000008, "Member 'HoudiniStaticMesh_SetTriangleVertexNormal::InNormal' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexUTangent
// 0x0014 (0x0014 - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexUTangent final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTriangleVertexIndex;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3f                              InUTangent;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexUTangent) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexUTangent");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexUTangent) == 0x000014, "Wrong size on HoudiniStaticMesh_SetTriangleVertexUTangent");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUTangent, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexUTangent::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUTangent, InTriangleVertexIndex) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexUTangent::InTriangleVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUTangent, InUTangent) == 0x000008, "Member 'HoudiniStaticMesh_SetTriangleVertexUTangent::InUTangent' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexUV
// 0x0018 (0x0018 - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexUV final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTriangleVertexIndex;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InUVLayer;                                         // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              InUV;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexUV) == 0x000008, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexUV");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexUV) == 0x000018, "Wrong size on HoudiniStaticMesh_SetTriangleVertexUV");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUV, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexUV::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUV, InTriangleVertexIndex) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexUV::InTriangleVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUV, InUVLayer) == 0x000005, "Member 'HoudiniStaticMesh_SetTriangleVertexUV::InUVLayer' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexUV, InUV) == 0x000008, "Member 'HoudiniStaticMesh_SetTriangleVertexUV::InUV' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetTriangleVertexVTangent
// 0x0014 (0x0014 - 0x0000)
struct HoudiniStaticMesh_SetTriangleVertexVTangent final
{
public:
	uint32                                        InTriangleIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         InTriangleVertexIndex;                             // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector3f                              InVTangent;                                        // 0x0008(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetTriangleVertexVTangent) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetTriangleVertexVTangent");
static_assert(sizeof(HoudiniStaticMesh_SetTriangleVertexVTangent) == 0x000014, "Wrong size on HoudiniStaticMesh_SetTriangleVertexVTangent");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexVTangent, InTriangleIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetTriangleVertexVTangent::InTriangleIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexVTangent, InTriangleVertexIndex) == 0x000004, "Member 'HoudiniStaticMesh_SetTriangleVertexVTangent::InTriangleVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetTriangleVertexVTangent, InVTangent) == 0x000008, "Member 'HoudiniStaticMesh_SetTriangleVertexVTangent::InVTangent' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.SetVertexPosition
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_SetVertexPosition final
{
public:
	uint32                                        InVertexIndex;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              InPosition;                                        // 0x0004(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_SetVertexPosition) == 0x000004, "Wrong alignment on HoudiniStaticMesh_SetVertexPosition");
static_assert(sizeof(HoudiniStaticMesh_SetVertexPosition) == 0x000010, "Wrong size on HoudiniStaticMesh_SetVertexPosition");
static_assert(offsetof(HoudiniStaticMesh_SetVertexPosition, InVertexIndex) == 0x000000, "Member 'HoudiniStaticMesh_SetVertexPosition::InVertexIndex' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_SetVertexPosition, InPosition) == 0x000004, "Member 'HoudiniStaticMesh_SetVertexPosition::InPosition' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.CalcBounds
// 0x0038 (0x0038 - 0x0000)
struct HoudiniStaticMesh_CalcBounds final
{
public:
	struct FBox                                   ReturnValue;                                       // 0x0000(0x0038)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_CalcBounds) == 0x000008, "Wrong alignment on HoudiniStaticMesh_CalcBounds");
static_assert(sizeof(HoudiniStaticMesh_CalcBounds) == 0x000038, "Wrong size on HoudiniStaticMesh_CalcBounds");
static_assert(offsetof(HoudiniStaticMesh_CalcBounds, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_CalcBounds::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetMaterialIDsPerTriangle
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetMaterialIDsPerTriangle final
{
public:
	TArray<int32>                                 ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetMaterialIDsPerTriangle) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetMaterialIDsPerTriangle");
static_assert(sizeof(HoudiniStaticMesh_GetMaterialIDsPerTriangle) == 0x000010, "Wrong size on HoudiniStaticMesh_GetMaterialIDsPerTriangle");
static_assert(offsetof(HoudiniStaticMesh_GetMaterialIDsPerTriangle, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetMaterialIDsPerTriangle::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetMaterialIndex
// 0x000C (0x000C - 0x0000)
struct HoudiniStaticMesh_GetMaterialIndex final
{
public:
	class FName                                   InMaterialSlotName;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetMaterialIndex) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetMaterialIndex");
static_assert(sizeof(HoudiniStaticMesh_GetMaterialIndex) == 0x00000C, "Wrong size on HoudiniStaticMesh_GetMaterialIndex");
static_assert(offsetof(HoudiniStaticMesh_GetMaterialIndex, InMaterialSlotName) == 0x000000, "Member 'HoudiniStaticMesh_GetMaterialIndex::InMaterialSlotName' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_GetMaterialIndex, ReturnValue) == 0x000008, "Member 'HoudiniStaticMesh_GetMaterialIndex::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetNumStaticMaterials
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_GetNumStaticMaterials final
{
public:
	uint32                                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetNumStaticMaterials) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetNumStaticMaterials");
static_assert(sizeof(HoudiniStaticMesh_GetNumStaticMaterials) == 0x000004, "Wrong size on HoudiniStaticMesh_GetNumStaticMaterials");
static_assert(offsetof(HoudiniStaticMesh_GetNumStaticMaterials, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetNumStaticMaterials::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetNumTriangles
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_GetNumTriangles final
{
public:
	uint32                                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetNumTriangles) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetNumTriangles");
static_assert(sizeof(HoudiniStaticMesh_GetNumTriangles) == 0x000004, "Wrong size on HoudiniStaticMesh_GetNumTriangles");
static_assert(offsetof(HoudiniStaticMesh_GetNumTriangles, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetNumTriangles::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetNumUVLayers
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_GetNumUVLayers final
{
public:
	uint32                                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetNumUVLayers) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetNumUVLayers");
static_assert(sizeof(HoudiniStaticMesh_GetNumUVLayers) == 0x000004, "Wrong size on HoudiniStaticMesh_GetNumUVLayers");
static_assert(offsetof(HoudiniStaticMesh_GetNumUVLayers, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetNumUVLayers::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetNumVertexInstances
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_GetNumVertexInstances final
{
public:
	uint32                                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetNumVertexInstances) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetNumVertexInstances");
static_assert(sizeof(HoudiniStaticMesh_GetNumVertexInstances) == 0x000004, "Wrong size on HoudiniStaticMesh_GetNumVertexInstances");
static_assert(offsetof(HoudiniStaticMesh_GetNumVertexInstances, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetNumVertexInstances::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetNumVertices
// 0x0004 (0x0004 - 0x0000)
struct HoudiniStaticMesh_GetNumVertices final
{
public:
	uint32                                        ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetNumVertices) == 0x000004, "Wrong alignment on HoudiniStaticMesh_GetNumVertices");
static_assert(sizeof(HoudiniStaticMesh_GetNumVertices) == 0x000004, "Wrong size on HoudiniStaticMesh_GetNumVertices");
static_assert(offsetof(HoudiniStaticMesh_GetNumVertices, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetNumVertices::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetStaticMaterials
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetStaticMaterials final
{
public:
	TArray<struct FStaticMaterial>                ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetStaticMaterials) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetStaticMaterials");
static_assert(sizeof(HoudiniStaticMesh_GetStaticMaterials) == 0x000010, "Wrong size on HoudiniStaticMesh_GetStaticMaterials");
static_assert(offsetof(HoudiniStaticMesh_GetStaticMaterials, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetStaticMaterials::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetTriangleIndices
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetTriangleIndices final
{
public:
	TArray<struct FIntVector>                     ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetTriangleIndices) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetTriangleIndices");
static_assert(sizeof(HoudiniStaticMesh_GetTriangleIndices) == 0x000010, "Wrong size on HoudiniStaticMesh_GetTriangleIndices");
static_assert(offsetof(HoudiniStaticMesh_GetTriangleIndices, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetTriangleIndices::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexInstanceColors
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexInstanceColors final
{
public:
	TArray<struct FColor>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexInstanceColors) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexInstanceColors");
static_assert(sizeof(HoudiniStaticMesh_GetVertexInstanceColors) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexInstanceColors");
static_assert(offsetof(HoudiniStaticMesh_GetVertexInstanceColors, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexInstanceColors::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexInstanceNormals
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexInstanceNormals final
{
public:
	TArray<struct FVector3f>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexInstanceNormals) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexInstanceNormals");
static_assert(sizeof(HoudiniStaticMesh_GetVertexInstanceNormals) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexInstanceNormals");
static_assert(offsetof(HoudiniStaticMesh_GetVertexInstanceNormals, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexInstanceNormals::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexInstanceUTangents
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexInstanceUTangents final
{
public:
	TArray<struct FVector3f>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexInstanceUTangents) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexInstanceUTangents");
static_assert(sizeof(HoudiniStaticMesh_GetVertexInstanceUTangents) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexInstanceUTangents");
static_assert(offsetof(HoudiniStaticMesh_GetVertexInstanceUTangents, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexInstanceUTangents::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexInstanceUVs
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexInstanceUVs final
{
public:
	TArray<struct FVector2D>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexInstanceUVs) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexInstanceUVs");
static_assert(sizeof(HoudiniStaticMesh_GetVertexInstanceUVs) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexInstanceUVs");
static_assert(offsetof(HoudiniStaticMesh_GetVertexInstanceUVs, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexInstanceUVs::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexInstanceVTangents
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexInstanceVTangents final
{
public:
	TArray<struct FVector3f>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexInstanceVTangents) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexInstanceVTangents");
static_assert(sizeof(HoudiniStaticMesh_GetVertexInstanceVTangents) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexInstanceVTangents");
static_assert(offsetof(HoudiniStaticMesh_GetVertexInstanceVTangents, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexInstanceVTangents::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.GetVertexPositions
// 0x0010 (0x0010 - 0x0000)
struct HoudiniStaticMesh_GetVertexPositions final
{
public:
	TArray<struct FVector3f>                      ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_GetVertexPositions) == 0x000008, "Wrong alignment on HoudiniStaticMesh_GetVertexPositions");
static_assert(sizeof(HoudiniStaticMesh_GetVertexPositions) == 0x000010, "Wrong size on HoudiniStaticMesh_GetVertexPositions");
static_assert(offsetof(HoudiniStaticMesh_GetVertexPositions, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_GetVertexPositions::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.HasColors
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_HasColors final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_HasColors) == 0x000001, "Wrong alignment on HoudiniStaticMesh_HasColors");
static_assert(sizeof(HoudiniStaticMesh_HasColors) == 0x000001, "Wrong size on HoudiniStaticMesh_HasColors");
static_assert(offsetof(HoudiniStaticMesh_HasColors, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_HasColors::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.HasNormals
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_HasNormals final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_HasNormals) == 0x000001, "Wrong alignment on HoudiniStaticMesh_HasNormals");
static_assert(sizeof(HoudiniStaticMesh_HasNormals) == 0x000001, "Wrong size on HoudiniStaticMesh_HasNormals");
static_assert(offsetof(HoudiniStaticMesh_HasNormals, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_HasNormals::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.HasPerFaceMaterials
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_HasPerFaceMaterials final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_HasPerFaceMaterials) == 0x000001, "Wrong alignment on HoudiniStaticMesh_HasPerFaceMaterials");
static_assert(sizeof(HoudiniStaticMesh_HasPerFaceMaterials) == 0x000001, "Wrong size on HoudiniStaticMesh_HasPerFaceMaterials");
static_assert(offsetof(HoudiniStaticMesh_HasPerFaceMaterials, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_HasPerFaceMaterials::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.HasTangents
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMesh_HasTangents final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_HasTangents) == 0x000001, "Wrong alignment on HoudiniStaticMesh_HasTangents");
static_assert(sizeof(HoudiniStaticMesh_HasTangents) == 0x000001, "Wrong size on HoudiniStaticMesh_HasTangents");
static_assert(offsetof(HoudiniStaticMesh_HasTangents, ReturnValue) == 0x000000, "Member 'HoudiniStaticMesh_HasTangents::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMesh.IsValid
// 0x0002 (0x0002 - 0x0000)
struct HoudiniStaticMesh_IsValid final
{
public:
	bool                                          bInSkipVertexIndicesCheck;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMesh_IsValid) == 0x000001, "Wrong alignment on HoudiniStaticMesh_IsValid");
static_assert(sizeof(HoudiniStaticMesh_IsValid) == 0x000002, "Wrong size on HoudiniStaticMesh_IsValid");
static_assert(offsetof(HoudiniStaticMesh_IsValid, bInSkipVertexIndicesCheck) == 0x000000, "Member 'HoudiniStaticMesh_IsValid::bInSkipVertexIndicesCheck' has a wrong offset!");
static_assert(offsetof(HoudiniStaticMesh_IsValid, ReturnValue) == 0x000001, "Member 'HoudiniStaticMesh_IsValid::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMeshComponent.GetMesh
// 0x0008 (0x0008 - 0x0000)
struct HoudiniStaticMeshComponent_GetMesh final
{
public:
	class UHoudiniStaticMesh*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMeshComponent_GetMesh) == 0x000008, "Wrong alignment on HoudiniStaticMeshComponent_GetMesh");
static_assert(sizeof(HoudiniStaticMeshComponent_GetMesh) == 0x000008, "Wrong size on HoudiniStaticMeshComponent_GetMesh");
static_assert(offsetof(HoudiniStaticMeshComponent_GetMesh, ReturnValue) == 0x000000, "Member 'HoudiniStaticMeshComponent_GetMesh::ReturnValue' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMeshComponent.SetHoudiniIconVisible
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMeshComponent_SetHoudiniIconVisible final
{
public:
	bool                                          bInHoudiniIconVisible;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMeshComponent_SetHoudiniIconVisible) == 0x000001, "Wrong alignment on HoudiniStaticMeshComponent_SetHoudiniIconVisible");
static_assert(sizeof(HoudiniStaticMeshComponent_SetHoudiniIconVisible) == 0x000001, "Wrong size on HoudiniStaticMeshComponent_SetHoudiniIconVisible");
static_assert(offsetof(HoudiniStaticMeshComponent_SetHoudiniIconVisible, bInHoudiniIconVisible) == 0x000000, "Member 'HoudiniStaticMeshComponent_SetHoudiniIconVisible::bInHoudiniIconVisible' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMeshComponent.SetMesh
// 0x0008 (0x0008 - 0x0000)
struct HoudiniStaticMeshComponent_SetMesh final
{
public:
	class UHoudiniStaticMesh*                     InMesh;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMeshComponent_SetMesh) == 0x000008, "Wrong alignment on HoudiniStaticMeshComponent_SetMesh");
static_assert(sizeof(HoudiniStaticMeshComponent_SetMesh) == 0x000008, "Wrong size on HoudiniStaticMeshComponent_SetMesh");
static_assert(offsetof(HoudiniStaticMeshComponent_SetMesh, InMesh) == 0x000000, "Member 'HoudiniStaticMeshComponent_SetMesh::InMesh' has a wrong offset!");

// Function HoudiniEngineRuntime.HoudiniStaticMeshComponent.IsHoudiniIconVisible
// 0x0001 (0x0001 - 0x0000)
struct HoudiniStaticMeshComponent_IsHoudiniIconVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(HoudiniStaticMeshComponent_IsHoudiniIconVisible) == 0x000001, "Wrong alignment on HoudiniStaticMeshComponent_IsHoudiniIconVisible");
static_assert(sizeof(HoudiniStaticMeshComponent_IsHoudiniIconVisible) == 0x000001, "Wrong size on HoudiniStaticMeshComponent_IsHoudiniIconVisible");
static_assert(offsetof(HoudiniStaticMeshComponent_IsHoudiniIconVisible, ReturnValue) == 0x000000, "Member 'HoudiniStaticMeshComponent_IsHoudiniIconVisible::ReturnValue' has a wrong offset!");

}

