#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniEngineRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum HoudiniEngineRuntime.EHoudiniStaticMeshMethod
// NumValues: 0x0004
enum class EHoudiniStaticMeshMethod : uint8
{
	RawMesh                                  = 0,
	FMeshDescription                         = 1,
	UHoudiniStaticMesh                       = 2,
	EHoudiniStaticMeshMethod_MAX             = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniAssetState
// NumValues: 0x000F
enum class EHoudiniAssetState : uint8
{
	NeedInstantiation                        = 0,
	NewHDA                                   = 1,
	PreInstantiation                         = 2,
	Instantiating                            = 3,
	PreCook                                  = 4,
	Cooking                                  = 5,
	PostCook                                 = 6,
	PreProcess                               = 7,
	Processing                               = 8,
	None                                     = 9,
	NeedRebuild                              = 10,
	NeedDelete                               = 11,
	Deleting                                 = 12,
	ProcessTemplate                          = 13,
	EHoudiniAssetState_MAX                   = 14,
};

// Enum HoudiniEngineRuntime.EHoudiniAssetStateResult
// NumValues: 0x0007
enum class EHoudiniAssetStateResult : uint8
{
	None                                     = 0,
	Working                                  = 1,
	Success                                  = 2,
	FinishedWithError                        = 3,
	FinishedWithFatalError                   = 4,
	Aborted                                  = 5,
	EHoudiniAssetStateResult_MAX             = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniRampInterpolationType
// NumValues: 0x0009
enum class EHoudiniRampInterpolationType : uint8
{
	InValid                                  = 18446744073709551615,
	CONSTANT                                 = 0,
	LINEAR                                   = 1,
	CATMULL_ROM                              = 2,
	MONOTONE_CUBIC                           = 3,
	BEZIER                                   = 4,
	BSPLINE                                  = 5,
	HERMITE                                  = 6,
	EHoudiniRampInterpolationType_MAX        = 7,
};

// Enum HoudiniEngineRuntime.EHoudiniLandscapeOutputBakeType
// NumValues: 0x0005
enum class EHoudiniLandscapeOutputBakeType : uint8
{
	Detachment                               = 0,
	BakeToImage                              = 1,
	BakeToWorld                              = 2,
	InValid                                  = 3,
	EHoudiniLandscapeOutputBakeType_MAX      = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniInputType
// NumValues: 0x0009
enum class EHoudiniInputType : uint8
{
	Invalid                                  = 0,
	Geometry                                 = 1,
	Curve                                    = 2,
	Asset                                    = 3,
	Landscape                                = 4,
	World                                    = 5,
	Skeletal                                 = 6,
	GeometryCollection                       = 7,
	EHoudiniInputType_MAX                    = 8,
};

// Enum HoudiniEngineRuntime.EHoudiniOutputType
// NumValues: 0x0008
enum class EHoudiniOutputType : uint8
{
	Invalid                                  = 0,
	Mesh                                     = 1,
	Instancer                                = 2,
	Landscape                                = 3,
	Curve                                    = 4,
	Skeletal                                 = 5,
	GeometryCollection                       = 6,
	EHoudiniOutputType_MAX                   = 7,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveType
// NumValues: 0x0006
enum class EHoudiniCurveType : uint8
{
	Invalid                                  = 18446744073709551615,
	Polygon                                  = 0,
	Nurbs                                    = 1,
	Bezier                                   = 2,
	Points                                   = 3,
	EHoudiniCurveType_MAX                    = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveMethod
// NumValues: 0x0005
enum class EHoudiniCurveMethod : uint8
{
	Invalid                                  = 18446744073709551615,
	CVs                                      = 0,
	Breakpoints                              = 1,
	Freehand                                 = 2,
	EHoudiniCurveMethod_MAX                  = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveBreakpointParameterization
// NumValues: 0x0005
enum class EHoudiniCurveBreakpointParameterization : uint8
{
	Invalid                                  = 18446744073709551615,
	Uniform                                  = 0,
	Chord                                    = 1,
	Centripetal                              = 2,
	EHoudiniCurveBreakpointParameterization_MAX = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniLandscapeExportType
// NumValues: 0x0004
enum class EHoudiniLandscapeExportType : uint8
{
	Heightfield                              = 0,
	Mesh                                     = 1,
	Points                                   = 2,
	EHoudiniLandscapeExportType_MAX          = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniProxyRefineResult
// NumValues: 0x0005
enum class EHoudiniProxyRefineResult : uint8
{
	Invalid                                  = 0,
	Failed                                   = 1,
	Success                                  = 2,
	Skipped                                  = 3,
	EHoudiniProxyRefineResult_MAX            = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniProxyRefineRequestResult
// NumValues: 0x0005
enum class EHoudiniProxyRefineRequestResult : uint8
{
	Invalid                                  = 0,
	None                                     = 1,
	PendingCooks                             = 2,
	Refined                                  = 3,
	EHoudiniProxyRefineRequestResult_MAX     = 4,
};

// Enum HoudiniEngineRuntime.EAttribStorageType
// NumValues: 0x0007
enum class EAttribStorageType : uint8
{
	Invalid                                  = 18446744073709551615,
	INT                                      = 0,
	INT64                                    = 1,
	FLOAT                                    = 2,
	FLOAT64                                  = 3,
	STRING                                   = 4,
	EAttribStorageType_MAX                   = 5,
};

// Enum HoudiniEngineRuntime.EAttribOwner
// NumValues: 0x0006
enum class EAttribOwner : uint8
{
	Invalid                                  = 18446744073709551615,
	Vertex                                   = 0,
	Point                                    = 1,
	Prim                                     = 2,
	Detail                                   = 3,
	EAttribOwner_MAX                         = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniGeoType
// NumValues: 0x0006
enum class EHoudiniGeoType : uint8
{
	Invalid                                  = 0,
	Default                                  = 1,
	Intermediate                             = 2,
	Input                                    = 3,
	Curve                                    = 4,
	EHoudiniGeoType_MAX                      = 5,
};

// Enum HoudiniEngineRuntime.EHoudiniPartType
// NumValues: 0x0006
enum class EHoudiniPartType : uint8
{
	Invalid                                  = 0,
	Mesh                                     = 1,
	Instancer                                = 2,
	Curve                                    = 3,
	Volume                                   = 4,
	EHoudiniPartType_MAX                     = 5,
};

// Enum HoudiniEngineRuntime.EHoudiniInstancerType
// NumValues: 0x0007
enum class EHoudiniInstancerType : uint8
{
	Invalid                                  = 0,
	ObjectInstancer                          = 1,
	PackedPrimitive                          = 2,
	AttributeInstancer                       = 3,
	OldSchoolAttributeInstancer              = 4,
	GeometryCollection                       = 5,
	EHoudiniInstancerType_MAX                = 6,
};

// Enum HoudiniEngineRuntime.EXformParameter
// NumValues: 0x000B
enum class EXformParameter : uint8
{
	TX                                       = 0,
	TY                                       = 1,
	TZ                                       = 2,
	RX                                       = 3,
	RY                                       = 4,
	RZ                                       = 5,
	SX                                       = 6,
	SY                                       = 7,
	SZ                                       = 8,
	COUNT                                    = 9,
	EXformParameter_MAX                      = 10,
};

// Enum HoudiniEngineRuntime.EHoudiniHandleType
// NumValues: 0x0004
enum class EHoudiniHandleType : uint8
{
	Xform                                    = 0,
	Bounder                                  = 1,
	Unsupported                              = 2,
	EHoudiniHandleType_MAX                   = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniInputObjectType
// NumValues: 0x0015
enum class EHoudiniInputObjectType : uint8
{
	Invalid                                  = 0,
	Object                                   = 1,
	StaticMesh                               = 2,
	SkeletalMesh                             = 3,
	SceneComponent                           = 4,
	StaticMeshComponent                      = 5,
	InstancedStaticMeshComponent             = 6,
	SplineComponent                          = 7,
	HoudiniSplineComponent                   = 8,
	HoudiniAssetComponent                    = 9,
	Actor                                    = 10,
	Landscape                                = 11,
	Brush                                    = 12,
	CameraComponent                          = 13,
	DataTable                                = 14,
	HoudiniAssetActor                        = 15,
	FoliageType_InstancedStaticMesh          = 16,
	GeometryCollection                       = 17,
	GeometryCollectionComponent              = 18,
	GeometryCollectionActor                  = 19,
	EHoudiniInputObjectType_MAX              = 20,
};

// Enum HoudiniEngineRuntime.EHoudiniXformType
// NumValues: 0x0004
enum class EHoudiniXformType : uint8
{
	None                                     = 0,
	IntoThisObject                           = 1,
	Auto                                     = 2,
	EHoudiniXformType_MAX                    = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniCurveOutputType
// NumValues: 0x0003
enum class EHoudiniCurveOutputType : uint8
{
	UnrealSpline                             = 0,
	HoudiniSpline                            = 1,
	EHoudiniCurveOutputType_MAX              = 2,
};

// Enum HoudiniEngineRuntime.EHoudiniParameterType
// NumValues: 0x0018
enum class EHoudiniParameterType : uint8
{
	Invalid                                  = 0,
	Button                                   = 1,
	ButtonStrip                              = 2,
	Color                                    = 3,
	ColorRamp                                = 4,
	File                                     = 5,
	FileDir                                  = 6,
	FileGeo                                  = 7,
	FileImage                                = 8,
	Float                                    = 9,
	FloatRamp                                = 10,
	Folder                                   = 11,
	FolderList                               = 12,
	Input                                    = 13,
	Int                                      = 14,
	IntChoice                                = 15,
	Label                                    = 16,
	MultiParm                                = 17,
	Separator                                = 18,
	String                                   = 19,
	StringChoice                             = 20,
	StringAssetRef                           = 21,
	Toggle                                   = 22,
	EHoudiniParameterType_MAX                = 23,
};

// Enum HoudiniEngineRuntime.EHoudiniFolderParameterType
// NumValues: 0x0007
enum class EHoudiniFolderParameterType : uint8
{
	Invalid                                  = 0,
	Collapsible                              = 1,
	Simple                                   = 2,
	Tabs                                     = 3,
	Radio                                    = 4,
	Other                                    = 5,
	EHoudiniFolderParameterType_MAX          = 6,
};

// Enum HoudiniEngineRuntime.EHoudiniMultiParmModificationType
// NumValues: 0x0005
enum class EHoudiniMultiParmModificationType : uint8
{
	None                                     = 0,
	Inserted                                 = 1,
	Removed                                  = 2,
	Modified                                 = 3,
	EHoudiniMultiParmModificationType_MAX    = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniRampPointConstructStatus
// NumValues: 0x0006
enum class EHoudiniRampPointConstructStatus : uint8
{
	None                                     = 0,
	INITIALIZED                              = 1,
	POSITION_INSERTED                        = 2,
	VALUE_INSERTED                           = 3,
	INTERPTYPE_INSERTED                      = 4,
	EHoudiniRampPointConstructStatus_MAX     = 5,
};

// Enum HoudiniEngineRuntime.EPDGLinkState
// NumValues: 0x0005
enum class EPDGLinkState : uint8
{
	Inactive                                 = 0,
	Linking                                  = 1,
	Linked                                   = 2,
	Error_Not_Linked                         = 3,
	EPDGLinkState_MAX                        = 4,
};

// Enum HoudiniEngineRuntime.EPDGNodeState
// NumValues: 0x0007
enum class EPDGNodeState : uint8
{
	None                                     = 0,
	Dirtied                                  = 1,
	Dirtying                                 = 2,
	Cooking                                  = 3,
	Cook_Complete                            = 4,
	Cook_Failed                              = 5,
	EPDGNodeState_MAX                        = 6,
};

// Enum HoudiniEngineRuntime.EPDGWorkResultState
// NumValues: 0x0009
enum class EPDGWorkResultState : uint8
{
	None                                     = 0,
	ToLoad                                   = 1,
	Loading                                  = 2,
	Loaded                                   = 3,
	ToDelete                                 = 4,
	Deleting                                 = 5,
	Deleted                                  = 6,
	NotLoaded                                = 7,
	EPDGWorkResultState_MAX                  = 8,
};

// Enum HoudiniEngineRuntime.EHoudiniRuntimeSettingsSessionType
// NumValues: 0x0005
enum class EHoudiniRuntimeSettingsSessionType : uint8
{
	HRSST_InProcess                          = 0,
	HRSST_Socket                             = 1,
	HRSST_NamedPipe                          = 2,
	HRSST_None                               = 3,
	HRSST_MAX                                = 4,
};

// Enum HoudiniEngineRuntime.EHoudiniRuntimeSettingsRecomputeFlag
// NumValues: 0x0004
enum class EHoudiniRuntimeSettingsRecomputeFlag : uint8
{
	HRSRF_Always                             = 0,
	HRSRF_OnlyIfMissing                      = 1,
	HRSRF_Never                              = 2,
	HRSRF_MAX                                = 3,
};

// Enum HoudiniEngineRuntime.EHoudiniExecutableType
// NumValues: 0x0005
enum class EHoudiniExecutableType : uint8
{
	HRSHE_Houdini                            = 0,
	HRSHE_HoudiniFX                          = 1,
	HRSHE_HoudiniCore                        = 2,
	HRSHE_HoudiniIndie                       = 3,
	HRSHE_MAX                                = 4,
};

// ScriptStruct HoudiniEngineRuntime.HoudiniGenericAttribute
// 0x0050 (0x0050 - 0x0000)
struct FHoudiniGenericAttribute final
{
public:
	class FString                                 AttributeName;                                     // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttribStorageType                            AttributeType;                                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttribOwner                                  AttributeOwner;                                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttributeCount;                                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AttributeTupleSize;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                DoubleValues;                                      // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 IntValues;                                         // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringValues;                                      // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniGenericAttribute) == 0x000008, "Wrong alignment on FHoudiniGenericAttribute");
static_assert(sizeof(FHoudiniGenericAttribute) == 0x000050, "Wrong size on FHoudiniGenericAttribute");
static_assert(offsetof(FHoudiniGenericAttribute, AttributeName) == 0x000000, "Member 'FHoudiniGenericAttribute::AttributeName' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, AttributeType) == 0x000010, "Member 'FHoudiniGenericAttribute::AttributeType' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, AttributeOwner) == 0x000011, "Member 'FHoudiniGenericAttribute::AttributeOwner' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, AttributeCount) == 0x000014, "Member 'FHoudiniGenericAttribute::AttributeCount' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, AttributeTupleSize) == 0x000018, "Member 'FHoudiniGenericAttribute::AttributeTupleSize' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, DoubleValues) == 0x000020, "Member 'FHoudiniGenericAttribute::DoubleValues' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, IntValues) == 0x000030, "Member 'FHoudiniGenericAttribute::IntValues' has a wrong offset!");
static_assert(offsetof(FHoudiniGenericAttribute, StringValues) == 0x000040, "Member 'FHoudiniGenericAttribute::StringValues' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniCurveOutputProperties
// 0x000C (0x000C - 0x0000)
struct FHoudiniCurveOutputProperties final
{
public:
	EHoudiniCurveOutputType                       CurveOutputType;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumPoints;                                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosed;                                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniCurveType                             CurveType;                                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniCurveMethod                           CurveMethod;                                       // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniCurveOutputProperties) == 0x000004, "Wrong alignment on FHoudiniCurveOutputProperties");
static_assert(sizeof(FHoudiniCurveOutputProperties) == 0x00000C, "Wrong size on FHoudiniCurveOutputProperties");
static_assert(offsetof(FHoudiniCurveOutputProperties, CurveOutputType) == 0x000000, "Member 'FHoudiniCurveOutputProperties::CurveOutputType' has a wrong offset!");
static_assert(offsetof(FHoudiniCurveOutputProperties, NumPoints) == 0x000004, "Member 'FHoudiniCurveOutputProperties::NumPoints' has a wrong offset!");
static_assert(offsetof(FHoudiniCurveOutputProperties, bClosed) == 0x000008, "Member 'FHoudiniCurveOutputProperties::bClosed' has a wrong offset!");
static_assert(offsetof(FHoudiniCurveOutputProperties, CurveType) == 0x000009, "Member 'FHoudiniCurveOutputProperties::CurveType' has a wrong offset!");
static_assert(offsetof(FHoudiniCurveOutputProperties, CurveMethod) == 0x00000A, "Member 'FHoudiniCurveOutputProperties::CurveMethod' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniOutputObject
// 0x00F8 (0x00F8 - 0x0000)
struct FHoudiniOutputObject final
{
public:
	class UObject*                                OutputObject;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OutputComponent;                                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ProxyObject;                                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ProxyComponent;                                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProxyIsCurrent;                                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsImplicit;                                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsGeometryCollectionPiece;                        // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GeometryCollectionPieceName;                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BakeName;                                          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHoudiniCurveOutputProperties          CurveOutputProperty;                               // 0x0048(0x000C)(NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, class FString>            CachedAttributes;                                  // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            CachedTokens;                                      // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniOutputObject) == 0x000008, "Wrong alignment on FHoudiniOutputObject");
static_assert(sizeof(FHoudiniOutputObject) == 0x0000F8, "Wrong size on FHoudiniOutputObject");
static_assert(offsetof(FHoudiniOutputObject, OutputObject) == 0x000000, "Member 'FHoudiniOutputObject::OutputObject' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, OutputComponent) == 0x000008, "Member 'FHoudiniOutputObject::OutputComponent' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, ProxyObject) == 0x000010, "Member 'FHoudiniOutputObject::ProxyObject' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, ProxyComponent) == 0x000018, "Member 'FHoudiniOutputObject::ProxyComponent' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, bProxyIsCurrent) == 0x000020, "Member 'FHoudiniOutputObject::bProxyIsCurrent' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, bIsImplicit) == 0x000021, "Member 'FHoudiniOutputObject::bIsImplicit' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, bIsGeometryCollectionPiece) == 0x000022, "Member 'FHoudiniOutputObject::bIsGeometryCollectionPiece' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, GeometryCollectionPieceName) == 0x000028, "Member 'FHoudiniOutputObject::GeometryCollectionPieceName' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, BakeName) == 0x000038, "Member 'FHoudiniOutputObject::BakeName' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, CurveOutputProperty) == 0x000048, "Member 'FHoudiniOutputObject::CurveOutputProperty' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, CachedAttributes) == 0x000058, "Member 'FHoudiniOutputObject::CachedAttributes' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObject, CachedTokens) == 0x0000A8, "Member 'FHoudiniOutputObject::CachedTokens' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniAssetBlueprintOutput
// 0x0100 (0x0100 - 0x0000)
struct FHoudiniAssetBlueprintOutput final
{
public:
	int32                                         OutputIndex;                                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHoudiniOutputObject                   OutputObject;                                      // 0x0008(0x00F8)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniAssetBlueprintOutput) == 0x000008, "Wrong alignment on FHoudiniAssetBlueprintOutput");
static_assert(sizeof(FHoudiniAssetBlueprintOutput) == 0x000100, "Wrong size on FHoudiniAssetBlueprintOutput");
static_assert(offsetof(FHoudiniAssetBlueprintOutput, OutputIndex) == 0x000000, "Member 'FHoudiniAssetBlueprintOutput::OutputIndex' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintOutput, OutputObject) == 0x000008, "Member 'FHoudiniAssetBlueprintOutput::OutputObject' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniObjectInfo
// 0x0028 (0x0028 - 0x0000)
struct alignas(0x08) FHoudiniObjectInfo final
{
public:
	uint8                                         Pad_0[0x28];                                       // 0x0000(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniObjectInfo) == 0x000008, "Wrong alignment on FHoudiniObjectInfo");
static_assert(sizeof(FHoudiniObjectInfo) == 0x000028, "Wrong size on FHoudiniObjectInfo");

// ScriptStruct HoudiniEngineRuntime.HoudiniOutputObjectIdentifier
// 0x0040 (0x0040 - 0x0000)
struct FHoudiniOutputObjectIdentifier final
{
public:
	int32                                         ObjectId;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GeoId;                                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartId;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplitIdentifier;                                   // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartName;                                          // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrimitiveIndex;                                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointIndex;                                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniOutputObjectIdentifier) == 0x000008, "Wrong alignment on FHoudiniOutputObjectIdentifier");
static_assert(sizeof(FHoudiniOutputObjectIdentifier) == 0x000040, "Wrong size on FHoudiniOutputObjectIdentifier");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, ObjectId) == 0x000000, "Member 'FHoudiniOutputObjectIdentifier::ObjectId' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, GeoId) == 0x000004, "Member 'FHoudiniOutputObjectIdentifier::GeoId' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, PartId) == 0x000008, "Member 'FHoudiniOutputObjectIdentifier::PartId' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, SplitIdentifier) == 0x000010, "Member 'FHoudiniOutputObjectIdentifier::SplitIdentifier' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, PartName) == 0x000020, "Member 'FHoudiniOutputObjectIdentifier::PartName' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, PrimitiveIndex) == 0x000030, "Member 'FHoudiniOutputObjectIdentifier::PrimitiveIndex' has a wrong offset!");
static_assert(offsetof(FHoudiniOutputObjectIdentifier, PointIndex) == 0x000034, "Member 'FHoudiniOutputObjectIdentifier::PointIndex' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniAssetBlueprintInstanceData
// 0x00B8 (0x0120 - 0x0068)
struct FHoudiniAssetBlueprintInstanceData final : public FActorComponentInstanceData
{
public:
	class UHoudiniAsset*                          HoudiniAsset;                                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AssetId;                                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniAssetState                            AssetState;                                        // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SubAssetIndex;                                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        AssetCookCount;                                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenLoaded;                                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasBeenDuplicated;                                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPendingDelete;                                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecookRequested;                                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRebuildRequested;                                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableCooking;                                    // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceNeedUpdate;                                  // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastCookSuccess;                                  // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ComponentGUID;                                     // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  HapiGUID;                                          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisteredComponentTemplate;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SourceName;                                        // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FHoudiniOutputObjectIdentifier, struct FHoudiniAssetBlueprintOutput> Outputs;                                           // 0x00C0(0x0050)(NativeAccessSpecifierPublic)
	TArray<class UHoudiniInput*>                  Inputs;                                            // 0x0110(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniAssetBlueprintInstanceData) == 0x000008, "Wrong alignment on FHoudiniAssetBlueprintInstanceData");
static_assert(sizeof(FHoudiniAssetBlueprintInstanceData) == 0x000120, "Wrong size on FHoudiniAssetBlueprintInstanceData");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, HoudiniAsset) == 0x000068, "Member 'FHoudiniAssetBlueprintInstanceData::HoudiniAsset' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, AssetId) == 0x000070, "Member 'FHoudiniAssetBlueprintInstanceData::AssetId' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, AssetState) == 0x000074, "Member 'FHoudiniAssetBlueprintInstanceData::AssetState' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, SubAssetIndex) == 0x000078, "Member 'FHoudiniAssetBlueprintInstanceData::SubAssetIndex' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, AssetCookCount) == 0x00007C, "Member 'FHoudiniAssetBlueprintInstanceData::AssetCookCount' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bHasBeenLoaded) == 0x000080, "Member 'FHoudiniAssetBlueprintInstanceData::bHasBeenLoaded' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bHasBeenDuplicated) == 0x000081, "Member 'FHoudiniAssetBlueprintInstanceData::bHasBeenDuplicated' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bPendingDelete) == 0x000082, "Member 'FHoudiniAssetBlueprintInstanceData::bPendingDelete' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bRecookRequested) == 0x000083, "Member 'FHoudiniAssetBlueprintInstanceData::bRecookRequested' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bRebuildRequested) == 0x000084, "Member 'FHoudiniAssetBlueprintInstanceData::bRebuildRequested' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bEnableCooking) == 0x000085, "Member 'FHoudiniAssetBlueprintInstanceData::bEnableCooking' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bForceNeedUpdate) == 0x000086, "Member 'FHoudiniAssetBlueprintInstanceData::bForceNeedUpdate' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bLastCookSuccess) == 0x000087, "Member 'FHoudiniAssetBlueprintInstanceData::bLastCookSuccess' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, ComponentGUID) == 0x000088, "Member 'FHoudiniAssetBlueprintInstanceData::ComponentGUID' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, HapiGUID) == 0x000098, "Member 'FHoudiniAssetBlueprintInstanceData::HapiGUID' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, bRegisteredComponentTemplate) == 0x0000A8, "Member 'FHoudiniAssetBlueprintInstanceData::bRegisteredComponentTemplate' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, SourceName) == 0x0000B0, "Member 'FHoudiniAssetBlueprintInstanceData::SourceName' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, Outputs) == 0x0000C0, "Member 'FHoudiniAssetBlueprintInstanceData::Outputs' has a wrong offset!");
static_assert(offsetof(FHoudiniAssetBlueprintInstanceData, Inputs) == 0x000110, "Member 'FHoudiniAssetBlueprintInstanceData::Inputs' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniGenericAttributeChangedProperty
// 0x0098 (0x0098 - 0x0000)
struct FHoudiniGenericAttributeChangedProperty final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x90];                                       // 0x0008(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniGenericAttributeChangedProperty) == 0x000008, "Wrong alignment on FHoudiniGenericAttributeChangedProperty");
static_assert(sizeof(FHoudiniGenericAttributeChangedProperty) == 0x000098, "Wrong size on FHoudiniGenericAttributeChangedProperty");
static_assert(offsetof(FHoudiniGenericAttributeChangedProperty, Object) == 0x000000, "Member 'FHoudiniGenericAttributeChangedProperty::Object' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniGeoInfo
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FHoudiniGeoInfo final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniGeoInfo) == 0x000008, "Wrong alignment on FHoudiniGeoInfo");
static_assert(sizeof(FHoudiniGeoInfo) == 0x000030, "Wrong size on FHoudiniGeoInfo");

// ScriptStruct HoudiniEngineRuntime.HoudiniPartInfo
// 0x0048 (0x0048 - 0x0000)
struct alignas(0x08) FHoudiniPartInfo final
{
public:
	uint8                                         Pad_0[0x48];                                       // 0x0000(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniPartInfo) == 0x000008, "Wrong alignment on FHoudiniPartInfo");
static_assert(sizeof(FHoudiniPartInfo) == 0x000048, "Wrong size on FHoudiniPartInfo");

// ScriptStruct HoudiniEngineRuntime.HoudiniVolumeInfo
// 0x00B0 (0x00B0 - 0x0000)
struct alignas(0x10) FHoudiniVolumeInfo final
{
public:
	uint8                                         Pad_0[0xB0];                                       // 0x0000(0x00B0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniVolumeInfo) == 0x000010, "Wrong alignment on FHoudiniVolumeInfo");
static_assert(sizeof(FHoudiniVolumeInfo) == 0x0000B0, "Wrong size on FHoudiniVolumeInfo");

// ScriptStruct HoudiniEngineRuntime.HoudiniCurveInfo
// 0x001C (0x001C - 0x0000)
struct alignas(0x04) FHoudiniCurveInfo final
{
public:
	uint8                                         Pad_0[0x1C];                                       // 0x0000(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniCurveInfo) == 0x000004, "Wrong alignment on FHoudiniCurveInfo");
static_assert(sizeof(FHoudiniCurveInfo) == 0x00001C, "Wrong size on FHoudiniCurveInfo");

// ScriptStruct HoudiniEngineRuntime.HoudiniMeshSocket
// 0x0090 (0x0090 - 0x0000)
struct alignas(0x10) FHoudiniMeshSocket final
{
public:
	uint8                                         Pad_0[0x90];                                       // 0x0000(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniMeshSocket) == 0x000010, "Wrong alignment on FHoudiniMeshSocket");
static_assert(sizeof(FHoudiniMeshSocket) == 0x000090, "Wrong size on FHoudiniMeshSocket");

// ScriptStruct HoudiniEngineRuntime.HoudiniGeoPartObject
// 0x0290 (0x0290 - 0x0000)
struct FHoudiniGeoPartObject final
{
public:
	int32                                         AssetId;                                           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AssetName;                                         // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ObjectId;                                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ObjectName;                                        // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GeoId;                                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PartId;                                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartName;                                          // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCustomPartName;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SplitGroups;                                       // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTransform                             TransformMatrix;                                   // 0x0060(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 NodePath;                                          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniPartType                              Type;                                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHoudiniInstancerType                         InstancerType;                                     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VolumeName;                                        // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasEditLayers;                                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VolumeLayerName;                                   // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VolumeTileIndex;                                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsVisible;                                        // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEditable;                                       // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTemplated;                                      // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInstanced;                                      // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasGeoChanged;                                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasPartChanged;                                   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasTransformChanged;                              // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasMaterialsChanged;                              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C[0x174];                                    // 0x010C(0x0174)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHoudiniMeshSocket>             AllMeshSockets;                                    // 0x0280(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniGeoPartObject) == 0x000010, "Wrong alignment on FHoudiniGeoPartObject");
static_assert(sizeof(FHoudiniGeoPartObject) == 0x000290, "Wrong size on FHoudiniGeoPartObject");
static_assert(offsetof(FHoudiniGeoPartObject, AssetId) == 0x000000, "Member 'FHoudiniGeoPartObject::AssetId' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, AssetName) == 0x000008, "Member 'FHoudiniGeoPartObject::AssetName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, ObjectId) == 0x000018, "Member 'FHoudiniGeoPartObject::ObjectId' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, ObjectName) == 0x000020, "Member 'FHoudiniGeoPartObject::ObjectName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, GeoId) == 0x000030, "Member 'FHoudiniGeoPartObject::GeoId' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, PartId) == 0x000034, "Member 'FHoudiniGeoPartObject::PartId' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, PartName) == 0x000038, "Member 'FHoudiniGeoPartObject::PartName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasCustomPartName) == 0x000048, "Member 'FHoudiniGeoPartObject::bHasCustomPartName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, SplitGroups) == 0x000050, "Member 'FHoudiniGeoPartObject::SplitGroups' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, TransformMatrix) == 0x000060, "Member 'FHoudiniGeoPartObject::TransformMatrix' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, NodePath) == 0x0000C0, "Member 'FHoudiniGeoPartObject::NodePath' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, Type) == 0x0000D0, "Member 'FHoudiniGeoPartObject::Type' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, InstancerType) == 0x0000D1, "Member 'FHoudiniGeoPartObject::InstancerType' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, VolumeName) == 0x0000D8, "Member 'FHoudiniGeoPartObject::VolumeName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasEditLayers) == 0x0000E8, "Member 'FHoudiniGeoPartObject::bHasEditLayers' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, VolumeLayerName) == 0x0000F0, "Member 'FHoudiniGeoPartObject::VolumeLayerName' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, VolumeTileIndex) == 0x000100, "Member 'FHoudiniGeoPartObject::VolumeTileIndex' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bIsVisible) == 0x000104, "Member 'FHoudiniGeoPartObject::bIsVisible' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bIsEditable) == 0x000105, "Member 'FHoudiniGeoPartObject::bIsEditable' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bIsTemplated) == 0x000106, "Member 'FHoudiniGeoPartObject::bIsTemplated' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bIsInstanced) == 0x000107, "Member 'FHoudiniGeoPartObject::bIsInstanced' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasGeoChanged) == 0x000108, "Member 'FHoudiniGeoPartObject::bHasGeoChanged' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasPartChanged) == 0x000109, "Member 'FHoudiniGeoPartObject::bHasPartChanged' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasTransformChanged) == 0x00010A, "Member 'FHoudiniGeoPartObject::bHasTransformChanged' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, bHasMaterialsChanged) == 0x00010B, "Member 'FHoudiniGeoPartObject::bHasMaterialsChanged' has a wrong offset!");
static_assert(offsetof(FHoudiniGeoPartObject, AllMeshSockets) == 0x000280, "Member 'FHoudiniGeoPartObject::AllMeshSockets' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniBrushInfo
// 0x00B0 (0x00B0 - 0x0000)
struct FHoudiniBrushInfo final
{
public:
	TWeakObjectPtr<class ABrush>                  BrushActor;                                        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedTransform;                                   // 0x0010(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                CachedOrigin;                                      // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CachedExtent;                                      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBrushType                                    CachedBrushType;                                   // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        CachedSurfaceHash;                                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniBrushInfo) == 0x000010, "Wrong alignment on FHoudiniBrushInfo");
static_assert(sizeof(FHoudiniBrushInfo) == 0x0000B0, "Wrong size on FHoudiniBrushInfo");
static_assert(offsetof(FHoudiniBrushInfo, BrushActor) == 0x000000, "Member 'FHoudiniBrushInfo::BrushActor' has a wrong offset!");
static_assert(offsetof(FHoudiniBrushInfo, CachedTransform) == 0x000010, "Member 'FHoudiniBrushInfo::CachedTransform' has a wrong offset!");
static_assert(offsetof(FHoudiniBrushInfo, CachedOrigin) == 0x000070, "Member 'FHoudiniBrushInfo::CachedOrigin' has a wrong offset!");
static_assert(offsetof(FHoudiniBrushInfo, CachedExtent) == 0x000088, "Member 'FHoudiniBrushInfo::CachedExtent' has a wrong offset!");
static_assert(offsetof(FHoudiniBrushInfo, CachedBrushType) == 0x0000A0, "Member 'FHoudiniBrushInfo::CachedBrushType' has a wrong offset!");
static_assert(offsetof(FHoudiniBrushInfo, CachedSurfaceHash) == 0x0000A8, "Member 'FHoudiniBrushInfo::CachedSurfaceHash' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniBakedOutputObjectIdentifier
// 0x0018 (0x0018 - 0x0000)
struct FHoudiniBakedOutputObjectIdentifier final
{
public:
	int32                                         PartId;                                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SplitIdentifier;                                   // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHoudiniBakedOutputObjectIdentifier) == 0x000008, "Wrong alignment on FHoudiniBakedOutputObjectIdentifier");
static_assert(sizeof(FHoudiniBakedOutputObjectIdentifier) == 0x000018, "Wrong size on FHoudiniBakedOutputObjectIdentifier");
static_assert(offsetof(FHoudiniBakedOutputObjectIdentifier, PartId) == 0x000000, "Member 'FHoudiniBakedOutputObjectIdentifier::PartId' has a wrong offset!");
static_assert(offsetof(FHoudiniBakedOutputObjectIdentifier, SplitIdentifier) == 0x000008, "Member 'FHoudiniBakedOutputObjectIdentifier::SplitIdentifier' has a wrong offset!");

// ScriptStruct HoudiniEngineRuntime.HoudiniInstancedOutput
// 0x0088 (0x0088 - 0x0000)
struct FHoudiniInstancedOutput final
{
public:
	TSoftObjectPtr<class UObject>                 OriginalObject;                                    // 0x0000(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OriginalObjectIndex;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     OriginalTransforms;                                // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UObject>>         VariationObjects;                                  // 0x0040(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     VariationTransformOffsets;                         // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 TransformVariationIndices;                         // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 OriginalInstanceIndices;                           // 0x0070(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bChanged;                                          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStale;                                            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHoudiniInstancedOutput) == 0x000008, "Wrong alignment on FHoudiniInstancedOutput");
static_assert(sizeof(FHoudiniInstancedOutput) == 0x000088, "Wrong size on FHoudiniInstancedOutput");
static_assert(offsetof(FHoudiniInstancedOutput, OriginalObject) == 0x000000, "Member 'FHoudiniInstancedOutput::OriginalObject' has a wrong offset!");
static_assert(offsetof(FHoudiniInstancedOutput, OriginalObjectIndex) == 0x000028, "Member 'FHoudiniInstancedOutput::OriginalObjectIndex' has a wrong offset!");
static_assert(offsetof(FHoudiniInstancedOutput, OriginalTransforms) == 0x000030, "Member 'FHoudiniInstancedOutput::OriginalTransforms' has a wrong offset!");
static_assert(offsetof(FHoudiniInstancedOutput, VariationObjects) == 0x000040, "Member 'FHoudiniInstancedOutput::VariationObjects' has a wrong offset!");
