#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptUMG

#include "Basic.hpp"

#include "JavascriptUMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// DelegateFunction JavascriptUMG.JavascriptComboButton.OnGetContent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct JavascriptComboButton_OnGetContent__DelegateSignature final
{
public:
	struct FJavascriptSlateWidget                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComboButton_OnGetContent__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptComboButton_OnGetContent__DelegateSignature");
static_assert(sizeof(JavascriptComboButton_OnGetContent__DelegateSignature) == 0x000010, "Wrong size on JavascriptComboButton_OnGetContent__DelegateSignature");
static_assert(offsetof(JavascriptComboButton_OnGetContent__DelegateSignature, ReturnValue) == 0x000000, "Member 'JavascriptComboButton_OnGetContent__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptComboButton.OnIsOpenChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct JavascriptComboButton_OnIsOpenChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComboButton_OnIsOpenChanged__DelegateSignature) == 0x000001, "Wrong alignment on JavascriptComboButton_OnIsOpenChanged__DelegateSignature");
static_assert(sizeof(JavascriptComboButton_OnIsOpenChanged__DelegateSignature) == 0x000001, "Wrong size on JavascriptComboButton_OnIsOpenChanged__DelegateSignature");
static_assert(offsetof(JavascriptComboButton_OnIsOpenChanged__DelegateSignature, Value) == 0x000000, "Member 'JavascriptComboButton_OnIsOpenChanged__DelegateSignature::Value' has a wrong offset!");

// Function JavascriptUMG.JavascriptComboButton.SetIsOpen
// 0x0002 (0x0002 - 0x0000)
struct JavascriptComboButton_SetIsOpen final
{
public:
	bool                                          InIsOpen;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFocusMenu;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComboButton_SetIsOpen) == 0x000001, "Wrong alignment on JavascriptComboButton_SetIsOpen");
static_assert(sizeof(JavascriptComboButton_SetIsOpen) == 0x000002, "Wrong size on JavascriptComboButton_SetIsOpen");
static_assert(offsetof(JavascriptComboButton_SetIsOpen, InIsOpen) == 0x000000, "Member 'JavascriptComboButton_SetIsOpen::InIsOpen' has a wrong offset!");
static_assert(offsetof(JavascriptComboButton_SetIsOpen, bFocusMenu) == 0x000001, "Member 'JavascriptComboButton_SetIsOpen::bFocusMenu' has a wrong offset!");

// Function JavascriptUMG.JavascriptTextModel.CreateRun
// 0x0390 (0x0390 - 0x0000)
struct JavascriptTextModel_CreateRun final
{
public:
	struct FTextBlockStyle                        MessageTextStyle;                                  // 0x0000(0x0370)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         BeginIndex;                                        // 0x0370(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndIndex;                                          // 0x0374(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJavascriptSlateTextRun                ReturnValue;                                       // 0x0378(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTextModel_CreateRun) == 0x000010, "Wrong alignment on JavascriptTextModel_CreateRun");
static_assert(sizeof(JavascriptTextModel_CreateRun) == 0x000390, "Wrong size on JavascriptTextModel_CreateRun");
static_assert(offsetof(JavascriptTextModel_CreateRun, MessageTextStyle) == 0x000000, "Member 'JavascriptTextModel_CreateRun::MessageTextStyle' has a wrong offset!");
static_assert(offsetof(JavascriptTextModel_CreateRun, BeginIndex) == 0x000370, "Member 'JavascriptTextModel_CreateRun::BeginIndex' has a wrong offset!");
static_assert(offsetof(JavascriptTextModel_CreateRun, EndIndex) == 0x000374, "Member 'JavascriptTextModel_CreateRun::EndIndex' has a wrong offset!");
static_assert(offsetof(JavascriptTextModel_CreateRun, ReturnValue) == 0x000378, "Member 'JavascriptTextModel_CreateRun::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTextModel.GetString
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTextModel_GetString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTextModel_GetString) == 0x000008, "Wrong alignment on JavascriptTextModel_GetString");
static_assert(sizeof(JavascriptTextModel_GetString) == 0x000010, "Wrong size on JavascriptTextModel_GetString");
static_assert(offsetof(JavascriptTextModel_GetString, ReturnValue) == 0x000000, "Member 'JavascriptTextModel_GetString::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTextModel.SetString
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTextModel_SetString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTextModel_SetString) == 0x000008, "Wrong alignment on JavascriptTextModel_SetString");
static_assert(sizeof(JavascriptTextModel_SetString) == 0x000010, "Wrong size on JavascriptTextModel_SetString");
static_assert(offsetof(JavascriptTextModel_SetString, String) == 0x000000, "Member 'JavascriptTextModel_SetString::String' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptMultiLineEditableTextBox.GetText__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct JavascriptMultiLineEditableTextBox_GetText__DelegateSignature final
{
public:
	struct FJavascriptTextLayout                  TextLayout;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptMultiLineEditableTextBox_GetText__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptMultiLineEditableTextBox_GetText__DelegateSignature");
static_assert(sizeof(JavascriptMultiLineEditableTextBox_GetText__DelegateSignature) == 0x000030, "Wrong size on JavascriptMultiLineEditableTextBox_GetText__DelegateSignature");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_GetText__DelegateSignature, TextLayout) == 0x000000, "Member 'JavascriptMultiLineEditableTextBox_GetText__DelegateSignature::TextLayout' has a wrong offset!");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_GetText__DelegateSignature, ReturnValue) == 0x000020, "Member 'JavascriptMultiLineEditableTextBox_GetText__DelegateSignature::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptMultiLineEditableTextBox.GoTo
// 0x0008 (0x0008 - 0x0000)
struct JavascriptMultiLineEditableTextBox_GoTo final
{
public:
	int32                                         Line;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptMultiLineEditableTextBox_GoTo) == 0x000004, "Wrong alignment on JavascriptMultiLineEditableTextBox_GoTo");
static_assert(sizeof(JavascriptMultiLineEditableTextBox_GoTo) == 0x000008, "Wrong size on JavascriptMultiLineEditableTextBox_GoTo");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_GoTo, Line) == 0x000000, "Member 'JavascriptMultiLineEditableTextBox_GoTo::Line' has a wrong offset!");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_GoTo, Offset) == 0x000004, "Member 'JavascriptMultiLineEditableTextBox_GoTo::Offset' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptMultiLineEditableTextBox.OnVScrollBarUserScrolled__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature final
{
public:
	float                                         Offset;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature");
static_assert(sizeof(JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature) == 0x000004, "Wrong size on JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature, Offset) == 0x000000, "Member 'JavascriptMultiLineEditableTextBox_OnVScrollBarUserScrolled__DelegateSignature::Offset' has a wrong offset!");

// Function JavascriptUMG.JavascriptMultiLineEditableTextBox.ScrollTo
// 0x0008 (0x0008 - 0x0000)
struct JavascriptMultiLineEditableTextBox_ScrollTo final
{
public:
	int32                                         Line;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptMultiLineEditableTextBox_ScrollTo) == 0x000004, "Wrong alignment on JavascriptMultiLineEditableTextBox_ScrollTo");
static_assert(sizeof(JavascriptMultiLineEditableTextBox_ScrollTo) == 0x000008, "Wrong size on JavascriptMultiLineEditableTextBox_ScrollTo");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_ScrollTo, Line) == 0x000000, "Member 'JavascriptMultiLineEditableTextBox_ScrollTo::Line' has a wrong offset!");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_ScrollTo, Offset) == 0x000004, "Member 'JavascriptMultiLineEditableTextBox_ScrollTo::Offset' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptMultiLineEditableTextBox.SetText__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct JavascriptMultiLineEditableTextBox_SetText__DelegateSignature final
{
public:
	class FString                                 InText;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJavascriptTextLayout                  TextLayout;                                        // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptMultiLineEditableTextBox_SetText__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptMultiLineEditableTextBox_SetText__DelegateSignature");
static_assert(sizeof(JavascriptMultiLineEditableTextBox_SetText__DelegateSignature) == 0x000030, "Wrong size on JavascriptMultiLineEditableTextBox_SetText__DelegateSignature");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_SetText__DelegateSignature, InText) == 0x000000, "Member 'JavascriptMultiLineEditableTextBox_SetText__DelegateSignature::InText' has a wrong offset!");
static_assert(offsetof(JavascriptMultiLineEditableTextBox_SetText__DelegateSignature, TextLayout) == 0x000010, "Member 'JavascriptMultiLineEditableTextBox_SetText__DelegateSignature::TextLayout' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.SetViewLocation
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGameViewport_SetViewLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_SetViewLocation) == 0x000008, "Wrong alignment on JavascriptGameViewport_SetViewLocation");
static_assert(sizeof(JavascriptGameViewport_SetViewLocation) == 0x000018, "Wrong size on JavascriptGameViewport_SetViewLocation");
static_assert(offsetof(JavascriptGameViewport_SetViewLocation, Location) == 0x000000, "Member 'JavascriptGameViewport_SetViewLocation::Location' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.SetViewRotation
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGameViewport_SetViewRotation final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_SetViewRotation) == 0x000008, "Wrong alignment on JavascriptGameViewport_SetViewRotation");
static_assert(sizeof(JavascriptGameViewport_SetViewRotation) == 0x000018, "Wrong size on JavascriptGameViewport_SetViewRotation");
static_assert(offsetof(JavascriptGameViewport_SetViewRotation, Rotation) == 0x000000, "Member 'JavascriptGameViewport_SetViewRotation::Rotation' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.Spawn
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGameViewport_Spawn final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_Spawn) == 0x000008, "Wrong alignment on JavascriptGameViewport_Spawn");
static_assert(sizeof(JavascriptGameViewport_Spawn) == 0x000010, "Wrong size on JavascriptGameViewport_Spawn");
static_assert(offsetof(JavascriptGameViewport_Spawn, ActorClass) == 0x000000, "Member 'JavascriptGameViewport_Spawn::ActorClass' has a wrong offset!");
static_assert(offsetof(JavascriptGameViewport_Spawn, ReturnValue) == 0x000008, "Member 'JavascriptGameViewport_Spawn::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.GetViewLocation
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGameViewport_GetViewLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_GetViewLocation) == 0x000008, "Wrong alignment on JavascriptGameViewport_GetViewLocation");
static_assert(sizeof(JavascriptGameViewport_GetViewLocation) == 0x000018, "Wrong size on JavascriptGameViewport_GetViewLocation");
static_assert(offsetof(JavascriptGameViewport_GetViewLocation, ReturnValue) == 0x000000, "Member 'JavascriptGameViewport_GetViewLocation::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.GetViewportWorld
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGameViewport_GetViewportWorld final
{
public:
	class UWorld*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_GetViewportWorld) == 0x000008, "Wrong alignment on JavascriptGameViewport_GetViewportWorld");
static_assert(sizeof(JavascriptGameViewport_GetViewportWorld) == 0x000008, "Wrong size on JavascriptGameViewport_GetViewportWorld");
static_assert(offsetof(JavascriptGameViewport_GetViewportWorld, ReturnValue) == 0x000000, "Member 'JavascriptGameViewport_GetViewportWorld::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptGameViewport.GetViewRotation
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGameViewport_GetViewRotation final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGameViewport_GetViewRotation) == 0x000008, "Wrong alignment on JavascriptGameViewport_GetViewRotation");
static_assert(sizeof(JavascriptGameViewport_GetViewRotation) == 0x000018, "Wrong size on JavascriptGameViewport_GetViewRotation");
static_assert(offsetof(JavascriptGameViewport_GetViewRotation, ReturnValue) == 0x000000, "Member 'JavascriptGameViewport_GetViewRotation::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptIntSpinBox.OnSpinBoxValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(sizeof(JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature");
static_assert(offsetof(JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature, InValue) == 0x000000, "Member 'JavascriptIntSpinBox_OnSpinBoxValueChangedEvent__DelegateSignature::InValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptIntSpinBox.OnSpinBoxValueCommittedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(sizeof(JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature) == 0x000008, "Wrong size on JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature");
static_assert(offsetof(JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature, InValue) == 0x000000, "Member 'JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature::InValue' has a wrong offset!");
static_assert(offsetof(JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature, CommitMethod) == 0x000004, "Member 'JavascriptIntSpinBox_OnSpinBoxValueCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetForegroundColor
// 0x0014 (0x0014 - 0x0000)
struct JavascriptIntSpinBox_SetForegroundColor final
{
public:
	struct FSlateColor                            InForegroundColor;                                 // 0x0000(0x0014)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetForegroundColor) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetForegroundColor");
static_assert(sizeof(JavascriptIntSpinBox_SetForegroundColor) == 0x000014, "Wrong size on JavascriptIntSpinBox_SetForegroundColor");
static_assert(offsetof(JavascriptIntSpinBox_SetForegroundColor, InForegroundColor) == 0x000000, "Member 'JavascriptIntSpinBox_SetForegroundColor::InForegroundColor' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetMaxSliderValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_SetMaxSliderValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetMaxSliderValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetMaxSliderValue");
static_assert(sizeof(JavascriptIntSpinBox_SetMaxSliderValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_SetMaxSliderValue");
static_assert(offsetof(JavascriptIntSpinBox_SetMaxSliderValue, NewValue) == 0x000000, "Member 'JavascriptIntSpinBox_SetMaxSliderValue::NewValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetMaxValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_SetMaxValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetMaxValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetMaxValue");
static_assert(sizeof(JavascriptIntSpinBox_SetMaxValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_SetMaxValue");
static_assert(offsetof(JavascriptIntSpinBox_SetMaxValue, NewValue) == 0x000000, "Member 'JavascriptIntSpinBox_SetMaxValue::NewValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetMinSliderValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_SetMinSliderValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetMinSliderValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetMinSliderValue");
static_assert(sizeof(JavascriptIntSpinBox_SetMinSliderValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_SetMinSliderValue");
static_assert(offsetof(JavascriptIntSpinBox_SetMinSliderValue, NewValue) == 0x000000, "Member 'JavascriptIntSpinBox_SetMinSliderValue::NewValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetMinValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_SetMinValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetMinValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetMinValue");
static_assert(sizeof(JavascriptIntSpinBox_SetMinValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_SetMinValue");
static_assert(offsetof(JavascriptIntSpinBox_SetMinValue, NewValue) == 0x000000, "Member 'JavascriptIntSpinBox_SetMinValue::NewValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.SetValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_SetValue final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_SetValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_SetValue");
static_assert(sizeof(JavascriptIntSpinBox_SetValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_SetValue");
static_assert(offsetof(JavascriptIntSpinBox_SetValue, NewValue) == 0x000000, "Member 'JavascriptIntSpinBox_SetValue::NewValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.GetMaxSliderValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_GetMaxSliderValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_GetMaxSliderValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_GetMaxSliderValue");
static_assert(sizeof(JavascriptIntSpinBox_GetMaxSliderValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_GetMaxSliderValue");
static_assert(offsetof(JavascriptIntSpinBox_GetMaxSliderValue, ReturnValue) == 0x000000, "Member 'JavascriptIntSpinBox_GetMaxSliderValue::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.GetMaxValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_GetMaxValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_GetMaxValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_GetMaxValue");
static_assert(sizeof(JavascriptIntSpinBox_GetMaxValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_GetMaxValue");
static_assert(offsetof(JavascriptIntSpinBox_GetMaxValue, ReturnValue) == 0x000000, "Member 'JavascriptIntSpinBox_GetMaxValue::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.GetMinSliderValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_GetMinSliderValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_GetMinSliderValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_GetMinSliderValue");
static_assert(sizeof(JavascriptIntSpinBox_GetMinSliderValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_GetMinSliderValue");
static_assert(offsetof(JavascriptIntSpinBox_GetMinSliderValue, ReturnValue) == 0x000000, "Member 'JavascriptIntSpinBox_GetMinSliderValue::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.GetMinValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_GetMinValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_GetMinValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_GetMinValue");
static_assert(sizeof(JavascriptIntSpinBox_GetMinValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_GetMinValue");
static_assert(offsetof(JavascriptIntSpinBox_GetMinValue, ReturnValue) == 0x000000, "Member 'JavascriptIntSpinBox_GetMinValue::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptIntSpinBox.GetValue
// 0x0004 (0x0004 - 0x0000)
struct JavascriptIntSpinBox_GetValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIntSpinBox_GetValue) == 0x000004, "Wrong alignment on JavascriptIntSpinBox_GetValue");
static_assert(sizeof(JavascriptIntSpinBox_GetValue) == 0x000004, "Wrong size on JavascriptIntSpinBox_GetValue");
static_assert(offsetof(JavascriptIntSpinBox_GetValue, ReturnValue) == 0x000000, "Member 'JavascriptIntSpinBox_GetValue::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.GetDoubleClickedItems
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_GetDoubleClickedItems final
{
public:
	TArray<class UObject*>                        OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_GetDoubleClickedItems) == 0x000008, "Wrong alignment on JavascriptTreeView_GetDoubleClickedItems");
static_assert(sizeof(JavascriptTreeView_GetDoubleClickedItems) == 0x000010, "Wrong size on JavascriptTreeView_GetDoubleClickedItems");
static_assert(offsetof(JavascriptTreeView_GetDoubleClickedItems, OutItems) == 0x000000, "Member 'JavascriptTreeView_GetDoubleClickedItems::OutItems' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.GetSelectedItems
// 0x0018 (0x0018 - 0x0000)
struct JavascriptTreeView_GetSelectedItems final
{
public:
	TArray<class UObject*>                        OutItems;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTreeView_GetSelectedItems) == 0x000008, "Wrong alignment on JavascriptTreeView_GetSelectedItems");
static_assert(sizeof(JavascriptTreeView_GetSelectedItems) == 0x000018, "Wrong size on JavascriptTreeView_GetSelectedItems");
static_assert(offsetof(JavascriptTreeView_GetSelectedItems, OutItems) == 0x000000, "Member 'JavascriptTreeView_GetSelectedItems::OutItems' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_GetSelectedItems, ReturnValue) == 0x000010, "Member 'JavascriptTreeView_GetSelectedItems::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.IsDoubleClickSelection
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_IsDoubleClickSelection final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTreeView_IsDoubleClickSelection) == 0x000008, "Wrong alignment on JavascriptTreeView_IsDoubleClickSelection");
static_assert(sizeof(JavascriptTreeView_IsDoubleClickSelection) == 0x000010, "Wrong size on JavascriptTreeView_IsDoubleClickSelection");
static_assert(offsetof(JavascriptTreeView_IsDoubleClickSelection, SelectedItem) == 0x000000, "Member 'JavascriptTreeView_IsDoubleClickSelection::SelectedItem' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_IsDoubleClickSelection, ReturnValue) == 0x000008, "Member 'JavascriptTreeView_IsDoubleClickSelection::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.IsItemExpanded
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_IsItemExpanded final
{
public:
	class UObject*                                InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTreeView_IsItemExpanded) == 0x000008, "Wrong alignment on JavascriptTreeView_IsItemExpanded");
static_assert(sizeof(JavascriptTreeView_IsItemExpanded) == 0x000010, "Wrong size on JavascriptTreeView_IsItemExpanded");
static_assert(offsetof(JavascriptTreeView_IsItemExpanded, InItem) == 0x000000, "Member 'JavascriptTreeView_IsItemExpanded::InItem' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_IsItemExpanded, ReturnValue) == 0x000008, "Member 'JavascriptTreeView_IsItemExpanded::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptTreeView.OnContextMenuOpening__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_OnContextMenuOpening__DelegateSignature final
{
public:
	class UJavascriptTreeView*                    Instance;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_OnContextMenuOpening__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptTreeView_OnContextMenuOpening__DelegateSignature");
static_assert(sizeof(JavascriptTreeView_OnContextMenuOpening__DelegateSignature) == 0x000010, "Wrong size on JavascriptTreeView_OnContextMenuOpening__DelegateSignature");
static_assert(offsetof(JavascriptTreeView_OnContextMenuOpening__DelegateSignature, Instance) == 0x000000, "Member 'JavascriptTreeView_OnContextMenuOpening__DelegateSignature::Instance' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnContextMenuOpening__DelegateSignature, ReturnValue) == 0x000008, "Member 'JavascriptTreeView_OnContextMenuOpening__DelegateSignature::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.OnDoubleClick
// 0x0008 (0x0008 - 0x0000)
struct JavascriptTreeView_OnDoubleClick final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_OnDoubleClick) == 0x000008, "Wrong alignment on JavascriptTreeView_OnDoubleClick");
static_assert(sizeof(JavascriptTreeView_OnDoubleClick) == 0x000008, "Wrong size on JavascriptTreeView_OnDoubleClick");
static_assert(offsetof(JavascriptTreeView_OnDoubleClick, Object) == 0x000000, "Member 'JavascriptTreeView_OnDoubleClick::Object' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptTreeView.OnExpansionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct JavascriptTreeView_OnExpansionChanged__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExpanded;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UJavascriptTreeView*                    Instance;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_OnExpansionChanged__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptTreeView_OnExpansionChanged__DelegateSignature");
static_assert(sizeof(JavascriptTreeView_OnExpansionChanged__DelegateSignature) == 0x000018, "Wrong size on JavascriptTreeView_OnExpansionChanged__DelegateSignature");
static_assert(offsetof(JavascriptTreeView_OnExpansionChanged__DelegateSignature, Item) == 0x000000, "Member 'JavascriptTreeView_OnExpansionChanged__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnExpansionChanged__DelegateSignature, bExpanded) == 0x000008, "Member 'JavascriptTreeView_OnExpansionChanged__DelegateSignature::bExpanded' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnExpansionChanged__DelegateSignature, Instance) == 0x000010, "Member 'JavascriptTreeView_OnExpansionChanged__DelegateSignature::Instance' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptTreeView.OnGenerateRow__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct JavascriptTreeView_OnGenerateRow__DelegateSignature final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ID;                                                // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJavascriptTreeView*                    Instance;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_OnGenerateRow__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptTreeView_OnGenerateRow__DelegateSignature");
static_assert(sizeof(JavascriptTreeView_OnGenerateRow__DelegateSignature) == 0x000020, "Wrong size on JavascriptTreeView_OnGenerateRow__DelegateSignature");
static_assert(offsetof(JavascriptTreeView_OnGenerateRow__DelegateSignature, Object) == 0x000000, "Member 'JavascriptTreeView_OnGenerateRow__DelegateSignature::Object' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnGenerateRow__DelegateSignature, ID) == 0x000008, "Member 'JavascriptTreeView_OnGenerateRow__DelegateSignature::ID' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnGenerateRow__DelegateSignature, Instance) == 0x000010, "Member 'JavascriptTreeView_OnGenerateRow__DelegateSignature::Instance' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnGenerateRow__DelegateSignature, ReturnValue) == 0x000018, "Member 'JavascriptTreeView_OnGenerateRow__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptTreeView.OnGetChildrenUObject__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_OnGetChildrenUObject__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UJavascriptTreeView*                    Instance;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_OnGetChildrenUObject__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptTreeView_OnGetChildrenUObject__DelegateSignature");
static_assert(sizeof(JavascriptTreeView_OnGetChildrenUObject__DelegateSignature) == 0x000010, "Wrong size on JavascriptTreeView_OnGetChildrenUObject__DelegateSignature");
static_assert(offsetof(JavascriptTreeView_OnGetChildrenUObject__DelegateSignature, Item) == 0x000000, "Member 'JavascriptTreeView_OnGetChildrenUObject__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnGetChildrenUObject__DelegateSignature, Instance) == 0x000008, "Member 'JavascriptTreeView_OnGetChildrenUObject__DelegateSignature::Instance' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.OnSelectionChanged
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_OnSelectionChanged final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESelectInfo                                   Type;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTreeView_OnSelectionChanged) == 0x000008, "Wrong alignment on JavascriptTreeView_OnSelectionChanged");
static_assert(sizeof(JavascriptTreeView_OnSelectionChanged) == 0x000010, "Wrong size on JavascriptTreeView_OnSelectionChanged");
static_assert(offsetof(JavascriptTreeView_OnSelectionChanged, Object) == 0x000000, "Member 'JavascriptTreeView_OnSelectionChanged::Object' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_OnSelectionChanged, Type) == 0x000008, "Member 'JavascriptTreeView_OnSelectionChanged::Type' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.SetDoubleClickSelection
// 0x0008 (0x0008 - 0x0000)
struct JavascriptTreeView_SetDoubleClickSelection final
{
public:
	class UObject*                                SelectedItem;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_SetDoubleClickSelection) == 0x000008, "Wrong alignment on JavascriptTreeView_SetDoubleClickSelection");
static_assert(sizeof(JavascriptTreeView_SetDoubleClickSelection) == 0x000008, "Wrong size on JavascriptTreeView_SetDoubleClickSelection");
static_assert(offsetof(JavascriptTreeView_SetDoubleClickSelection, SelectedItem) == 0x000000, "Member 'JavascriptTreeView_SetDoubleClickSelection::SelectedItem' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.SetItemExpansion
// 0x0010 (0x0010 - 0x0000)
struct JavascriptTreeView_SetItemExpansion final
{
public:
	class UObject*                                InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InShouldExpandItem;                                // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptTreeView_SetItemExpansion) == 0x000008, "Wrong alignment on JavascriptTreeView_SetItemExpansion");
static_assert(sizeof(JavascriptTreeView_SetItemExpansion) == 0x000010, "Wrong size on JavascriptTreeView_SetItemExpansion");
static_assert(offsetof(JavascriptTreeView_SetItemExpansion, InItem) == 0x000000, "Member 'JavascriptTreeView_SetItemExpansion::InItem' has a wrong offset!");
static_assert(offsetof(JavascriptTreeView_SetItemExpansion, InShouldExpandItem) == 0x000008, "Member 'JavascriptTreeView_SetItemExpansion::InShouldExpandItem' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.SetSelection
// 0x0008 (0x0008 - 0x0000)
struct JavascriptTreeView_SetSelection final
{
public:
	class UObject*                                SoleSelectedItem;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_SetSelection) == 0x000008, "Wrong alignment on JavascriptTreeView_SetSelection");
static_assert(sizeof(JavascriptTreeView_SetSelection) == 0x000008, "Wrong size on JavascriptTreeView_SetSelection");
static_assert(offsetof(JavascriptTreeView_SetSelection, SoleSelectedItem) == 0x000000, "Member 'JavascriptTreeView_SetSelection::SoleSelectedItem' has a wrong offset!");

// Function JavascriptUMG.JavascriptTreeView.SetSingleExpandedItem
// 0x0008 (0x0008 - 0x0000)
struct JavascriptTreeView_SetSingleExpandedItem final
{
public:
	class UObject*                                InItem;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptTreeView_SetSingleExpandedItem) == 0x000008, "Wrong alignment on JavascriptTreeView_SetSingleExpandedItem");
static_assert(sizeof(JavascriptTreeView_SetSingleExpandedItem) == 0x000008, "Wrong size on JavascriptTreeView_SetSingleExpandedItem");
static_assert(offsetof(JavascriptTreeView_SetSingleExpandedItem, InItem) == 0x000000, "Member 'JavascriptTreeView_SetSingleExpandedItem::InItem' has a wrong offset!");

// Function JavascriptUMG.JavascriptListView.OnClick
// 0x0008 (0x0008 - 0x0000)
struct JavascriptListView_OnClick final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptListView_OnClick) == 0x000008, "Wrong alignment on JavascriptListView_OnClick");
static_assert(sizeof(JavascriptListView_OnClick) == 0x000008, "Wrong size on JavascriptListView_OnClick");
static_assert(offsetof(JavascriptListView_OnClick, Object) == 0x000000, "Member 'JavascriptListView_OnClick::Object' has a wrong offset!");

// Function JavascriptUMG.JavascriptRichTextBlockHyperlinkDecorator.GetMetaData
// 0x0020 (0x0020 - 0x0000)
struct JavascriptRichTextBlockHyperlinkDecorator_GetMetaData final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptRichTextBlockHyperlinkDecorator_GetMetaData) == 0x000008, "Wrong alignment on JavascriptRichTextBlockHyperlinkDecorator_GetMetaData");
static_assert(sizeof(JavascriptRichTextBlockHyperlinkDecorator_GetMetaData) == 0x000020, "Wrong size on JavascriptRichTextBlockHyperlinkDecorator_GetMetaData");
static_assert(offsetof(JavascriptRichTextBlockHyperlinkDecorator_GetMetaData, Key) == 0x000000, "Member 'JavascriptRichTextBlockHyperlinkDecorator_GetMetaData::Key' has a wrong offset!");
static_assert(offsetof(JavascriptRichTextBlockHyperlinkDecorator_GetMetaData, ReturnValue) == 0x000010, "Member 'JavascriptRichTextBlockHyperlinkDecorator_GetMetaData::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptSearchBox.OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'JavascriptSearchBox_OnEditableTextChangedEvent__DelegateSignature::Text_0' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptSearchBox.OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature::Text_0' has a wrong offset!");
static_assert(offsetof(JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'JavascriptSearchBox_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function JavascriptUMG.JavascriptSearchBox.OnKeyDown
// 0x0130 (0x0130 - 0x0000)
struct JavascriptSearchBox_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0040(0x0038)(Parm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptSearchBox_OnKeyDown) == 0x000008, "Wrong alignment on JavascriptSearchBox_OnKeyDown");
static_assert(sizeof(JavascriptSearchBox_OnKeyDown) == 0x000130, "Wrong size on JavascriptSearchBox_OnKeyDown");
static_assert(offsetof(JavascriptSearchBox_OnKeyDown, MyGeometry) == 0x000000, "Member 'JavascriptSearchBox_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(JavascriptSearchBox_OnKeyDown, InKeyEvent) == 0x000040, "Member 'JavascriptSearchBox_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(JavascriptSearchBox_OnKeyDown, ReturnValue) == 0x000078, "Member 'JavascriptSearchBox_OnKeyDown::ReturnValue' has a wrong offset!");

// Function JavascriptUMG.JavascriptSearchBox.SetHintText
// 0x0018 (0x0018 - 0x0000)
struct JavascriptSearchBox_SetHintText final
{
public:
	class FText                                   InHintText;                                        // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptSearchBox_SetHintText) == 0x000008, "Wrong alignment on JavascriptSearchBox_SetHintText");
static_assert(sizeof(JavascriptSearchBox_SetHintText) == 0x000018, "Wrong size on JavascriptSearchBox_SetHintText");
static_assert(offsetof(JavascriptSearchBox_SetHintText, InHintText) == 0x000000, "Member 'JavascriptSearchBox_SetHintText::InHintText' has a wrong offset!");

// Function JavascriptUMG.JavascriptSearchBox.SetText
// 0x0018 (0x0018 - 0x0000)
struct JavascriptSearchBox_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptSearchBox_SetText) == 0x000008, "Wrong alignment on JavascriptSearchBox_SetText");
static_assert(sizeof(JavascriptSearchBox_SetText) == 0x000018, "Wrong size on JavascriptSearchBox_SetText");
static_assert(offsetof(JavascriptSearchBox_SetText, InText) == 0x000000, "Member 'JavascriptSearchBox_SetText::InText' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptToolbarButtonContext.BoolDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature) == 0x000001, "Wrong alignment on JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature");
static_assert(sizeof(JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature) == 0x000001, "Wrong size on JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature");
static_assert(offsetof(JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature, ReturnValue) == 0x000000, "Member 'JavascriptToolbarButtonContext_BoolDelegate__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptToolbarButtonContext.IconDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct JavascriptToolbarButtonContext_IconDelegate__DelegateSignature final
{
public:
	struct FJavascriptSlateIcon                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptToolbarButtonContext_IconDelegate__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptToolbarButtonContext_IconDelegate__DelegateSignature");
static_assert(sizeof(JavascriptToolbarButtonContext_IconDelegate__DelegateSignature) == 0x000018, "Wrong size on JavascriptToolbarButtonContext_IconDelegate__DelegateSignature");
static_assert(offsetof(JavascriptToolbarButtonContext_IconDelegate__DelegateSignature, ReturnValue) == 0x000000, "Member 'JavascriptToolbarButtonContext_IconDelegate__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptToolbarButtonContext.JavascriptCanExecuteActionWithEditingObject__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature final
{
public:
	class UObject*                                EditingObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature");
static_assert(sizeof(JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature) == 0x000010, "Wrong size on JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature");
static_assert(offsetof(JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature, EditingObject) == 0x000000, "Member 'JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature::EditingObject' has a wrong offset!");
static_assert(offsetof(JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature, ReturnValue) == 0x000008, "Member 'JavascriptToolbarButtonContext_JavascriptCanExecuteActionWithEditingObject__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptUMG.JavascriptToolbarButtonContext.JavascriptExecuteActionWithEditingObject__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct JavascriptToolbarButtonContext_JavascriptExecuteActionWithEditingObject__DelegateSignature final
{
public:
	class UObject*                                EditingObject;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptToolbarButtonContext_JavascriptExecuteActionWithEditingObject__DelegateSignature) == 0x000008, "Wrong alignment on JavascriptToolbarButtonContext_JavascriptExecuteActionWithEditingObject__DelegateSignature");
