#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptUMG

#include "Basic.hpp"


namespace SDK
{

// Enum JavascriptUMG.EJavasrciptUserInterfaceActionType
// NumValues: 0x0007
enum class EJavasrciptUserInterfaceActionType : uint8
{
	None                                     = 0,
	Button                                   = 1,
	ToggleButton                             = 2,
	RadioButton                              = 3,
	Check                                    = 4,
	CollapsedButton                          = 5,
	EJavasrciptUserInterfaceActionType_MAX   = 6,
};

// Enum JavascriptUMG.EJavascriptSizingRule
// NumValues: 0x0004
enum class EJavascriptSizingRule : uint8
{
	FixedSize                                = 0,
	Autosized                                = 1,
	UserSized                                = 2,
	EJavascriptSizingRule_MAX                = 3,
};

// Enum JavascriptUMG.EJavascriptWindowTransparency
// NumValues: 0x0003
enum class EJavascriptWindowTransparency : uint8
{
	None                                     = 0,
	PerWindow                                = 1,
	EJavascriptWindowTransparency_MAX        = 2,
};

// Enum JavascriptUMG.EJavascriptAutoCenter
// NumValues: 0x0004
enum class EJavascriptAutoCenter : uint8
{
	None                                     = 0,
	PrimaryWorkArea                          = 1,
	PreferredWorkArea                        = 2,
	EJavascriptAutoCenter_MAX                = 3,
};

// Enum JavascriptUMG.EJavascriptWindowType
// NumValues: 0x0006
enum class EJavascriptWindowType : uint8
{
	Normal                                   = 0,
	Menu                                     = 1,
	ToolTip                                  = 2,
	Notification                             = 3,
	CursorDecorator                          = 4,
	EJavascriptWindowType_MAX                = 5,
};

// ScriptStruct JavascriptUMG.JavascriptTextLayout
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FJavascriptTextLayout final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJavascriptTextLayout) == 0x000008, "Wrong alignment on FJavascriptTextLayout");
static_assert(sizeof(FJavascriptTextLayout) == 0x000020, "Wrong size on FJavascriptTextLayout");

// ScriptStruct JavascriptUMG.JavascriptSlateWidget
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateWidget final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJavascriptSlateWidget) == 0x000008, "Wrong alignment on FJavascriptSlateWidget");
static_assert(sizeof(FJavascriptSlateWidget) == 0x000010, "Wrong size on FJavascriptSlateWidget");

// ScriptStruct JavascriptUMG.JavascriptSlateIcon
// 0x0018 (0x0018 - 0x0000)
struct FJavascriptSlateIcon final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StyleName;                                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SmallStyleName;                                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJavascriptSlateIcon) == 0x000004, "Wrong alignment on FJavascriptSlateIcon");
static_assert(sizeof(FJavascriptSlateIcon) == 0x000018, "Wrong size on FJavascriptSlateIcon");
static_assert(offsetof(FJavascriptSlateIcon, StyleSetName) == 0x000000, "Member 'FJavascriptSlateIcon::StyleSetName' has a wrong offset!");
static_assert(offsetof(FJavascriptSlateIcon, StyleName) == 0x000008, "Member 'FJavascriptSlateIcon::StyleName' has a wrong offset!");
static_assert(offsetof(FJavascriptSlateIcon, SmallStyleName) == 0x000010, "Member 'FJavascriptSlateIcon::SmallStyleName' has a wrong offset!");

// ScriptStruct JavascriptUMG.JavascriptSlateStyle
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateStyle final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJavascriptSlateStyle) == 0x000008, "Wrong alignment on FJavascriptSlateStyle");
static_assert(sizeof(FJavascriptSlateStyle) == 0x000010, "Wrong size on FJavascriptSlateStyle");

// ScriptStruct JavascriptUMG.JavascriptColumn
// 0x0020 (0x0020 - 0x0000)
struct FJavascriptColumn final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Widget;                                            // 0x0018(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJavascriptColumn) == 0x000008, "Wrong alignment on FJavascriptColumn");
static_assert(sizeof(FJavascriptColumn) == 0x000020, "Wrong size on FJavascriptColumn");
static_assert(offsetof(FJavascriptColumn, ID) == 0x000000, "Member 'FJavascriptColumn::ID' has a wrong offset!");
static_assert(offsetof(FJavascriptColumn, Width) == 0x000010, "Member 'FJavascriptColumn::Width' has a wrong offset!");
static_assert(offsetof(FJavascriptColumn, Widget) == 0x000018, "Member 'FJavascriptColumn::Widget' has a wrong offset!");

// ScriptStruct JavascriptUMG.JavascriptStyleSet
// 0x0008 (0x0008 - 0x0000)
struct FJavascriptStyleSet final
{
public:
	class FName                                   StyleSetName;                                      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FJavascriptStyleSet) == 0x000004, "Wrong alignment on FJavascriptStyleSet");
static_assert(sizeof(FJavascriptStyleSet) == 0x000008, "Wrong size on FJavascriptStyleSet");
static_assert(offsetof(FJavascriptStyleSet, StyleSetName) == 0x000000, "Member 'FJavascriptStyleSet::StyleSetName' has a wrong offset!");

// ScriptStruct JavascriptUMG.JavascriptSlateTextRun
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FJavascriptSlateTextRun final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FJavascriptSlateTextRun) == 0x000008, "Wrong alignment on FJavascriptSlateTextRun");
static_assert(sizeof(FJavascriptSlateTextRun) == 0x000010, "Wrong size on FJavascriptSlateTextRun");

}

