#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptWebSocket

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class JavascriptWebSocket.JavascriptWebSocket
// 0x0050 (0x0078 - 0x0028)
class UJavascriptWebSocket final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnReceived;                                        // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnConnected;                                       // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnError;                                           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x20];                                      // 0x0058(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJavascriptWebSocket* Connect(const class FString& Endpoint);

	void CopyBuffer();
	void Dispose();
	void Flush();
	int32 GetReceivedBytes();
	class FString LocalEndPoint(bool bAppendPort);
	void OnWebSocketDelegate__DelegateSignature();
	class FString RemoteEndPoint(bool bAppendPort);
	void SendMemory(int32 NumBytes);
	void Tick();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JavascriptWebSocket">();
	}
	static class UJavascriptWebSocket* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJavascriptWebSocket>();
	}
};
static_assert(alignof(UJavascriptWebSocket) == 0x000008, "Wrong alignment on UJavascriptWebSocket");
static_assert(sizeof(UJavascriptWebSocket) == 0x000078, "Wrong size on UJavascriptWebSocket");
static_assert(offsetof(UJavascriptWebSocket, OnReceived) == 0x000028, "Member 'UJavascriptWebSocket::OnReceived' has a wrong offset!");
static_assert(offsetof(UJavascriptWebSocket, OnConnected) == 0x000038, "Member 'UJavascriptWebSocket::OnConnected' has a wrong offset!");
static_assert(offsetof(UJavascriptWebSocket, OnError) == 0x000048, "Member 'UJavascriptWebSocket::OnError' has a wrong offset!");

// Class JavascriptWebSocket.JavascriptWebSocketServer
// 0x0030 (0x0058 - 0x0028)
class UJavascriptWebSocketServer final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnConnected;                                       // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UJavascriptWebSocket*>           Connections;                                       // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x10];                                      // 0x0048(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UJavascriptWebSocketServer* Create(int32 Port);

	void Dispose();
	class FString Info();
	void OnWebSocketServerDelegate__DelegateSignature(class UJavascriptWebSocket* WebSocket);
	void Tick();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"JavascriptWebSocketServer">();
	}
	static class UJavascriptWebSocketServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJavascriptWebSocketServer>();
	}
};
static_assert(alignof(UJavascriptWebSocketServer) == 0x000008, "Wrong alignment on UJavascriptWebSocketServer");
static_assert(sizeof(UJavascriptWebSocketServer) == 0x000058, "Wrong size on UJavascriptWebSocketServer");
static_assert(offsetof(UJavascriptWebSocketServer, OnConnected) == 0x000028, "Member 'UJavascriptWebSocketServer::OnConnected' has a wrong offset!");
static_assert(offsetof(UJavascriptWebSocketServer, Connections) == 0x000038, "Member 'UJavascriptWebSocketServer::Connections' has a wrong offset!");

}

