#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JavascriptHttp

#include "Basic.hpp"

#include "JavascriptHttp_structs.hpp"


namespace SDK::Params
{

// Function JavascriptHttp.JavascriptHttpRequest.GetContentAsString
// 0x0010 (0x0010 - 0x0000)
struct JavascriptHttpRequest_GetContentAsString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetContentAsString) == 0x000008, "Wrong alignment on JavascriptHttpRequest_GetContentAsString");
static_assert(sizeof(JavascriptHttpRequest_GetContentAsString) == 0x000010, "Wrong size on JavascriptHttpRequest_GetContentAsString");
static_assert(offsetof(JavascriptHttpRequest_GetContentAsString, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetContentAsString::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.GetContentLength
// 0x0004 (0x0004 - 0x0000)
struct JavascriptHttpRequest_GetContentLength final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetContentLength) == 0x000004, "Wrong alignment on JavascriptHttpRequest_GetContentLength");
static_assert(sizeof(JavascriptHttpRequest_GetContentLength) == 0x000004, "Wrong size on JavascriptHttpRequest_GetContentLength");
static_assert(offsetof(JavascriptHttpRequest_GetContentLength, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetContentLength::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.GetElapsedTime
// 0x0004 (0x0004 - 0x0000)
struct JavascriptHttpRequest_GetElapsedTime final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetElapsedTime) == 0x000004, "Wrong alignment on JavascriptHttpRequest_GetElapsedTime");
static_assert(sizeof(JavascriptHttpRequest_GetElapsedTime) == 0x000004, "Wrong size on JavascriptHttpRequest_GetElapsedTime");
static_assert(offsetof(JavascriptHttpRequest_GetElapsedTime, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetElapsedTime::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.GetResponseCode
// 0x0004 (0x0004 - 0x0000)
struct JavascriptHttpRequest_GetResponseCode final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetResponseCode) == 0x000004, "Wrong alignment on JavascriptHttpRequest_GetResponseCode");
static_assert(sizeof(JavascriptHttpRequest_GetResponseCode) == 0x000004, "Wrong size on JavascriptHttpRequest_GetResponseCode");
static_assert(offsetof(JavascriptHttpRequest_GetResponseCode, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetResponseCode::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.GetStatus
// 0x0001 (0x0001 - 0x0000)
struct JavascriptHttpRequest_GetStatus final
{
public:
	EJavascriptHttpRequestStatus                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetStatus) == 0x000001, "Wrong alignment on JavascriptHttpRequest_GetStatus");
static_assert(sizeof(JavascriptHttpRequest_GetStatus) == 0x000001, "Wrong size on JavascriptHttpRequest_GetStatus");
static_assert(offsetof(JavascriptHttpRequest_GetStatus, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetStatus::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.GetVerb
// 0x0010 (0x0010 - 0x0000)
struct JavascriptHttpRequest_GetVerb final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_GetVerb) == 0x000008, "Wrong alignment on JavascriptHttpRequest_GetVerb");
static_assert(sizeof(JavascriptHttpRequest_GetVerb) == 0x000010, "Wrong size on JavascriptHttpRequest_GetVerb");
static_assert(offsetof(JavascriptHttpRequest_GetVerb, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_GetVerb::ReturnValue' has a wrong offset!");

// DelegateFunction JavascriptHttp.JavascriptHttpRequest.JavascriptHttpRequestCompleteDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature final
{
public:
	bool                                          Successful;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature) == 0x000001, "Wrong alignment on JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature");
static_assert(sizeof(JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature) == 0x000001, "Wrong size on JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature");
static_assert(offsetof(JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature, Successful) == 0x000000, "Member 'JavascriptHttpRequest_JavascriptHttpRequestCompleteDelegate__DelegateSignature::Successful' has a wrong offset!");

// DelegateFunction JavascriptHttp.JavascriptHttpRequest.JavascriptHttpRequestProgressDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature final
{
public:
	int32                                         Sent;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Recv;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature");
static_assert(sizeof(JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature) == 0x000008, "Wrong size on JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature");
static_assert(offsetof(JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature, Sent) == 0x000000, "Member 'JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature::Sent' has a wrong offset!");
static_assert(offsetof(JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature, Recv) == 0x000004, "Member 'JavascriptHttpRequest_JavascriptHttpRequestProgressDelegate__DelegateSignature::Recv' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.ProcessRequest
// 0x0001 (0x0001 - 0x0000)
struct JavascriptHttpRequest_ProcessRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_ProcessRequest) == 0x000001, "Wrong alignment on JavascriptHttpRequest_ProcessRequest");
static_assert(sizeof(JavascriptHttpRequest_ProcessRequest) == 0x000001, "Wrong size on JavascriptHttpRequest_ProcessRequest");
static_assert(offsetof(JavascriptHttpRequest_ProcessRequest, ReturnValue) == 0x000000, "Member 'JavascriptHttpRequest_ProcessRequest::ReturnValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.SetContentAsString
// 0x0010 (0x0010 - 0x0000)
struct JavascriptHttpRequest_SetContentAsString final
{
public:
	class FString                                 ContentString;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_SetContentAsString) == 0x000008, "Wrong alignment on JavascriptHttpRequest_SetContentAsString");
static_assert(sizeof(JavascriptHttpRequest_SetContentAsString) == 0x000010, "Wrong size on JavascriptHttpRequest_SetContentAsString");
static_assert(offsetof(JavascriptHttpRequest_SetContentAsString, ContentString) == 0x000000, "Member 'JavascriptHttpRequest_SetContentAsString::ContentString' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.SetContentWithFiles
// 0x0030 (0x0030 - 0x0000)
struct JavascriptHttpRequest_SetContentWithFiles final
{
public:
	TArray<class FString>                         FilePaths;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 Boundary;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Content;                                           // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_SetContentWithFiles) == 0x000008, "Wrong alignment on JavascriptHttpRequest_SetContentWithFiles");
static_assert(sizeof(JavascriptHttpRequest_SetContentWithFiles) == 0x000030, "Wrong size on JavascriptHttpRequest_SetContentWithFiles");
static_assert(offsetof(JavascriptHttpRequest_SetContentWithFiles, FilePaths) == 0x000000, "Member 'JavascriptHttpRequest_SetContentWithFiles::FilePaths' has a wrong offset!");
static_assert(offsetof(JavascriptHttpRequest_SetContentWithFiles, Boundary) == 0x000010, "Member 'JavascriptHttpRequest_SetContentWithFiles::Boundary' has a wrong offset!");
static_assert(offsetof(JavascriptHttpRequest_SetContentWithFiles, Content) == 0x000020, "Member 'JavascriptHttpRequest_SetContentWithFiles::Content' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.SetHeader
// 0x0020 (0x0020 - 0x0000)
struct JavascriptHttpRequest_SetHeader final
{
public:
	class FString                                 HeaderName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeaderValue;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_SetHeader) == 0x000008, "Wrong alignment on JavascriptHttpRequest_SetHeader");
static_assert(sizeof(JavascriptHttpRequest_SetHeader) == 0x000020, "Wrong size on JavascriptHttpRequest_SetHeader");
static_assert(offsetof(JavascriptHttpRequest_SetHeader, HeaderName) == 0x000000, "Member 'JavascriptHttpRequest_SetHeader::HeaderName' has a wrong offset!");
static_assert(offsetof(JavascriptHttpRequest_SetHeader, HeaderValue) == 0x000010, "Member 'JavascriptHttpRequest_SetHeader::HeaderValue' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.SetURL
// 0x0010 (0x0010 - 0x0000)
struct JavascriptHttpRequest_SetURL final
{
public:
	class FString                                 URL;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_SetURL) == 0x000008, "Wrong alignment on JavascriptHttpRequest_SetURL");
static_assert(sizeof(JavascriptHttpRequest_SetURL) == 0x000010, "Wrong size on JavascriptHttpRequest_SetURL");
static_assert(offsetof(JavascriptHttpRequest_SetURL, URL) == 0x000000, "Member 'JavascriptHttpRequest_SetURL::URL' has a wrong offset!");

// Function JavascriptHttp.JavascriptHttpRequest.SetVerb
// 0x0010 (0x0010 - 0x0000)
struct JavascriptHttpRequest_SetVerb final
{
public:
	class FString                                 Verb;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptHttpRequest_SetVerb) == 0x000008, "Wrong alignment on JavascriptHttpRequest_SetVerb");
static_assert(sizeof(JavascriptHttpRequest_SetVerb) == 0x000010, "Wrong size on JavascriptHttpRequest_SetVerb");
static_assert(offsetof(JavascriptHttpRequest_SetVerb, Verb) == 0x000000, "Member 'JavascriptHttpRequest_SetVerb::Verb' has a wrong offset!");

}

