#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LandscapeAndFoliage_Parameter

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct LandscapeAndFoliage_Parameter.LandscapeAndFoliage_Parameter
// 0x0140 (0x0140 - 0x0000)
struct FLandscapeAndFoliage_Parameter final
{
public:
	class FString                                 EnableLandscapeDetectTextureStreaming_8_34CD37624CF32D930CE49B8AE1EDF932; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableLandscapeLODUpdateEveryFrame_9_5FA37320403A8777FE4A8FA2225C2F81; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableInstancedStaticMesh_10_F759681E42E05A6B2AC9FEA6EE2E717F; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableInstancedStaticMeshesCulling_11_DB7739364F5EED0508F78483F32D333D; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesCullingRadius_12_790EF6C34AB6F7B443A365B703D17049; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableLandscapeInRT_13_EB1398FC4CE59D76E6A49B9D289BA6A2; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesCullingAngle_16_6EB44C0E474474F85AD359B7B8A0B9BC; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesEvaluateWPO_22_3E0D1EF54BCDB5B2D1E1A48429415469; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesSimulationCount_23_3F44BC814B40CF9EB483F2A9D063BB0A; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowUseBiasForSkipWPOEval_24_EE03629D4D672D9F32340FBB0ED1F0A9; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ShadowMaxBiasForInexactGeometry_25_50FA131B48D2AEE0BE24A1AAEBCC1205; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AutoInstance_29_703C2F464F835FBA52AF74ABDEE8DC9D;  // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AOUseBiasForSkipWPOEval_33_2006F3134F1344D7F76F8FAA1D641BBB; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AOMaxBiasForInexactGeometry_34_C821B15B4E6AADD30289B4BBC8CE3C09; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesEnableInstancesCluster_37_D38812BE4A99F312B4A2EBAE877B7926; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesInstancesClusterThreshold_40_6794D7BB4A7807AA66D0BEBE5522808C; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesCullingClusterSize_43_3604AD0F47E09E96CBCB2698AD22EF7C; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesLodBias_46_1359E4EE43A68E48F5BA2EBD36B12DCF; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FoliageExpandOffset_49_4709C88E49A4E52865AE65B1D62A3B09; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 InstancedStaticMeshesSimulationClusterRadius_52_04DF0B8A40F0623929E4EBBAE5EED159; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FLandscapeAndFoliage_Parameter) == 0x000008, "Wrong alignment on FLandscapeAndFoliage_Parameter");
static_assert(sizeof(FLandscapeAndFoliage_Parameter) == 0x000140, "Wrong size on FLandscapeAndFoliage_Parameter");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, EnableLandscapeDetectTextureStreaming_8_34CD37624CF32D930CE49B8AE1EDF932) == 0x000000, "Member 'FLandscapeAndFoliage_Parameter::EnableLandscapeDetectTextureStreaming_8_34CD37624CF32D930CE49B8AE1EDF932' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, EnableLandscapeLODUpdateEveryFrame_9_5FA37320403A8777FE4A8FA2225C2F81) == 0x000010, "Member 'FLandscapeAndFoliage_Parameter::EnableLandscapeLODUpdateEveryFrame_9_5FA37320403A8777FE4A8FA2225C2F81' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, EnableInstancedStaticMesh_10_F759681E42E05A6B2AC9FEA6EE2E717F) == 0x000020, "Member 'FLandscapeAndFoliage_Parameter::EnableInstancedStaticMesh_10_F759681E42E05A6B2AC9FEA6EE2E717F' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, EnableInstancedStaticMeshesCulling_11_DB7739364F5EED0508F78483F32D333D) == 0x000030, "Member 'FLandscapeAndFoliage_Parameter::EnableInstancedStaticMeshesCulling_11_DB7739364F5EED0508F78483F32D333D' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesCullingRadius_12_790EF6C34AB6F7B443A365B703D17049) == 0x000040, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesCullingRadius_12_790EF6C34AB6F7B443A365B703D17049' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, EnableLandscapeInRT_13_EB1398FC4CE59D76E6A49B9D289BA6A2) == 0x000050, "Member 'FLandscapeAndFoliage_Parameter::EnableLandscapeInRT_13_EB1398FC4CE59D76E6A49B9D289BA6A2' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesCullingAngle_16_6EB44C0E474474F85AD359B7B8A0B9BC) == 0x000060, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesCullingAngle_16_6EB44C0E474474F85AD359B7B8A0B9BC' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesEvaluateWPO_22_3E0D1EF54BCDB5B2D1E1A48429415469) == 0x000070, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesEvaluateWPO_22_3E0D1EF54BCDB5B2D1E1A48429415469' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesSimulationCount_23_3F44BC814B40CF9EB483F2A9D063BB0A) == 0x000080, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesSimulationCount_23_3F44BC814B40CF9EB483F2A9D063BB0A' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, ShadowUseBiasForSkipWPOEval_24_EE03629D4D672D9F32340FBB0ED1F0A9) == 0x000090, "Member 'FLandscapeAndFoliage_Parameter::ShadowUseBiasForSkipWPOEval_24_EE03629D4D672D9F32340FBB0ED1F0A9' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, ShadowMaxBiasForInexactGeometry_25_50FA131B48D2AEE0BE24A1AAEBCC1205) == 0x0000A0, "Member 'FLandscapeAndFoliage_Parameter::ShadowMaxBiasForInexactGeometry_25_50FA131B48D2AEE0BE24A1AAEBCC1205' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, AutoInstance_29_703C2F464F835FBA52AF74ABDEE8DC9D) == 0x0000B0, "Member 'FLandscapeAndFoliage_Parameter::AutoInstance_29_703C2F464F835FBA52AF74ABDEE8DC9D' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, AOUseBiasForSkipWPOEval_33_2006F3134F1344D7F76F8FAA1D641BBB) == 0x0000C0, "Member 'FLandscapeAndFoliage_Parameter::AOUseBiasForSkipWPOEval_33_2006F3134F1344D7F76F8FAA1D641BBB' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, AOMaxBiasForInexactGeometry_34_C821B15B4E6AADD30289B4BBC8CE3C09) == 0x0000D0, "Member 'FLandscapeAndFoliage_Parameter::AOMaxBiasForInexactGeometry_34_C821B15B4E6AADD30289B4BBC8CE3C09' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesEnableInstancesCluster_37_D38812BE4A99F312B4A2EBAE877B7926) == 0x0000E0, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesEnableInstancesCluster_37_D38812BE4A99F312B4A2EBAE877B7926' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesInstancesClusterThreshold_40_6794D7BB4A7807AA66D0BEBE5522808C) == 0x0000F0, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesInstancesClusterThreshold_40_6794D7BB4A7807AA66D0BEBE5522808C' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesCullingClusterSize_43_3604AD0F47E09E96CBCB2698AD22EF7C) == 0x000100, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesCullingClusterSize_43_3604AD0F47E09E96CBCB2698AD22EF7C' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesLodBias_46_1359E4EE43A68E48F5BA2EBD36B12DCF) == 0x000110, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesLodBias_46_1359E4EE43A68E48F5BA2EBD36B12DCF' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, FoliageExpandOffset_49_4709C88E49A4E52865AE65B1D62A3B09) == 0x000120, "Member 'FLandscapeAndFoliage_Parameter::FoliageExpandOffset_49_4709C88E49A4E52865AE65B1D62A3B09' has a wrong offset!");
static_assert(offsetof(FLandscapeAndFoliage_Parameter, InstancedStaticMeshesSimulationClusterRadius_52_04DF0B8A40F0623929E4EBBAE5EED159) == 0x000130, "Member 'FLandscapeAndFoliage_Parameter::InstancedStaticMeshesSimulationClusterRadius_52_04DF0B8A40F0623929E4EBBAE5EED159' has a wrong offset!");

}

