#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"


namespace SDK::Params
{

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetSourceLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetSourceLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TransferMeshToolProperties_GetSourceLODNamesFunc) == 0x000008, "Wrong alignment on TransferMeshToolProperties_GetSourceLODNamesFunc");
static_assert(sizeof(TransferMeshToolProperties_GetSourceLODNamesFunc) == 0x000010, "Wrong size on TransferMeshToolProperties_GetSourceLODNamesFunc");
static_assert(offsetof(TransferMeshToolProperties_GetSourceLODNamesFunc, ReturnValue) == 0x000000, "Member 'TransferMeshToolProperties_GetSourceLODNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.TransferMeshToolProperties.GetTargetLODNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct TransferMeshToolProperties_GetTargetLODNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TransferMeshToolProperties_GetTargetLODNamesFunc) == 0x000008, "Wrong alignment on TransferMeshToolProperties_GetTargetLODNamesFunc");
static_assert(sizeof(TransferMeshToolProperties_GetTargetLODNamesFunc) == 0x000010, "Wrong size on TransferMeshToolProperties_GetTargetLODNamesFunc");
static_assert(offsetof(TransferMeshToolProperties_GetTargetLODNamesFunc, ReturnValue) == 0x000000, "Member 'TransferMeshToolProperties_GetTargetLODNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc) == 0x000008, "Wrong alignment on BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc");
static_assert(sizeof(BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc) == 0x000010, "Wrong size on BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc");
static_assert(offsetof(BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc, ReturnValue) == 0x000000, "Member 'BakeMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetSourceUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetSourceUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeInputMeshProperties_GetSourceUVLayerNamesFunc) == 0x000008, "Wrong alignment on BakeInputMeshProperties_GetSourceUVLayerNamesFunc");
static_assert(sizeof(BakeInputMeshProperties_GetSourceUVLayerNamesFunc) == 0x000010, "Wrong size on BakeInputMeshProperties_GetSourceUVLayerNamesFunc");
static_assert(offsetof(BakeInputMeshProperties_GetSourceUVLayerNamesFunc, ReturnValue) == 0x000000, "Member 'BakeInputMeshProperties_GetSourceUVLayerNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeInputMeshProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeInputMeshProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeInputMeshProperties_GetTargetUVLayerNamesFunc) == 0x000008, "Wrong alignment on BakeInputMeshProperties_GetTargetUVLayerNamesFunc");
static_assert(sizeof(BakeInputMeshProperties_GetTargetUVLayerNamesFunc) == 0x000010, "Wrong size on BakeInputMeshProperties_GetTargetUVLayerNamesFunc");
static_assert(offsetof(BakeInputMeshProperties_GetTargetUVLayerNamesFunc, ReturnValue) == 0x000000, "Member 'BakeInputMeshProperties_GetTargetUVLayerNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeTexture2DProperties_GetUVLayerNamesFunc) == 0x000008, "Wrong alignment on BakeTexture2DProperties_GetUVLayerNamesFunc");
static_assert(sizeof(BakeTexture2DProperties_GetUVLayerNamesFunc) == 0x000010, "Wrong size on BakeTexture2DProperties_GetUVLayerNamesFunc");
static_assert(offsetof(BakeTexture2DProperties_GetUVLayerNamesFunc, ReturnValue) == 0x000000, "Member 'BakeTexture2DProperties_GetUVLayerNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeMultiTexture2DProperties.GetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiTexture2DProperties_GetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeMultiTexture2DProperties_GetUVLayerNamesFunc) == 0x000008, "Wrong alignment on BakeMultiTexture2DProperties_GetUVLayerNamesFunc");
static_assert(sizeof(BakeMultiTexture2DProperties_GetUVLayerNamesFunc) == 0x000010, "Wrong size on BakeMultiTexture2DProperties_GetUVLayerNamesFunc");
static_assert(offsetof(BakeMultiTexture2DProperties_GetUVLayerNamesFunc, ReturnValue) == 0x000000, "Member 'BakeMultiTexture2DProperties_GetUVLayerNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeMultiMeshAttributeMapsToolProperties.GetMapPreviewNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc) == 0x000008, "Wrong alignment on BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc");
static_assert(sizeof(BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc) == 0x000010, "Wrong size on BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc");
static_assert(offsetof(BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc, ReturnValue) == 0x000000, "Member 'BakeMultiMeshAttributeMapsToolProperties_GetMapPreviewNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.BakeMultiMeshInputToolProperties.GetTargetUVLayerNamesFunc
// 0x0010 (0x0010 - 0x0000)
struct BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc) == 0x000008, "Wrong alignment on BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc");
static_assert(sizeof(BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc) == 0x000010, "Wrong size on BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc");
static_assert(offsetof(BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc, ReturnValue) == 0x000000, "Member 'BakeMultiMeshInputToolProperties_GetTargetUVLayerNamesFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.DisplaceMeshCommonProperties.GetWeightMapsFunc
// 0x0010 (0x0010 - 0x0000)
struct DisplaceMeshCommonProperties_GetWeightMapsFunc final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(DisplaceMeshCommonProperties_GetWeightMapsFunc) == 0x000008, "Wrong alignment on DisplaceMeshCommonProperties_GetWeightMapsFunc");
static_assert(sizeof(DisplaceMeshCommonProperties_GetWeightMapsFunc) == 0x000010, "Wrong size on DisplaceMeshCommonProperties_GetWeightMapsFunc");
static_assert(offsetof(DisplaceMeshCommonProperties_GetWeightMapsFunc, ReturnValue) == 0x000000, "Member 'DisplaceMeshCommonProperties_GetWeightMapsFunc::ReturnValue' has a wrong offset!");

// Function MeshModelingToolsExp.MeshAttributePaintToolProperties.GetAttributeNames
// 0x0010 (0x0010 - 0x0000)
struct MeshAttributePaintToolProperties_GetAttributeNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MeshAttributePaintToolProperties_GetAttributeNames) == 0x000008, "Wrong alignment on MeshAttributePaintToolProperties_GetAttributeNames");
static_assert(sizeof(MeshAttributePaintToolProperties_GetAttributeNames) == 0x000010, "Wrong size on MeshAttributePaintToolProperties_GetAttributeNames");
static_assert(offsetof(MeshAttributePaintToolProperties_GetAttributeNames, ReturnValue) == 0x000000, "Member 'MeshAttributePaintToolProperties_GetAttributeNames::ReturnValue' has a wrong offset!");

}

