#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingTools

#include "Basic.hpp"

#include "MeshModelingTools_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "ModelingComponents_classes.hpp"
#include "ModelingOperators_structs.hpp"


namespace SDK
{

// Class MeshModelingTools.ProceduralShapeToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UProceduralShapeToolProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bInstanceIfPossible;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPolygroupMode                        PolygroupMode;                                     // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPlacementType                        TargetSurface;                                     // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToGrid;                                       // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPivotLocation                        PivotLocation;                                     // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rotation;                                          // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignToNormal;                                    // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralShapeToolProperties">();
	}
	static class UProceduralShapeToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralShapeToolProperties>();
	}
};
static_assert(alignof(UProceduralShapeToolProperties) == 0x000008, "Wrong alignment on UProceduralShapeToolProperties");
static_assert(sizeof(UProceduralShapeToolProperties) == 0x0000B8, "Wrong size on UProceduralShapeToolProperties");
static_assert(offsetof(UProceduralShapeToolProperties, bInstanceIfPossible) == 0x0000A8, "Member 'UProceduralShapeToolProperties::bInstanceIfPossible' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, PolygroupMode) == 0x0000A9, "Member 'UProceduralShapeToolProperties::PolygroupMode' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, TargetSurface) == 0x0000AA, "Member 'UProceduralShapeToolProperties::TargetSurface' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, bSnapToGrid) == 0x0000AB, "Member 'UProceduralShapeToolProperties::bSnapToGrid' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, PivotLocation) == 0x0000AC, "Member 'UProceduralShapeToolProperties::PivotLocation' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, Rotation) == 0x0000B0, "Member 'UProceduralShapeToolProperties::Rotation' has a wrong offset!");
static_assert(offsetof(UProceduralShapeToolProperties, bAlignToNormal) == 0x0000B4, "Member 'UProceduralShapeToolProperties::bAlignToNormal' has a wrong offset!");

// Class MeshModelingTools.ProceduralRectangleToolProperties
// 0x0020 (0x00D8 - 0x00B8)
class UProceduralRectangleToolProperties final : public UProceduralShapeToolProperties
{
public:
	EProceduralRectType                           RectangleType;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidthSubdivisions;                                 // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DepthSubdivisions;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CornerRadius;                                      // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CornerSlices;                                      // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralRectangleToolProperties">();
	}
	static class UProceduralRectangleToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRectangleToolProperties>();
	}
};
static_assert(alignof(UProceduralRectangleToolProperties) == 0x000008, "Wrong alignment on UProceduralRectangleToolProperties");
static_assert(sizeof(UProceduralRectangleToolProperties) == 0x0000D8, "Wrong size on UProceduralRectangleToolProperties");
static_assert(offsetof(UProceduralRectangleToolProperties, RectangleType) == 0x0000B8, "Member 'UProceduralRectangleToolProperties::RectangleType' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, Width) == 0x0000BC, "Member 'UProceduralRectangleToolProperties::Width' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, Depth) == 0x0000C0, "Member 'UProceduralRectangleToolProperties::Depth' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, WidthSubdivisions) == 0x0000C4, "Member 'UProceduralRectangleToolProperties::WidthSubdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, DepthSubdivisions) == 0x0000C8, "Member 'UProceduralRectangleToolProperties::DepthSubdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, CornerRadius) == 0x0000CC, "Member 'UProceduralRectangleToolProperties::CornerRadius' has a wrong offset!");
static_assert(offsetof(UProceduralRectangleToolProperties, CornerSlices) == 0x0000D0, "Member 'UProceduralRectangleToolProperties::CornerSlices' has a wrong offset!");

// Class MeshModelingTools.LastActorInfo
// 0x0030 (0x0058 - 0x0028)
class ULastActorInfo final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LastActorInfo">();
	}
	static class ULastActorInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULastActorInfo>();
	}
};
static_assert(alignof(ULastActorInfo) == 0x000008, "Wrong alignment on ULastActorInfo");
static_assert(sizeof(ULastActorInfo) == 0x000058, "Wrong size on ULastActorInfo");
static_assert(offsetof(ULastActorInfo, Actor) == 0x000038, "Member 'ULastActorInfo::Actor' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, StaticMesh) == 0x000040, "Member 'ULastActorInfo::StaticMesh' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, ShapeSettings) == 0x000048, "Member 'ULastActorInfo::ShapeSettings' has a wrong offset!");
static_assert(offsetof(ULastActorInfo, MaterialProperties) == 0x000050, "Member 'ULastActorInfo::MaterialProperties' has a wrong offset!");

// Class MeshModelingTools.RevolveProperties
// 0x0070 (0x0118 - 0x00A8)
class URevolveProperties : public UInteractiveToolPropertySet
{
public:
	double                                        RevolveDegreesClamped;                             // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RevolveDegrees;                                    // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        RevolveDegreesOffset;                              // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        StepsMaxDegrees;                                   // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExplicitSteps;                                    // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumExplicitSteps;                                  // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        HeightOffsetPerDegree;                             // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseRevolutionDirection;                       // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipMesh;                                         // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSharpNormals;                                     // 0x00DA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SharpNormalsDegreeThreshold;                       // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPathAtMidpointOfStep;                             // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERevolvePropertiesPolygroupMode               PolygroupMode;                                     // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERevolvePropertiesQuadSplit                   QuadSplitMode;                                     // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EB[0x2D];                                      // 0x00EB(0x002D)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RevolveProperties">();
	}
	static class URevolveProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URevolveProperties>();
	}
};
static_assert(alignof(URevolveProperties) == 0x000008, "Wrong alignment on URevolveProperties");
static_assert(sizeof(URevolveProperties) == 0x000118, "Wrong size on URevolveProperties");
static_assert(offsetof(URevolveProperties, RevolveDegreesClamped) == 0x0000A8, "Member 'URevolveProperties::RevolveDegreesClamped' has a wrong offset!");
static_assert(offsetof(URevolveProperties, RevolveDegrees) == 0x0000B0, "Member 'URevolveProperties::RevolveDegrees' has a wrong offset!");
static_assert(offsetof(URevolveProperties, RevolveDegreesOffset) == 0x0000B8, "Member 'URevolveProperties::RevolveDegreesOffset' has a wrong offset!");
static_assert(offsetof(URevolveProperties, StepsMaxDegrees) == 0x0000C0, "Member 'URevolveProperties::StepsMaxDegrees' has a wrong offset!");
static_assert(offsetof(URevolveProperties, bExplicitSteps) == 0x0000C8, "Member 'URevolveProperties::bExplicitSteps' has a wrong offset!");
static_assert(offsetof(URevolveProperties, NumExplicitSteps) == 0x0000CC, "Member 'URevolveProperties::NumExplicitSteps' has a wrong offset!");
static_assert(offsetof(URevolveProperties, HeightOffsetPerDegree) == 0x0000D0, "Member 'URevolveProperties::HeightOffsetPerDegree' has a wrong offset!");
static_assert(offsetof(URevolveProperties, bReverseRevolutionDirection) == 0x0000D8, "Member 'URevolveProperties::bReverseRevolutionDirection' has a wrong offset!");
static_assert(offsetof(URevolveProperties, bFlipMesh) == 0x0000D9, "Member 'URevolveProperties::bFlipMesh' has a wrong offset!");
static_assert(offsetof(URevolveProperties, bSharpNormals) == 0x0000DA, "Member 'URevolveProperties::bSharpNormals' has a wrong offset!");
static_assert(offsetof(URevolveProperties, SharpNormalsDegreeThreshold) == 0x0000E0, "Member 'URevolveProperties::SharpNormalsDegreeThreshold' has a wrong offset!");
static_assert(offsetof(URevolveProperties, bPathAtMidpointOfStep) == 0x0000E8, "Member 'URevolveProperties::bPathAtMidpointOfStep' has a wrong offset!");
static_assert(offsetof(URevolveProperties, PolygroupMode) == 0x0000E9, "Member 'URevolveProperties::PolygroupMode' has a wrong offset!");
static_assert(offsetof(URevolveProperties, QuadSplitMode) == 0x0000EA, "Member 'URevolveProperties::QuadSplitMode' has a wrong offset!");

// Class MeshModelingTools.PolyEditExtrudeProperties
// 0x0020 (0x00C8 - 0x00A8)
class UPolyEditExtrudeProperties final : public UInteractiveToolPropertySet
{
public:
	EPolyEditExtrudeDirection                     Direction;                                         // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPolyEditExtrudeDirection                     MeasureDirection;                                  // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShellsToSolids;                                   // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EPolyEditExtrudeModeOptions                   DirectionMode;                                     // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaxDistanceScaleFactor;                            // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseColinearityForSettingBorderGroups;             // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PolyEditExtrudeProperties">();
	}
	static class UPolyEditExtrudeProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolyEditExtrudeProperties>();
	}
};
static_assert(alignof(UPolyEditExtrudeProperties) == 0x000008, "Wrong alignment on UPolyEditExtrudeProperties");
static_assert(sizeof(UPolyEditExtrudeProperties) == 0x0000C8, "Wrong size on UPolyEditExtrudeProperties");
static_assert(offsetof(UPolyEditExtrudeProperties, Direction) == 0x0000A8, "Member 'UPolyEditExtrudeProperties::Direction' has a wrong offset!");
static_assert(offsetof(UPolyEditExtrudeProperties, MeasureDirection) == 0x0000AC, "Member 'UPolyEditExtrudeProperties::MeasureDirection' has a wrong offset!");
static_assert(offsetof(UPolyEditExtrudeProperties, bShellsToSolids) == 0x0000B0, "Member 'UPolyEditExtrudeProperties::bShellsToSolids' has a wrong offset!");
static_assert(offsetof(UPolyEditExtrudeProperties, DirectionMode) == 0x0000B4, "Member 'UPolyEditExtrudeProperties::DirectionMode' has a wrong offset!");
static_assert(offsetof(UPolyEditExtrudeProperties, MaxDistanceScaleFactor) == 0x0000B8, "Member 'UPolyEditExtrudeProperties::MaxDistanceScaleFactor' has a wrong offset!");
static_assert(offsetof(UPolyEditExtrudeProperties, bUseColinearityForSettingBorderGroups) == 0x0000C0, "Member 'UPolyEditExtrudeProperties::bUseColinearityForSettingBorderGroups' has a wrong offset!");

// Class MeshModelingTools.AddPrimitiveToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UAddPrimitiveToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPrimitiveToolBuilder">();
	}
	static class UAddPrimitiveToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveToolBuilder>();
	}
};
static_assert(alignof(UAddPrimitiveToolBuilder) == 0x000008, "Wrong alignment on UAddPrimitiveToolBuilder");
static_assert(sizeof(UAddPrimitiveToolBuilder) == 0x000030, "Wrong size on UAddPrimitiveToolBuilder");

// Class MeshModelingTools.ProceduralBoxToolProperties
// 0x0018 (0x00D0 - 0x00B8)
class UProceduralBoxToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Width;                                             // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidthSubdivisions;                                 // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DepthSubdivisions;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralBoxToolProperties">();
	}
	static class UProceduralBoxToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralBoxToolProperties>();
	}
};
static_assert(alignof(UProceduralBoxToolProperties) == 0x000008, "Wrong alignment on UProceduralBoxToolProperties");
static_assert(sizeof(UProceduralBoxToolProperties) == 0x0000D0, "Wrong size on UProceduralBoxToolProperties");
static_assert(offsetof(UProceduralBoxToolProperties, Width) == 0x0000B8, "Member 'UProceduralBoxToolProperties::Width' has a wrong offset!");
static_assert(offsetof(UProceduralBoxToolProperties, Depth) == 0x0000BC, "Member 'UProceduralBoxToolProperties::Depth' has a wrong offset!");
static_assert(offsetof(UProceduralBoxToolProperties, Height) == 0x0000C0, "Member 'UProceduralBoxToolProperties::Height' has a wrong offset!");
static_assert(offsetof(UProceduralBoxToolProperties, WidthSubdivisions) == 0x0000C4, "Member 'UProceduralBoxToolProperties::WidthSubdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralBoxToolProperties, DepthSubdivisions) == 0x0000C8, "Member 'UProceduralBoxToolProperties::DepthSubdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralBoxToolProperties, HeightSubdivisions) == 0x0000CC, "Member 'UProceduralBoxToolProperties::HeightSubdivisions' has a wrong offset!");

// Class MeshModelingTools.ProceduralDiscToolProperties
// 0x0018 (0x00D0 - 0x00B8)
class UProceduralDiscToolProperties final : public UProceduralShapeToolProperties
{
public:
	EProceduralDiscType                           DiscType;                                          // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSubdivisions;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HoleRadius;                                        // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralDiscToolProperties">();
	}
	static class UProceduralDiscToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralDiscToolProperties>();
	}
};
static_assert(alignof(UProceduralDiscToolProperties) == 0x000008, "Wrong alignment on UProceduralDiscToolProperties");
static_assert(sizeof(UProceduralDiscToolProperties) == 0x0000D0, "Wrong size on UProceduralDiscToolProperties");
static_assert(offsetof(UProceduralDiscToolProperties, DiscType) == 0x0000B8, "Member 'UProceduralDiscToolProperties::DiscType' has a wrong offset!");
static_assert(offsetof(UProceduralDiscToolProperties, Radius) == 0x0000BC, "Member 'UProceduralDiscToolProperties::Radius' has a wrong offset!");
static_assert(offsetof(UProceduralDiscToolProperties, RadialSlices) == 0x0000C0, "Member 'UProceduralDiscToolProperties::RadialSlices' has a wrong offset!");
static_assert(offsetof(UProceduralDiscToolProperties, RadialSubdivisions) == 0x0000C4, "Member 'UProceduralDiscToolProperties::RadialSubdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralDiscToolProperties, HoleRadius) == 0x0000C8, "Member 'UProceduralDiscToolProperties::HoleRadius' has a wrong offset!");

// Class MeshModelingTools.ProceduralTorusToolProperties
// 0x0010 (0x00C8 - 0x00B8)
class UProceduralTorusToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         MajorRadius;                                       // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinorRadius;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MajorSlices;                                       // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinorSlices;                                       // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralTorusToolProperties">();
	}
	static class UProceduralTorusToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralTorusToolProperties>();
	}
};
static_assert(alignof(UProceduralTorusToolProperties) == 0x000008, "Wrong alignment on UProceduralTorusToolProperties");
static_assert(sizeof(UProceduralTorusToolProperties) == 0x0000C8, "Wrong size on UProceduralTorusToolProperties");
static_assert(offsetof(UProceduralTorusToolProperties, MajorRadius) == 0x0000B8, "Member 'UProceduralTorusToolProperties::MajorRadius' has a wrong offset!");
static_assert(offsetof(UProceduralTorusToolProperties, MinorRadius) == 0x0000BC, "Member 'UProceduralTorusToolProperties::MinorRadius' has a wrong offset!");
static_assert(offsetof(UProceduralTorusToolProperties, MajorSlices) == 0x0000C0, "Member 'UProceduralTorusToolProperties::MajorSlices' has a wrong offset!");
static_assert(offsetof(UProceduralTorusToolProperties, MinorSlices) == 0x0000C4, "Member 'UProceduralTorusToolProperties::MinorSlices' has a wrong offset!");

// Class MeshModelingTools.ProceduralCylinderToolProperties
// 0x0010 (0x00C8 - 0x00B8)
class UProceduralCylinderToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralCylinderToolProperties">();
	}
	static class UProceduralCylinderToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralCylinderToolProperties>();
	}
};
static_assert(alignof(UProceduralCylinderToolProperties) == 0x000008, "Wrong alignment on UProceduralCylinderToolProperties");
static_assert(sizeof(UProceduralCylinderToolProperties) == 0x0000C8, "Wrong size on UProceduralCylinderToolProperties");
static_assert(offsetof(UProceduralCylinderToolProperties, Radius) == 0x0000B8, "Member 'UProceduralCylinderToolProperties::Radius' has a wrong offset!");
static_assert(offsetof(UProceduralCylinderToolProperties, Height) == 0x0000BC, "Member 'UProceduralCylinderToolProperties::Height' has a wrong offset!");
static_assert(offsetof(UProceduralCylinderToolProperties, RadialSlices) == 0x0000C0, "Member 'UProceduralCylinderToolProperties::RadialSlices' has a wrong offset!");
static_assert(offsetof(UProceduralCylinderToolProperties, HeightSubdivisions) == 0x0000C4, "Member 'UProceduralCylinderToolProperties::HeightSubdivisions' has a wrong offset!");

// Class MeshModelingTools.ProceduralConeToolProperties
// 0x0010 (0x00C8 - 0x00B8)
class UProceduralConeToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralConeToolProperties">();
	}
	static class UProceduralConeToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralConeToolProperties>();
	}
};
static_assert(alignof(UProceduralConeToolProperties) == 0x000008, "Wrong alignment on UProceduralConeToolProperties");
static_assert(sizeof(UProceduralConeToolProperties) == 0x0000C8, "Wrong size on UProceduralConeToolProperties");
static_assert(offsetof(UProceduralConeToolProperties, Radius) == 0x0000B8, "Member 'UProceduralConeToolProperties::Radius' has a wrong offset!");
static_assert(offsetof(UProceduralConeToolProperties, Height) == 0x0000BC, "Member 'UProceduralConeToolProperties::Height' has a wrong offset!");
static_assert(offsetof(UProceduralConeToolProperties, RadialSlices) == 0x0000C0, "Member 'UProceduralConeToolProperties::RadialSlices' has a wrong offset!");
static_assert(offsetof(UProceduralConeToolProperties, HeightSubdivisions) == 0x0000C4, "Member 'UProceduralConeToolProperties::HeightSubdivisions' has a wrong offset!");

// Class MeshModelingTools.ProceduralArrowToolProperties
// 0x0018 (0x00D0 - 0x00B8)
class UProceduralArrowToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         ShaftRadius;                                       // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShaftHeight;                                       // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadRadius;                                        // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadHeight;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralArrowToolProperties">();
	}
	static class UProceduralArrowToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralArrowToolProperties>();
	}
};
static_assert(alignof(UProceduralArrowToolProperties) == 0x000008, "Wrong alignment on UProceduralArrowToolProperties");
static_assert(sizeof(UProceduralArrowToolProperties) == 0x0000D0, "Wrong size on UProceduralArrowToolProperties");
static_assert(offsetof(UProceduralArrowToolProperties, ShaftRadius) == 0x0000B8, "Member 'UProceduralArrowToolProperties::ShaftRadius' has a wrong offset!");
static_assert(offsetof(UProceduralArrowToolProperties, ShaftHeight) == 0x0000BC, "Member 'UProceduralArrowToolProperties::ShaftHeight' has a wrong offset!");
static_assert(offsetof(UProceduralArrowToolProperties, HeadRadius) == 0x0000C0, "Member 'UProceduralArrowToolProperties::HeadRadius' has a wrong offset!");
static_assert(offsetof(UProceduralArrowToolProperties, HeadHeight) == 0x0000C4, "Member 'UProceduralArrowToolProperties::HeadHeight' has a wrong offset!");
static_assert(offsetof(UProceduralArrowToolProperties, RadialSlices) == 0x0000C8, "Member 'UProceduralArrowToolProperties::RadialSlices' has a wrong offset!");
static_assert(offsetof(UProceduralArrowToolProperties, HeightSubdivisions) == 0x0000CC, "Member 'UProceduralArrowToolProperties::HeightSubdivisions' has a wrong offset!");

// Class MeshModelingTools.ProceduralSphereToolProperties
// 0x0018 (0x00D0 - 0x00B8)
class UProceduralSphereToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EProceduralSphereType                         SubdivisionType;                                   // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HorizontalSlices;                                  // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VerticalSlices;                                    // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralSphereToolProperties">();
	}
	static class UProceduralSphereToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralSphereToolProperties>();
	}
};
static_assert(alignof(UProceduralSphereToolProperties) == 0x000008, "Wrong alignment on UProceduralSphereToolProperties");
static_assert(sizeof(UProceduralSphereToolProperties) == 0x0000D0, "Wrong size on UProceduralSphereToolProperties");
static_assert(offsetof(UProceduralSphereToolProperties, Radius) == 0x0000B8, "Member 'UProceduralSphereToolProperties::Radius' has a wrong offset!");
static_assert(offsetof(UProceduralSphereToolProperties, SubdivisionType) == 0x0000BC, "Member 'UProceduralSphereToolProperties::SubdivisionType' has a wrong offset!");
static_assert(offsetof(UProceduralSphereToolProperties, Subdivisions) == 0x0000C0, "Member 'UProceduralSphereToolProperties::Subdivisions' has a wrong offset!");
static_assert(offsetof(UProceduralSphereToolProperties, HorizontalSlices) == 0x0000C4, "Member 'UProceduralSphereToolProperties::HorizontalSlices' has a wrong offset!");
static_assert(offsetof(UProceduralSphereToolProperties, VerticalSlices) == 0x0000C8, "Member 'UProceduralSphereToolProperties::VerticalSlices' has a wrong offset!");

// Class MeshModelingTools.ProceduralStairsToolProperties
// 0x0020 (0x00D8 - 0x00B8)
class UProceduralStairsToolProperties final : public UProceduralShapeToolProperties
{
public:
	EProceduralStairsType                         StairsType;                                        // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumSteps;                                          // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepWidth;                                         // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepHeight;                                        // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepDepth;                                         // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurveAngle;                                        // 0x00CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpiralAngle;                                       // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x00D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProceduralStairsToolProperties">();
	}
	static class UProceduralStairsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralStairsToolProperties>();
	}
};
static_assert(alignof(UProceduralStairsToolProperties) == 0x000008, "Wrong alignment on UProceduralStairsToolProperties");
static_assert(sizeof(UProceduralStairsToolProperties) == 0x0000D8, "Wrong size on UProceduralStairsToolProperties");
static_assert(offsetof(UProceduralStairsToolProperties, StairsType) == 0x0000B8, "Member 'UProceduralStairsToolProperties::StairsType' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, NumSteps) == 0x0000BC, "Member 'UProceduralStairsToolProperties::NumSteps' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, StepWidth) == 0x0000C0, "Member 'UProceduralStairsToolProperties::StepWidth' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, StepHeight) == 0x0000C4, "Member 'UProceduralStairsToolProperties::StepHeight' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, StepDepth) == 0x0000C8, "Member 'UProceduralStairsToolProperties::StepDepth' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, CurveAngle) == 0x0000CC, "Member 'UProceduralStairsToolProperties::CurveAngle' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, SpiralAngle) == 0x0000D0, "Member 'UProceduralStairsToolProperties::SpiralAngle' has a wrong offset!");
static_assert(offsetof(UProceduralStairsToolProperties, InnerRadius) == 0x0000D4, "Member 'UProceduralStairsToolProperties::InnerRadius' has a wrong offset!");

// Class MeshModelingTools.AddPrimitiveTool
// 0x0080 (0x0120 - 0x00A0)
class UAddPrimitiveTool : public USingleClickTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULastActorInfo*                         LastGenerated;                                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AssetName;                                         // 0x00D0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x40];                                      // 0x00E0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPrimitiveTool">();
	}
	static class UAddPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveTool>();
	}
};
static_assert(alignof(UAddPrimitiveTool) == 0x000008, "Wrong alignment on UAddPrimitiveTool");
static_assert(sizeof(UAddPrimitiveTool) == 0x000120, "Wrong size on UAddPrimitiveTool");
static_assert(offsetof(UAddPrimitiveTool, OutputTypeProperties) == 0x0000A8, "Member 'UAddPrimitiveTool::OutputTypeProperties' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, ShapeSettings) == 0x0000B0, "Member 'UAddPrimitiveTool::ShapeSettings' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, MaterialProperties) == 0x0000B8, "Member 'UAddPrimitiveTool::MaterialProperties' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, PreviewMesh) == 0x0000C0, "Member 'UAddPrimitiveTool::PreviewMesh' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, LastGenerated) == 0x0000C8, "Member 'UAddPrimitiveTool::LastGenerated' has a wrong offset!");
static_assert(offsetof(UAddPrimitiveTool, AssetName) == 0x0000D0, "Member 'UAddPrimitiveTool::AssetName' has a wrong offset!");

// Class MeshModelingTools.AddBoxPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddBoxPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddBoxPrimitiveTool">();
	}
	static class UAddBoxPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddBoxPrimitiveTool>();
	}
};
static_assert(alignof(UAddBoxPrimitiveTool) == 0x000008, "Wrong alignment on UAddBoxPrimitiveTool");
static_assert(sizeof(UAddBoxPrimitiveTool) == 0x000120, "Wrong size on UAddBoxPrimitiveTool");

// Class MeshModelingTools.AddCylinderPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddCylinderPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddCylinderPrimitiveTool">();
	}
	static class UAddCylinderPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddCylinderPrimitiveTool>();
	}
};
static_assert(alignof(UAddCylinderPrimitiveTool) == 0x000008, "Wrong alignment on UAddCylinderPrimitiveTool");
static_assert(sizeof(UAddCylinderPrimitiveTool) == 0x000120, "Wrong size on UAddCylinderPrimitiveTool");

// Class MeshModelingTools.AddConePrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddConePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddConePrimitiveTool">();
	}
	static class UAddConePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddConePrimitiveTool>();
	}
};
static_assert(alignof(UAddConePrimitiveTool) == 0x000008, "Wrong alignment on UAddConePrimitiveTool");
static_assert(sizeof(UAddConePrimitiveTool) == 0x000120, "Wrong size on UAddConePrimitiveTool");

// Class MeshModelingTools.AddRectanglePrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddRectanglePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddRectanglePrimitiveTool">();
	}
	static class UAddRectanglePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddRectanglePrimitiveTool>();
	}
};
static_assert(alignof(UAddRectanglePrimitiveTool) == 0x000008, "Wrong alignment on UAddRectanglePrimitiveTool");
static_assert(sizeof(UAddRectanglePrimitiveTool) == 0x000120, "Wrong size on UAddRectanglePrimitiveTool");

// Class MeshModelingTools.AddDiscPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddDiscPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddDiscPrimitiveTool">();
	}
	static class UAddDiscPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddDiscPrimitiveTool>();
	}
};
static_assert(alignof(UAddDiscPrimitiveTool) == 0x000008, "Wrong alignment on UAddDiscPrimitiveTool");
static_assert(sizeof(UAddDiscPrimitiveTool) == 0x000120, "Wrong size on UAddDiscPrimitiveTool");

// Class MeshModelingTools.AddTorusPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddTorusPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddTorusPrimitiveTool">();
	}
	static class UAddTorusPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddTorusPrimitiveTool>();
	}
};
static_assert(alignof(UAddTorusPrimitiveTool) == 0x000008, "Wrong alignment on UAddTorusPrimitiveTool");
static_assert(sizeof(UAddTorusPrimitiveTool) == 0x000120, "Wrong size on UAddTorusPrimitiveTool");

// Class MeshModelingTools.AddArrowPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddArrowPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddArrowPrimitiveTool">();
	}
	static class UAddArrowPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddArrowPrimitiveTool>();
	}
};
static_assert(alignof(UAddArrowPrimitiveTool) == 0x000008, "Wrong alignment on UAddArrowPrimitiveTool");
static_assert(sizeof(UAddArrowPrimitiveTool) == 0x000120, "Wrong size on UAddArrowPrimitiveTool");

// Class MeshModelingTools.AddSpherePrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddSpherePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddSpherePrimitiveTool">();
	}
	static class UAddSpherePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSpherePrimitiveTool>();
	}
};
static_assert(alignof(UAddSpherePrimitiveTool) == 0x000008, "Wrong alignment on UAddSpherePrimitiveTool");
static_assert(sizeof(UAddSpherePrimitiveTool) == 0x000120, "Wrong size on UAddSpherePrimitiveTool");

// Class MeshModelingTools.AddStairsPrimitiveTool
// 0x0000 (0x0120 - 0x0120)
class UAddStairsPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddStairsPrimitiveTool">();
	}
	static class UAddStairsPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddStairsPrimitiveTool>();
	}
};
static_assert(alignof(UAddStairsPrimitiveTool) == 0x000008, "Wrong alignment on UAddStairsPrimitiveTool");
static_assert(sizeof(UAddStairsPrimitiveTool) == 0x000120, "Wrong size on UAddStairsPrimitiveTool");

// Class MeshModelingTools.CombineMeshesToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UCombineMeshesToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesToolBuilder">();
	}
	static class UCombineMeshesToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesToolBuilder>();
	}
};
static_assert(alignof(UCombineMeshesToolBuilder) == 0x000008, "Wrong alignment on UCombineMeshesToolBuilder");
static_assert(sizeof(UCombineMeshesToolBuilder) == 0x000030, "Wrong size on UCombineMeshesToolBuilder");

// Class MeshModelingTools.CombineMeshesToolProperties
// 0x0028 (0x00D0 - 0x00A8)
class UCombineMeshesToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bIsDuplicateMode;                                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EBaseCreateFromSelectedTargetType             OutputWriteTo;                                     // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputNewName;                                     // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputExistingName;                                // 0x00C0(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesToolProperties">();
	}
	static class UCombineMeshesToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesToolProperties>();
	}
};
static_assert(alignof(UCombineMeshesToolProperties) == 0x000008, "Wrong alignment on UCombineMeshesToolProperties");
static_assert(sizeof(UCombineMeshesToolProperties) == 0x0000D0, "Wrong size on UCombineMeshesToolProperties");
static_assert(offsetof(UCombineMeshesToolProperties, bIsDuplicateMode) == 0x0000A8, "Member 'UCombineMeshesToolProperties::bIsDuplicateMode' has a wrong offset!");
static_assert(offsetof(UCombineMeshesToolProperties, OutputWriteTo) == 0x0000AC, "Member 'UCombineMeshesToolProperties::OutputWriteTo' has a wrong offset!");
static_assert(offsetof(UCombineMeshesToolProperties, OutputNewName) == 0x0000B0, "Member 'UCombineMeshesToolProperties::OutputNewName' has a wrong offset!");
static_assert(offsetof(UCombineMeshesToolProperties, OutputExistingName) == 0x0000C0, "Member 'UCombineMeshesToolProperties::OutputExistingName' has a wrong offset!");

// Class MeshModelingTools.CombineMeshesTool
// 0x0028 (0x00E0 - 0x00B8)
class UCombineMeshesTool final : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCombineMeshesToolProperties*           BasicProperties;                                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCreateMeshObjectTypeProperties*        OutputTypeProperties;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOnAcceptHandleSourcesPropertiesBase*   HandleSourceProperties;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CombineMeshesTool">();
	}
	static class UCombineMeshesTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombineMeshesTool>();
	}
};
static_assert(alignof(UCombineMeshesTool) == 0x000008, "Wrong alignment on UCombineMeshesTool");
static_assert(sizeof(UCombineMeshesTool) == 0x0000E0, "Wrong size on UCombineMeshesTool");
static_assert(offsetof(UCombineMeshesTool, BasicProperties) == 0x0000C0, "Member 'UCombineMeshesTool::BasicProperties' has a wrong offset!");
static_assert(offsetof(UCombineMeshesTool, OutputTypeProperties) == 0x0000C8, "Member 'UCombineMeshesTool::OutputTypeProperties' has a wrong offset!");
static_assert(offsetof(UCombineMeshesTool, HandleSourceProperties) == 0x0000D0, "Member 'UCombineMeshesTool::HandleSourceProperties' has a wrong offset!");

// Class MeshModelingTools.CSGMeshesToolProperties
// 0x0028 (0x00D0 - 0x00A8)
class UCSGMeshesToolProperties final : public UInteractiveToolPropertySet
{
public:
	ECSGOperation                                 Operation;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryFixHoles;                                      // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryCollapseEdges;                                 // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AB[0x1];                                       // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WindingThreshold;                                  // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNewBoundaries;                                // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSubtractedMesh;                               // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SubtractedMeshOpacity;                             // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SubtractedMeshColor;                               // 0x00B8(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseFirstMeshMaterials;                            // 0x00C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CSGMeshesToolProperties">();
	}
	static class UCSGMeshesToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCSGMeshesToolProperties>();
	}
};
static_assert(alignof(UCSGMeshesToolProperties) == 0x000008, "Wrong alignment on UCSGMeshesToolProperties");
static_assert(sizeof(UCSGMeshesToolProperties) == 0x0000D0, "Wrong size on UCSGMeshesToolProperties");
static_assert(offsetof(UCSGMeshesToolProperties, Operation) == 0x0000A8, "Member 'UCSGMeshesToolProperties::Operation' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, bTryFixHoles) == 0x0000A9, "Member 'UCSGMeshesToolProperties::bTryFixHoles' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, bTryCollapseEdges) == 0x0000AA, "Member 'UCSGMeshesToolProperties::bTryCollapseEdges' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, WindingThreshold) == 0x0000AC, "Member 'UCSGMeshesToolProperties::WindingThreshold' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, bShowNewBoundaries) == 0x0000B0, "Member 'UCSGMeshesToolProperties::bShowNewBoundaries' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, bShowSubtractedMesh) == 0x0000B1, "Member 'UCSGMeshesToolProperties::bShowSubtractedMesh' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, SubtractedMeshOpacity) == 0x0000B4, "Member 'UCSGMeshesToolProperties::SubtractedMeshOpacity' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, SubtractedMeshColor) == 0x0000B8, "Member 'UCSGMeshesToolProperties::SubtractedMeshColor' has a wrong offset!");
static_assert(offsetof(UCSGMeshesToolProperties, bUseFirstMeshMaterials) == 0x0000C8, "Member 'UCSGMeshesToolProperties::bUseFirstMeshMaterials' has a wrong offset!");

// Class MeshModelingTools.TrimMeshesToolProperties
// 0x0020 (0x00C8 - 0x00A8)
class UTrimMeshesToolProperties final : public UInteractiveToolPropertySet
{
public:
	ETrimOperation                                WhichMesh;                                         // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETrimSide                                     TrimSide;                                          // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
