#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingToolsExp

#include "Basic.hpp"

#include "InteractiveToolsFramework_structs.hpp"
#include "InteractiveToolsFramework_classes.hpp"
#include "Engine_structs.hpp"
#include "MeshModelingToolsExp_structs.hpp"
#include "ModelingComponents_structs.hpp"
#include "ModelingComponents_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingOperators_structs.hpp"
#include "MeshModelingTools_structs.hpp"
#include "MeshModelingTools_classes.hpp"


namespace SDK
{

// Class MeshModelingToolsExp.TransferMeshToolProperties
// 0x0078 (0x0120 - 0x00A8)
class UTransferMeshToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bTransferMaterials;                                // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SourceLOD;                                         // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetLod;                                         // 0x00C0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsStaticMeshSource;                               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         SourceLODNamesList;                                // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x10];                                      // 0x00E8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         TargetLODNamesList;                                // 0x00F8(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_108[0x10];                                     // 0x0108(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsStaticMeshTarget;                               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetSourceLODNamesFunc() const;
	const TArray<class FString> GetTargetLODNamesFunc() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TransferMeshToolProperties">();
	}
	static class UTransferMeshToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransferMeshToolProperties>();
	}
};
static_assert(alignof(UTransferMeshToolProperties) == 0x000008, "Wrong alignment on UTransferMeshToolProperties");
static_assert(sizeof(UTransferMeshToolProperties) == 0x000120, "Wrong size on UTransferMeshToolProperties");
static_assert(offsetof(UTransferMeshToolProperties, bTransferMaterials) == 0x0000A8, "Member 'UTransferMeshToolProperties::bTransferMaterials' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, SourceLOD) == 0x0000B0, "Member 'UTransferMeshToolProperties::SourceLOD' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, TargetLod) == 0x0000C0, "Member 'UTransferMeshToolProperties::TargetLod' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, bIsStaticMeshSource) == 0x0000D0, "Member 'UTransferMeshToolProperties::bIsStaticMeshSource' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, SourceLODNamesList) == 0x0000D8, "Member 'UTransferMeshToolProperties::SourceLODNamesList' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, TargetLODNamesList) == 0x0000F8, "Member 'UTransferMeshToolProperties::TargetLODNamesList' has a wrong offset!");
static_assert(offsetof(UTransferMeshToolProperties, bIsStaticMeshTarget) == 0x000118, "Member 'UTransferMeshToolProperties::bIsStaticMeshTarget' has a wrong offset!");

// Class MeshModelingToolsExp.DisplaceMeshSineWaveProperties
// 0x0020 (0x00C8 - 0x00A8)
class UDisplaceMeshSineWaveProperties final : public UInteractiveToolPropertySet
{
public:
	float                                         SineWaveFrequency;                                 // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SineWavePhaseShift;                                // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SineWaveDirection;                                 // 0x00B0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisplaceMeshSineWaveProperties">();
	}
	static class UDisplaceMeshSineWaveProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshSineWaveProperties>();
	}
};
static_assert(alignof(UDisplaceMeshSineWaveProperties) == 0x000008, "Wrong alignment on UDisplaceMeshSineWaveProperties");
static_assert(sizeof(UDisplaceMeshSineWaveProperties) == 0x0000C8, "Wrong size on UDisplaceMeshSineWaveProperties");
static_assert(offsetof(UDisplaceMeshSineWaveProperties, SineWaveFrequency) == 0x0000A8, "Member 'UDisplaceMeshSineWaveProperties::SineWaveFrequency' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshSineWaveProperties, SineWavePhaseShift) == 0x0000AC, "Member 'UDisplaceMeshSineWaveProperties::SineWavePhaseShift' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshSineWaveProperties, SineWaveDirection) == 0x0000B0, "Member 'UDisplaceMeshSineWaveProperties::SineWaveDirection' has a wrong offset!");

// Class MeshModelingToolsExp.MirrorOperatorFactory
// 0x0018 (0x0040 - 0x0028)
class UMirrorOperatorFactory final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMirrorTool*                            MirrorTool;                                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MirrorOperatorFactory">();
	}
	static class UMirrorOperatorFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMirrorOperatorFactory>();
	}
};
static_assert(alignof(UMirrorOperatorFactory) == 0x000008, "Wrong alignment on UMirrorOperatorFactory");
static_assert(sizeof(UMirrorOperatorFactory) == 0x000040, "Wrong size on UMirrorOperatorFactory");
static_assert(offsetof(UMirrorOperatorFactory, MirrorTool) == 0x000030, "Member 'UMirrorOperatorFactory::MirrorTool' has a wrong offset!");

// Class MeshModelingToolsExp.AddPatchToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UAddPatchToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchToolBuilder">();
	}
	static class UAddPatchToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolBuilder>();
	}
};
static_assert(alignof(UAddPatchToolBuilder) == 0x000008, "Wrong alignment on UAddPatchToolBuilder");
static_assert(sizeof(UAddPatchToolBuilder) == 0x000028, "Wrong size on UAddPatchToolBuilder");

// Class MeshModelingToolsExp.DynamicMeshBrushProperties
// 0x0020 (0x00C8 - 0x00A8)
class UDynamicMeshBrushProperties final : public UInteractiveToolPropertySet
{
public:
	struct FBrushToolRadius                       BrushSize;                                         // 0x00A8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BrushFalloffAmount;                                // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHitBackFaces;                                     // 0x00C4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshBrushProperties">();
	}
	static class UDynamicMeshBrushProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshBrushProperties>();
	}
};
static_assert(alignof(UDynamicMeshBrushProperties) == 0x000008, "Wrong alignment on UDynamicMeshBrushProperties");
static_assert(sizeof(UDynamicMeshBrushProperties) == 0x0000C8, "Wrong size on UDynamicMeshBrushProperties");
static_assert(offsetof(UDynamicMeshBrushProperties, BrushSize) == 0x0000A8, "Member 'UDynamicMeshBrushProperties::BrushSize' has a wrong offset!");
static_assert(offsetof(UDynamicMeshBrushProperties, BrushFalloffAmount) == 0x0000BC, "Member 'UDynamicMeshBrushProperties::BrushFalloffAmount' has a wrong offset!");
static_assert(offsetof(UDynamicMeshBrushProperties, Depth) == 0x0000C0, "Member 'UDynamicMeshBrushProperties::Depth' has a wrong offset!");
static_assert(offsetof(UDynamicMeshBrushProperties, bHitBackFaces) == 0x0000C4, "Member 'UDynamicMeshBrushProperties::bHitBackFaces' has a wrong offset!");

// Class MeshModelingToolsExp.VoxelMorphologyMeshesToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UVoxelMorphologyMeshesToolBuilder final : public UBaseCreateFromSelectedToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VoxelMorphologyMeshesToolBuilder">();
	}
	static class UVoxelMorphologyMeshesToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelMorphologyMeshesToolBuilder>();
	}
};
static_assert(alignof(UVoxelMorphologyMeshesToolBuilder) == 0x000008, "Wrong alignment on UVoxelMorphologyMeshesToolBuilder");
static_assert(sizeof(UVoxelMorphologyMeshesToolBuilder) == 0x000028, "Wrong size on UVoxelMorphologyMeshesToolBuilder");

// Class MeshModelingToolsExp.AlignObjectsToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UAlignObjectsToolProperties final : public UInteractiveToolPropertySet
{
public:
	EAlignObjectsAlignTypes                       AlignType;                                         // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsAlignToOptions                   AlignTo;                                           // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsBoxPoint                         BoxPosition;                                       // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignX;                                           // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignY;                                           // 0x00B5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignZ;                                           // 0x00B6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsToolProperties">();
	}
	static class UAlignObjectsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolProperties>();
	}
};
static_assert(alignof(UAlignObjectsToolProperties) == 0x000008, "Wrong alignment on UAlignObjectsToolProperties");
static_assert(sizeof(UAlignObjectsToolProperties) == 0x0000B8, "Wrong size on UAlignObjectsToolProperties");
static_assert(offsetof(UAlignObjectsToolProperties, AlignType) == 0x0000A8, "Member 'UAlignObjectsToolProperties::AlignType' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, AlignTo) == 0x0000AC, "Member 'UAlignObjectsToolProperties::AlignTo' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, BoxPosition) == 0x0000B0, "Member 'UAlignObjectsToolProperties::BoxPosition' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignX) == 0x0000B4, "Member 'UAlignObjectsToolProperties::bAlignX' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignY) == 0x0000B5, "Member 'UAlignObjectsToolProperties::bAlignY' has a wrong offset!");
static_assert(offsetof(UAlignObjectsToolProperties, bAlignZ) == 0x0000B6, "Member 'UAlignObjectsToolProperties::bAlignZ' has a wrong offset!");

// Class MeshModelingToolsExp.DisplaceMeshTool
// 0x0398 (0x0450 - 0x00B8)
class alignas(0x10) UDisplaceMeshTool final : public USingleSelectionMeshEditingTool
{
public:
	class UDisplaceMeshCommonProperties*          CommonProperties;                                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDisplaceMeshDirectionalFilterProperties* DirectionalFilterProperties;                       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDisplaceMeshTextureMapProperties*      TextureMapProperties;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDisplaceMeshPerlinNoiseProperties*     NoiseProperties;                                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDisplaceMeshSineWaveProperties*        SineWaveProperties;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            ActiveContrastCurveTarget;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E8[0x338];                                     // 0x00E8(0x0338)(Fixing Size After Last Property [ Dumper-7 ])
	class AInternalToolFrameworkActor*            PreviewMeshActor;                                  // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDynamicMeshComponent*                  DynamicMeshComponent;                              // 0x0428(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_430[0x20];                                     // 0x0430(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DisplaceMeshTool">();
	}
	static class UDisplaceMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshTool>();
	}
};
static_assert(alignof(UDisplaceMeshTool) == 0x000010, "Wrong alignment on UDisplaceMeshTool");
static_assert(sizeof(UDisplaceMeshTool) == 0x000450, "Wrong size on UDisplaceMeshTool");
static_assert(offsetof(UDisplaceMeshTool, CommonProperties) == 0x0000B8, "Member 'UDisplaceMeshTool::CommonProperties' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DirectionalFilterProperties) == 0x0000C0, "Member 'UDisplaceMeshTool::DirectionalFilterProperties' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, TextureMapProperties) == 0x0000C8, "Member 'UDisplaceMeshTool::TextureMapProperties' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, NoiseProperties) == 0x0000D0, "Member 'UDisplaceMeshTool::NoiseProperties' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, SineWaveProperties) == 0x0000D8, "Member 'UDisplaceMeshTool::SineWaveProperties' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, ActiveContrastCurveTarget) == 0x0000E0, "Member 'UDisplaceMeshTool::ActiveContrastCurveTarget' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, PreviewMeshActor) == 0x000420, "Member 'UDisplaceMeshTool::PreviewMeshActor' has a wrong offset!");
static_assert(offsetof(UDisplaceMeshTool, DynamicMeshComponent) == 0x000428, "Member 'UDisplaceMeshTool::DynamicMeshComponent' has a wrong offset!");

// Class MeshModelingToolsExp.VolumeToMeshToolProperties
// 0x0008 (0x00B0 - 0x00A8)
class UVolumeToMeshToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bWeldEdges;                                        // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoRepair;                                       // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOptimizeMesh;                                     // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VolumeToMeshToolProperties">();
	}
	static class UVolumeToMeshToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVolumeToMeshToolProperties>();
	}
};
static_assert(alignof(UVolumeToMeshToolProperties) == 0x000008, "Wrong alignment on UVolumeToMeshToolProperties");
static_assert(sizeof(UVolumeToMeshToolProperties) == 0x0000B0, "Wrong size on UVolumeToMeshToolProperties");
static_assert(offsetof(UVolumeToMeshToolProperties, bWeldEdges) == 0x0000A8, "Member 'UVolumeToMeshToolProperties::bWeldEdges' has a wrong offset!");
static_assert(offsetof(UVolumeToMeshToolProperties, bAutoRepair) == 0x0000A9, "Member 'UVolumeToMeshToolProperties::bAutoRepair' has a wrong offset!");
static_assert(offsetof(UVolumeToMeshToolProperties, bOptimizeMesh) == 0x0000AA, "Member 'UVolumeToMeshToolProperties::bOptimizeMesh' has a wrong offset!");
static_assert(offsetof(UVolumeToMeshToolProperties, bShowWireframe) == 0x0000AB, "Member 'UVolumeToMeshToolProperties::bShowWireframe' has a wrong offset!");

// Class MeshModelingToolsExp.AddPatchToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UAddPatchToolProperties final : public UInteractiveToolPropertySet
{
public:
	float                                         Width;                                             // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Shift;                                             // 0x00B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchToolProperties">();
	}
	static class UAddPatchToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolProperties>();
	}
};
static_assert(alignof(UAddPatchToolProperties) == 0x000008, "Wrong alignment on UAddPatchToolProperties");
static_assert(sizeof(UAddPatchToolProperties) == 0x0000B8, "Wrong size on UAddPatchToolProperties");
static_assert(offsetof(UAddPatchToolProperties, Width) == 0x0000A8, "Member 'UAddPatchToolProperties::Width' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Rotation) == 0x0000AC, "Member 'UAddPatchToolProperties::Rotation' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Subdivisions) == 0x0000B0, "Member 'UAddPatchToolProperties::Subdivisions' has a wrong offset!");
static_assert(offsetof(UAddPatchToolProperties, Shift) == 0x0000B4, "Member 'UAddPatchToolProperties::Shift' has a wrong offset!");

// Class MeshModelingToolsExp.MeshConstraintProperties
// 0x0008 (0x00B0 - 0x00A8)
class UMeshConstraintProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bPreserveSharpEdges;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeshBoundaryConstraint                       MeshBoundaryConstraint;                            // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGroupBoundaryConstraint                      GroupBoundaryConstraint;                           // 0x00AA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMaterialBoundaryConstraint                   MaterialBoundaryConstraint;                        // 0x00AB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreventNormalFlips;                               // 0x00AC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshConstraintProperties">();
	}
	static class UMeshConstraintProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshConstraintProperties>();
	}
};
static_assert(alignof(UMeshConstraintProperties) == 0x000008, "Wrong alignment on UMeshConstraintProperties");
static_assert(sizeof(UMeshConstraintProperties) == 0x0000B0, "Wrong size on UMeshConstraintProperties");
static_assert(offsetof(UMeshConstraintProperties, bPreserveSharpEdges) == 0x0000A8, "Member 'UMeshConstraintProperties::bPreserveSharpEdges' has a wrong offset!");
static_assert(offsetof(UMeshConstraintProperties, MeshBoundaryConstraint) == 0x0000A9, "Member 'UMeshConstraintProperties::MeshBoundaryConstraint' has a wrong offset!");
static_assert(offsetof(UMeshConstraintProperties, GroupBoundaryConstraint) == 0x0000AA, "Member 'UMeshConstraintProperties::GroupBoundaryConstraint' has a wrong offset!");
static_assert(offsetof(UMeshConstraintProperties, MaterialBoundaryConstraint) == 0x0000AB, "Member 'UMeshConstraintProperties::MaterialBoundaryConstraint' has a wrong offset!");
static_assert(offsetof(UMeshConstraintProperties, bPreventNormalFlips) == 0x0000AC, "Member 'UMeshConstraintProperties::bPreventNormalFlips' has a wrong offset!");

// Class MeshModelingToolsExp.AlignObjectsTool
// 0x00A0 (0x0158 - 0x00B8)
class UAlignObjectsTool final : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAlignObjectsToolProperties*            AlignProps;                                        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C8[0x90];                                      // 0x00C8(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsTool">();
	}
	static class UAlignObjectsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsTool>();
	}
};
static_assert(alignof(UAlignObjectsTool) == 0x000008, "Wrong alignment on UAlignObjectsTool");
static_assert(sizeof(UAlignObjectsTool) == 0x000158, "Wrong size on UAlignObjectsTool");
static_assert(offsetof(UAlignObjectsTool, AlignProps) == 0x0000C0, "Member 'UAlignObjectsTool::AlignProps' has a wrong offset!");

// Class MeshModelingToolsExp.DrawPolyPathExtrudeProperties
// 0x0008 (0x00B0 - 0x00A8)
class UDrawPolyPathExtrudeProperties final : public UInteractiveToolPropertySet
{
public:
	EDrawPolyPathExtrudeDirection                 Direction;                                         // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DrawPolyPathExtrudeProperties">();
	}
	static class UDrawPolyPathExtrudeProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPolyPathExtrudeProperties>();
	}
};
static_assert(alignof(UDrawPolyPathExtrudeProperties) == 0x000008, "Wrong alignment on UDrawPolyPathExtrudeProperties");
static_assert(sizeof(UDrawPolyPathExtrudeProperties) == 0x0000B0, "Wrong size on UDrawPolyPathExtrudeProperties");
static_assert(offsetof(UDrawPolyPathExtrudeProperties, Direction) == 0x0000A8, "Member 'UDrawPolyPathExtrudeProperties::Direction' has a wrong offset!");

// Class MeshModelingToolsExp.AddPatchTool
// 0x0088 (0x0128 - 0x00A0)
class UAddPatchTool final : public USingleClickTool
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAddPatchToolProperties*                ShapeSettings;                                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x68];                                      // 0x00C0(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AddPatchTool">();
	}
	static class UAddPatchTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchTool>();
	}
};
static_assert(alignof(UAddPatchTool) == 0x000008, "Wrong alignment on UAddPatchTool");
static_assert(sizeof(UAddPatchTool) == 0x000128, "Wrong size on UAddPatchTool");
static_assert(offsetof(UAddPatchTool, ShapeSettings) == 0x0000A8, "Member 'UAddPatchTool::ShapeSettings' has a wrong offset!");
static_assert(offsetof(UAddPatchTool, MaterialProperties) == 0x0000B0, "Member 'UAddPatchTool::MaterialProperties' has a wrong offset!");
static_assert(offsetof(UAddPatchTool, PreviewMesh) == 0x0000B8, "Member 'UAddPatchTool::PreviewMesh' has a wrong offset!");

// Class MeshModelingToolsExp.DynamicMeshSculptToolBuilder
// 0x0008 (0x0038 - 0x0030)
class UDynamicMeshSculptToolBuilder final : public UMeshSurfacePointMeshEditingToolBuilder
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DynamicMeshSculptToolBuilder">();
	}
	static class UDynamicMeshSculptToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshSculptToolBuilder>();
	}
};
static_assert(alignof(UDynamicMeshSculptToolBuilder) == 0x000008, "Wrong alignment on UDynamicMeshSculptToolBuilder");
static_assert(sizeof(UDynamicMeshSculptToolBuilder) == 0x000038, "Wrong size on UDynamicMeshSculptToolBuilder");

// Class MeshModelingToolsExp.AlignObjectsToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UAlignObjectsToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlignObjectsToolBuilder">();
	}
	static class UAlignObjectsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolBuilder>();
	}
};
static_assert(alignof(UAlignObjectsToolBuilder) == 0x000008, "Wrong alignment on UAlignObjectsToolBuilder");
static_assert(sizeof(UAlignObjectsToolBuilder) == 0x000028, "Wrong size on UAlignObjectsToolBuilder");

// Class MeshModelingToolsExp.RemoveOccludedTrianglesToolProperties
// 0x0030 (0x00D8 - 0x00A8)
class URemoveOccludedTrianglesToolProperties final : public UInteractiveToolPropertySet
{
public:
	EOcclusionCalculationUIMode                   OcclusionTestMethod;                               // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOcclusionTriangleSamplingUIMode              TriangleSampling;                                  // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WindingIsoValue;                                   // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AddRandomRays;                                     // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AddTriangleSamples;                                // 0x00BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlySelfOcclude;                                  // 0x00C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShrinkRemoval;                                     // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinAreaIsland;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinTriCountIsland;                                 // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOccludedAction                               Action;                                            // 0x00D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemoveOccludedTrianglesToolProperties">();
	}
	static class URemoveOccludedTrianglesToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemoveOccludedTrianglesToolProperties>();
	}
};
static_assert(alignof(URemoveOccludedTrianglesToolProperties) == 0x000008, "Wrong alignment on URemoveOccludedTrianglesToolProperties");
static_assert(sizeof(URemoveOccludedTrianglesToolProperties) == 0x0000D8, "Wrong size on URemoveOccludedTrianglesToolProperties");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, OcclusionTestMethod) == 0x0000A8, "Member 'URemoveOccludedTrianglesToolProperties::OcclusionTestMethod' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, TriangleSampling) == 0x0000A9, "Member 'URemoveOccludedTrianglesToolProperties::TriangleSampling' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, WindingIsoValue) == 0x0000B0, "Member 'URemoveOccludedTrianglesToolProperties::WindingIsoValue' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, AddRandomRays) == 0x0000B8, "Member 'URemoveOccludedTrianglesToolProperties::AddRandomRays' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, AddTriangleSamples) == 0x0000BC, "Member 'URemoveOccludedTrianglesToolProperties::AddTriangleSamples' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, bOnlySelfOcclude) == 0x0000C0, "Member 'URemoveOccludedTrianglesToolProperties::bOnlySelfOcclude' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, ShrinkRemoval) == 0x0000C4, "Member 'URemoveOccludedTrianglesToolProperties::ShrinkRemoval' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, MinAreaIsland) == 0x0000C8, "Member 'URemoveOccludedTrianglesToolProperties::MinAreaIsland' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, MinTriCountIsland) == 0x0000D0, "Member 'URemoveOccludedTrianglesToolProperties::MinTriCountIsland' has a wrong offset!");
static_assert(offsetof(URemoveOccludedTrianglesToolProperties, Action) == 0x0000D4, "Member 'URemoveOccludedTrianglesToolProperties::Action' has a wrong offset!");

// Class MeshModelingToolsExp.RemeshProperties
// 0x0008 (0x00B8 - 0x00B0)
class URemeshProperties : public UMeshConstraintProperties
{
public:
	float                                         SmoothingStrength;                                 // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlips;                                            // 0x00B4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSplits;                                           // 0x00B5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollapses;                                        // 0x00B6(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemeshProperties">();
	}
	static class URemeshProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemeshProperties>();
	}
};
static_assert(alignof(URemeshProperties) == 0x000008, "Wrong alignment on URemeshProperties");
static_assert(sizeof(URemeshProperties) == 0x0000B8, "Wrong size on URemeshProperties");
static_assert(offsetof(URemeshProperties, SmoothingStrength) == 0x0000B0, "Member 'URemeshProperties::SmoothingStrength' has a wrong offset!");
static_assert(offsetof(URemeshProperties, bFlips) == 0x0000B4, "Member 'URemeshProperties::bFlips' has a wrong offset!");
static_assert(offsetof(URemeshProperties, bSplits) == 0x0000B5, "Member 'URemeshProperties::bSplits' has a wrong offset!");
static_assert(offsetof(URemeshProperties, bCollapses) == 0x0000B6, "Member 'URemeshProperties::bCollapses' has a wrong offset!");

// Class MeshModelingToolsExp.MeshInspectorTool
// 0x00A0 (0x0158 - 0x00B8)
class UMeshInspectorTool final : public USingleSelectionMeshEditingTool
{
public:
	class UMeshInspectorProperties*               Settings;                                          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UExistingMeshMaterialProperties*        MaterialSettings;                                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULineSetComponent*                      DrawnLineSet;                                      // 0x00D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     DefaultMaterial;                                   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x70];                                      // 0x00E8(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MeshInspectorTool">();
	}
	static class UMeshInspectorTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshInspectorTool>();
	}
};
static_assert(alignof(UMeshInspectorTool) == 0x000008, "Wrong alignment on UMeshInspectorTool");
static_assert(sizeof(UMeshInspectorTool) == 0x000158, "Wrong size on UMeshInspectorTool");
static_assert(offsetof(UMeshInspectorTool, Settings) == 0x0000B8, "Member 'UMeshInspectorTool::Settings' has a wrong offset!");
static_assert(offsetof(UMeshInspectorTool, MaterialSettings) == 0x0000C0, "Member 'UMeshInspectorTool::MaterialSettings' has a wrong offset!");
static_assert(offsetof(UMeshInspectorTool, PreviewMesh) == 0x0000D0, "Member 'UMeshInspectorTool::PreviewMesh' has a wrong offset!");
static_assert(offsetof(UMeshInspectorTool, DrawnLineSet) == 0x0000D8, "Member 'UMeshInspectorTool::DrawnLineSet' has a wrong offset!");
static_assert(offsetof(UMeshInspectorTool, DefaultMaterial) == 0x0000E0, "Member 'UMeshInspectorTool::DefaultMaterial' has a wrong offset!");

// Class MeshModelingToolsExp.BakeMeshAttributeMapsToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBakeMeshAttributeMapsToolBuilder final : public UMultiSelectionMeshEditingToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMeshAttributeMapsToolBuilder">();
	}
	static class UBakeMeshAttributeMapsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMeshAttributeMapsToolBuilder>();
	}
};
static_assert(alignof(UBakeMeshAttributeMapsToolBuilder) == 0x000008, "Wrong alignment on UBakeMeshAttributeMapsToolBuilder");
static_assert(sizeof(UBakeMeshAttributeMapsToolBuilder) == 0x000028, "Wrong size on UBakeMeshAttributeMapsToolBuilder");

// Class MeshModelingToolsExp.BakeMeshAttributeMapsToolProperties
// 0x0088 (0x0130 - 0x00A8)
class UBakeMeshAttributeMapsToolProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         MapTypes;                                          // 0x00A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MapPreview;                                        // 0x00B0(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeTextureResolution                        Resolution;                                        // 0x00C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeTextureBitDepth                          BitDepth;                                          // 0x00C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBakeTextureSamplesPerPixel                   SamplesPerPixel;                                   // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         MapPreviewNamesList;                               // 0x00D0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x50];                                      // 0x00E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class FString> GetMapPreviewNamesFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMeshAttributeMapsToolProperties">();
	}
	static class UBakeMeshAttributeMapsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMeshAttributeMapsToolProperties>();
	}
};
static_assert(alignof(UBakeMeshAttributeMapsToolProperties) == 0x000008, "Wrong alignment on UBakeMeshAttributeMapsToolProperties");
static_assert(sizeof(UBakeMeshAttributeMapsToolProperties) == 0x000130, "Wrong size on UBakeMeshAttributeMapsToolProperties");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, MapTypes) == 0x0000A8, "Member 'UBakeMeshAttributeMapsToolProperties::MapTypes' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, MapPreview) == 0x0000B0, "Member 'UBakeMeshAttributeMapsToolProperties::MapPreview' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, Resolution) == 0x0000C0, "Member 'UBakeMeshAttributeMapsToolProperties::Resolution' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, BitDepth) == 0x0000C4, "Member 'UBakeMeshAttributeMapsToolProperties::BitDepth' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, SamplesPerPixel) == 0x0000C8, "Member 'UBakeMeshAttributeMapsToolProperties::SamplesPerPixel' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolProperties, MapPreviewNamesList) == 0x0000D0, "Member 'UBakeMeshAttributeMapsToolProperties::MapPreviewNamesList' has a wrong offset!");

// Class MeshModelingToolsExp.PlaneCutToolProperties
// 0x0010 (0x00B8 - 0x00A8)
class UPlaneCutToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bKeepBothHalves;                                   // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpacingBetweenHalves;                              // 0x00AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPreview;                                      // 0x00B0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFillCutHole;                                      // 0x00B1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFillSpans;                                        // 0x00B2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B3[0x5];                                       // 0x00B3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PlaneCutToolProperties">();
	}
	static class UPlaneCutToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaneCutToolProperties>();
	}
};
static_assert(alignof(UPlaneCutToolProperties) == 0x000008, "Wrong alignment on UPlaneCutToolProperties");
static_assert(sizeof(UPlaneCutToolProperties) == 0x0000B8, "Wrong size on UPlaneCutToolProperties");
static_assert(offsetof(UPlaneCutToolProperties, bKeepBothHalves) == 0x0000A8, "Member 'UPlaneCutToolProperties::bKeepBothHalves' has a wrong offset!");
static_assert(offsetof(UPlaneCutToolProperties, SpacingBetweenHalves) == 0x0000AC, "Member 'UPlaneCutToolProperties::SpacingBetweenHalves' has a wrong offset!");
static_assert(offsetof(UPlaneCutToolProperties, bShowPreview) == 0x0000B0, "Member 'UPlaneCutToolProperties::bShowPreview' has a wrong offset!");
static_assert(offsetof(UPlaneCutToolProperties, bFillCutHole) == 0x0000B1, "Member 'UPlaneCutToolProperties::bFillCutHole' has a wrong offset!");
static_assert(offsetof(UPlaneCutToolProperties, bFillSpans) == 0x0000B2, "Member 'UPlaneCutToolProperties::bFillSpans' has a wrong offset!");

// Class MeshModelingToolsExp.BakeMeshAttributeTool
// 0x03D8 (0x0490 - 0x00B8)
class alignas(0x10) UBakeMeshAttributeTool : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UBakeOcclusionMapToolProperties*        OcclusionSettings;                                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeCurvatureMapToolProperties*        CurvatureSettings;                                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeTexture2DProperties*               TextureSettings;                                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeMultiTexture2DProperties*          MultiTextureSettings;                              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               WorkingPreviewMaterial;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               ErrorPreviewMaterial;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x3A0];                                     // 0x00F0(0x03A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMeshAttributeTool">();
	}
	static class UBakeMeshAttributeTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMeshAttributeTool>();
	}
};
static_assert(alignof(UBakeMeshAttributeTool) == 0x000010, "Wrong alignment on UBakeMeshAttributeTool");
static_assert(sizeof(UBakeMeshAttributeTool) == 0x000490, "Wrong size on UBakeMeshAttributeTool");
static_assert(offsetof(UBakeMeshAttributeTool, OcclusionSettings) == 0x0000C0, "Member 'UBakeMeshAttributeTool::OcclusionSettings' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeTool, CurvatureSettings) == 0x0000C8, "Member 'UBakeMeshAttributeTool::CurvatureSettings' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeTool, TextureSettings) == 0x0000D0, "Member 'UBakeMeshAttributeTool::TextureSettings' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeTool, MultiTextureSettings) == 0x0000D8, "Member 'UBakeMeshAttributeTool::MultiTextureSettings' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeTool, WorkingPreviewMaterial) == 0x0000E0, "Member 'UBakeMeshAttributeTool::WorkingPreviewMaterial' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeTool, ErrorPreviewMaterial) == 0x0000E8, "Member 'UBakeMeshAttributeTool::ErrorPreviewMaterial' has a wrong offset!");

// Class MeshModelingToolsExp.BakeMeshAttributeMapsToolBase
// 0x0160 (0x05F0 - 0x0490)
class UBakeMeshAttributeMapsToolBase : public UBakeMeshAttributeTool
{
public:
	class UBakeVisualizationProperties*           VisualizationProps;                                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               PreviewMaterial;                                   // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               BentNormalPreviewMaterial;                         // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B0[0x40];                                     // 0x04B0(0x0040)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EBakeMapType, class UTexture2D*>         CachedMaps;                                        // 0x04F0(0x0050)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_540[0x98];                                     // 0x0540(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             EmptyNormalMap;                                    // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             EmptyColorMapBlack;                                // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTexture2D*                             EmptyColorMapWhite;                                // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMeshAttributeMapsToolBase">();
	}
	static class UBakeMeshAttributeMapsToolBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMeshAttributeMapsToolBase>();
	}
};
static_assert(alignof(UBakeMeshAttributeMapsToolBase) == 0x000010, "Wrong alignment on UBakeMeshAttributeMapsToolBase");
static_assert(sizeof(UBakeMeshAttributeMapsToolBase) == 0x0005F0, "Wrong size on UBakeMeshAttributeMapsToolBase");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, VisualizationProps) == 0x000490, "Member 'UBakeMeshAttributeMapsToolBase::VisualizationProps' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, PreviewMesh) == 0x000498, "Member 'UBakeMeshAttributeMapsToolBase::PreviewMesh' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, PreviewMaterial) == 0x0004A0, "Member 'UBakeMeshAttributeMapsToolBase::PreviewMaterial' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, BentNormalPreviewMaterial) == 0x0004A8, "Member 'UBakeMeshAttributeMapsToolBase::BentNormalPreviewMaterial' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, CachedMaps) == 0x0004F0, "Member 'UBakeMeshAttributeMapsToolBase::CachedMaps' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, EmptyNormalMap) == 0x0005D8, "Member 'UBakeMeshAttributeMapsToolBase::EmptyNormalMap' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, EmptyColorMapBlack) == 0x0005E0, "Member 'UBakeMeshAttributeMapsToolBase::EmptyColorMapBlack' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsToolBase, EmptyColorMapWhite) == 0x0005E8, "Member 'UBakeMeshAttributeMapsToolBase::EmptyColorMapWhite' has a wrong offset!");

// Class MeshModelingToolsExp.RemeshMeshTool
// 0x0050 (0x0108 - 0x00B8)
class URemeshMeshTool : public UMultiSelectionMeshEditingTool
{
public:
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class URemeshMeshToolProperties*              BasicProperties;                                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshStatisticsProperties*              MeshStatisticsProperties;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMeshElementsVisualizer*                MeshElementsDisplay;                               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E0[0x28];                                      // 0x00E0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RemeshMeshTool">();
	}
	static class URemeshMeshTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<URemeshMeshTool>();
	}
};
static_assert(alignof(URemeshMeshTool) == 0x000008, "Wrong alignment on URemeshMeshTool");
static_assert(sizeof(URemeshMeshTool) == 0x000108, "Wrong size on URemeshMeshTool");
static_assert(offsetof(URemeshMeshTool, BasicProperties) == 0x0000C0, "Member 'URemeshMeshTool::BasicProperties' has a wrong offset!");
static_assert(offsetof(URemeshMeshTool, MeshStatisticsProperties) == 0x0000C8, "Member 'URemeshMeshTool::MeshStatisticsProperties' has a wrong offset!");
static_assert(offsetof(URemeshMeshTool, Preview) == 0x0000D0, "Member 'URemeshMeshTool::Preview' has a wrong offset!");
static_assert(offsetof(URemeshMeshTool, MeshElementsDisplay) == 0x0000D8, "Member 'URemeshMeshTool::MeshElementsDisplay' has a wrong offset!");

// Class MeshModelingToolsExp.BakeMeshAttributeMapsTool
// 0x0070 (0x0660 - 0x05F0)
class UBakeMeshAttributeMapsTool final : public UBakeMeshAttributeMapsToolBase
{
public:
	class UBakeInputMeshProperties*               InputMeshSettings;                                 // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeMeshAttributeMapsToolProperties*   Settings;                                          // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBakeMeshAttributeMapsResultToolProperties* ResultSettings;                                    // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_608[0x58];                                     // 0x0608(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BakeMeshAttributeMapsTool">();
	}
	static class UBakeMeshAttributeMapsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBakeMeshAttributeMapsTool>();
	}
};
static_assert(alignof(UBakeMeshAttributeMapsTool) == 0x000010, "Wrong alignment on UBakeMeshAttributeMapsTool");
static_assert(sizeof(UBakeMeshAttributeMapsTool) == 0x000660, "Wrong size on UBakeMeshAttributeMapsTool");
static_assert(offsetof(UBakeMeshAttributeMapsTool, InputMeshSettings) == 0x0005F0, "Member 'UBakeMeshAttributeMapsTool::InputMeshSettings' has a wrong offset!");
static_assert(offsetof(UBakeMeshAttributeMapsTool, Settings) == 0x0005F8, "Member 'UBakeMeshAttributeMapsTool::Settings' has a wrong offset!");
