#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "OpenColorIO_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "UMG_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MoviePipelineSetting
// 0x0020 (0x0048 - 0x0028)
class UMoviePipelineSetting : public UObject
{
public:
	TWeakObjectPtr<class UMoviePipeline>          CachedPipeline;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnabled;                                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildNewProcessCommandLine(class FString& InOutUnrealURLParams, class FString& InOutCommandLineArgs) const;
	void BuildNewProcessCommandLineArgs(TArray<class FString>& InOutUnrealURLParams, TArray<class FString>& InOutCommandLineArgs, TArray<class FString>& InOutDeviceProfileCvars, TArray<class FString>& InOutExecCmds) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineSetting">();
	}
	static class UMoviePipelineSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineSetting>();
	}
};
static_assert(alignof(UMoviePipelineSetting) == 0x000008, "Wrong alignment on UMoviePipelineSetting");
static_assert(sizeof(UMoviePipelineSetting) == 0x000048, "Wrong size on UMoviePipelineSetting");
static_assert(offsetof(UMoviePipelineSetting, CachedPipeline) == 0x000028, "Member 'UMoviePipelineSetting::CachedPipeline' has a wrong offset!");
static_assert(offsetof(UMoviePipelineSetting, bEnabled) == 0x000030, "Member 'UMoviePipelineSetting::bEnabled' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCommandLineEncoder
// 0x0040 (0x0088 - 0x0048)
class UMoviePipelineCommandLineEncoder final : public UMoviePipelineSetting
{
public:
	class FString                                 FileNameFormatOverride;                            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineEncodeQuality                   Quality;                                           // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdditionalCommandLineArgs;                         // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x16];                                      // 0x0072(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineCommandLineEncoder">();
	}
	static class UMoviePipelineCommandLineEncoder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineCommandLineEncoder>();
	}
};
static_assert(alignof(UMoviePipelineCommandLineEncoder) == 0x000008, "Wrong alignment on UMoviePipelineCommandLineEncoder");
static_assert(sizeof(UMoviePipelineCommandLineEncoder) == 0x000088, "Wrong size on UMoviePipelineCommandLineEncoder");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, FileNameFormatOverride) == 0x000048, "Member 'UMoviePipelineCommandLineEncoder::FileNameFormatOverride' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, Quality) == 0x000058, "Member 'UMoviePipelineCommandLineEncoder::Quality' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, AdditionalCommandLineArgs) == 0x000060, "Member 'UMoviePipelineCommandLineEncoder::AdditionalCommandLineArgs' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, bDeleteSourceFiles) == 0x000070, "Member 'UMoviePipelineCommandLineEncoder::bDeleteSourceFiles' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoder, bSkipEncodeOnRenderCanceled) == 0x000071, "Member 'UMoviePipelineCommandLineEncoder::bSkipEncodeOnRenderCanceled' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipeline
// 0x02E8 (0x0310 - 0x0028)
class UMoviePipeline final : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnMoviePipelineFinishedDelegate;                   // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMoviePipelineWorkFinishedDelegate;               // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnMoviePipelineShotWorkFinishedDelegate;           // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UMoviePipelineCustomTimeStep*           CustomTimeStep;                                    // 0x0058(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UEngineCustomTimeStep*                  CachedPrevCustomTimeStep;                          // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelSequence*                         TargetSequence;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0080(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMovieRenderDebugWidget*                DebugWidget;                                       // 0x0088(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTexture*                               PreviewTexture;                                    // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_98[0x238];                                     // 0x0098(0x0238)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UMovieRenderDebugWidget>    DebugWidgetClass;                                  // 0x02D0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorJob*              CurrentJob;                                        // 0x02D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x30];                                     // 0x02E0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize(class UMoviePipelineExecutorJob* InJob);
	void OnMoviePipelineFinishedImpl();
	void RequestShutdown(bool bIsError);
	void SetInitializationTime(const struct FDateTime& InDateTime);
	void Shutdown(bool bError);

	class UMoviePipelineExecutorJob* GetCurrentJob() const;
	struct FDateTime GetInitializationTime() const;
	class UMoviePipelineMasterConfig* GetPipelineMasterConfig() const;
	class UTexture* GetPreviewTexture() const;
	bool IsShutdownRequested() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipeline">();
	}
	static class UMoviePipeline* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipeline>();
	}
};
static_assert(alignof(UMoviePipeline) == 0x000008, "Wrong alignment on UMoviePipeline");
static_assert(sizeof(UMoviePipeline) == 0x000310, "Wrong size on UMoviePipeline");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineFinishedDelegate) == 0x000028, "Member 'UMoviePipeline::OnMoviePipelineFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineWorkFinishedDelegate) == 0x000038, "Member 'UMoviePipeline::OnMoviePipelineWorkFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, OnMoviePipelineShotWorkFinishedDelegate) == 0x000048, "Member 'UMoviePipeline::OnMoviePipelineShotWorkFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CustomTimeStep) == 0x000058, "Member 'UMoviePipeline::CustomTimeStep' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CachedPrevCustomTimeStep) == 0x000070, "Member 'UMoviePipeline::CachedPrevCustomTimeStep' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, TargetSequence) == 0x000078, "Member 'UMoviePipeline::TargetSequence' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, LevelSequenceActor) == 0x000080, "Member 'UMoviePipeline::LevelSequenceActor' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, DebugWidget) == 0x000088, "Member 'UMoviePipeline::DebugWidget' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, PreviewTexture) == 0x000090, "Member 'UMoviePipeline::PreviewTexture' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, DebugWidgetClass) == 0x0002D0, "Member 'UMoviePipeline::DebugWidgetClass' has a wrong offset!");
static_assert(offsetof(UMoviePipeline, CurrentJob) == 0x0002D8, "Member 'UMoviePipeline::CurrentJob' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCustomTimeStep
// 0x0008 (0x0030 - 0x0028)
class UMoviePipelineCustomTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineCustomTimeStep">();
	}
	static class UMoviePipelineCustomTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineCustomTimeStep>();
	}
};
static_assert(alignof(UMoviePipelineCustomTimeStep) == 0x000008, "Wrong alignment on UMoviePipelineCustomTimeStep");
static_assert(sizeof(UMoviePipelineCustomTimeStep) == 0x000030, "Wrong size on UMoviePipelineCustomTimeStep");

// Class MovieRenderPipelineCore.MoviePipelineAntiAliasingSetting
// 0x0020 (0x0068 - 0x0048)
class UMoviePipelineAntiAliasingSetting final : public UMoviePipelineSetting
{
public:
	int32                                         SpatialSampleCount;                                // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TemporalSampleCount;                               // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAntiAliasing;                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAntiAliasingMethod                           AntiAliasingMethod;                                // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RenderWarmUpCount;                                 // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCameraCutForWarmUp;                            // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EngineWarmUpCount;                                 // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRenderWarmUpFrames;                               // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineAntiAliasingSetting">();
	}
	static class UMoviePipelineAntiAliasingSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineAntiAliasingSetting>();
	}
};
static_assert(alignof(UMoviePipelineAntiAliasingSetting) == 0x000008, "Wrong alignment on UMoviePipelineAntiAliasingSetting");
static_assert(sizeof(UMoviePipelineAntiAliasingSetting) == 0x000068, "Wrong size on UMoviePipelineAntiAliasingSetting");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, SpatialSampleCount) == 0x000048, "Member 'UMoviePipelineAntiAliasingSetting::SpatialSampleCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, TemporalSampleCount) == 0x00004C, "Member 'UMoviePipelineAntiAliasingSetting::TemporalSampleCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bOverrideAntiAliasing) == 0x000050, "Member 'UMoviePipelineAntiAliasingSetting::bOverrideAntiAliasing' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, AntiAliasingMethod) == 0x000051, "Member 'UMoviePipelineAntiAliasingSetting::AntiAliasingMethod' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, RenderWarmUpCount) == 0x000054, "Member 'UMoviePipelineAntiAliasingSetting::RenderWarmUpCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bUseCameraCutForWarmUp) == 0x000058, "Member 'UMoviePipelineAntiAliasingSetting::bUseCameraCutForWarmUp' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, EngineWarmUpCount) == 0x00005C, "Member 'UMoviePipelineAntiAliasingSetting::EngineWarmUpCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineAntiAliasingSetting, bRenderWarmUpFrames) == 0x000060, "Member 'UMoviePipelineAntiAliasingSetting::bRenderWarmUpFrames' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMoviePipelineBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneSequence* DuplicateSequence(class UObject* Outer_0, class UMovieSceneSequence* InSequence);
	static class UMoviePipelineSetting* FindOrGetDefaultSettingForShot(TSubclassOf<class UMoviePipelineSetting> InSettingType, const class UMoviePipelineMasterConfig* InMasterConfig, const class UMoviePipelineExecutorShot* InShot);
	static float GetCompletionPercentage(const class UMoviePipeline* InPipeline);
	static float GetCurrentAperture(const class UMoviePipeline* InMoviePipeline);
	static class UMoviePipelineExecutorShot* GetCurrentExecutorShot(const class UMoviePipeline* InMoviePipeline);
	static float GetCurrentFocalLength(const class UMoviePipeline* InMoviePipeline);
	static float GetCurrentFocusDistance(const class UMoviePipeline* InMoviePipeline);
	static void GetCurrentSegmentName(class UMoviePipeline* InMoviePipeline, class FText* OutOuterName, class FText* OutInnerName);
	static EMovieRenderShotState GetCurrentSegmentState(class UMoviePipeline* InMoviePipeline);
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMoviePipeline* InMoviePipeline);
	static class ULevelSequence* GetCurrentSequence(const class UMoviePipeline* InMoviePipeline);
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMoviePipeline* InMoviePipeline);
	static struct FTimecode GetCurrentShotTimecode(const class UMoviePipeline* InMoviePipeline);
	static struct FIntPoint GetEffectiveOutputResolution(class UMoviePipelineMasterConfig* InMasterConfig, class UMoviePipelineExecutorShot* InPipelineExecutorShot);
	static bool GetEstimatedTimeRemaining(const class UMoviePipeline* InPipeline, struct FTimespan* OutEstimate);
	static class FText GetJobAuthor(class UMoviePipeline* InMoviePipeline);
	static struct FDateTime GetJobInitializationTime(const class UMoviePipeline* InMoviePipeline);
	static class FText GetJobName(class UMoviePipeline* InMoviePipeline);
	static class FString GetMapPackageName(class UMoviePipelineExecutorJob* InJob);
	static struct FFrameNumber GetMasterFrameNumber(const class UMoviePipeline* InMoviePipeline);
	static struct FTimecode GetMasterTimecode(const class UMoviePipeline* InMoviePipeline);
	static class FText GetMoviePipelineEngineChangelistLabel(const class UMoviePipeline* InMoviePipeline);
	static void GetOverallOutputFrames(const class UMoviePipeline* InMoviePipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static void GetOverallSegmentCounts(const class UMoviePipeline* InMoviePipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static EMovieRenderPipelineState GetPipelineState(const class UMoviePipeline* InPipeline);
	static class UMoviePipelineQueue* LoadManifestFileFromString(const class FString& InManifestFilePath);
	static void ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMoviePipelineFilenameResolveParams& InParams, class FString* OutFinalPath, struct FMoviePipelineFormatArgs* OutMergedFormatArgs);
	static int32 ResolveVersionNumber(const struct FMoviePipelineFilenameResolveParams& InParams);
	static void UpdateJobShotListFromSequence(class ULevelSequence* InSequence, class UMoviePipelineExecutorJob* InJob, bool* bShotsChanged);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineBlueprintLibrary">();
	}
	static class UMoviePipelineBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineBlueprintLibrary>();
	}
};
static_assert(alignof(UMoviePipelineBlueprintLibrary) == 0x000008, "Wrong alignment on UMoviePipelineBlueprintLibrary");
static_assert(sizeof(UMoviePipelineBlueprintLibrary) == 0x000028, "Wrong size on UMoviePipelineBlueprintLibrary");

// Class MovieRenderPipelineCore.MoviePipelineCameraSetting
// 0x0008 (0x0050 - 0x0048)
class UMoviePipelineCameraSetting final : public UMoviePipelineSetting
{
public:
	EMoviePipelineShutterTiming                   ShutterTiming;                                     // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanPercentage;                                // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineCameraSetting">();
	}
	static class UMoviePipelineCameraSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineCameraSetting>();
	}
};
static_assert(alignof(UMoviePipelineCameraSetting) == 0x000008, "Wrong alignment on UMoviePipelineCameraSetting");
static_assert(sizeof(UMoviePipelineCameraSetting) == 0x000050, "Wrong size on UMoviePipelineCameraSetting");
static_assert(offsetof(UMoviePipelineCameraSetting, ShutterTiming) == 0x000048, "Member 'UMoviePipelineCameraSetting::ShutterTiming' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCameraSetting, OverscanPercentage) == 0x00004C, "Member 'UMoviePipelineCameraSetting::OverscanPercentage' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineColorSetting
// 0x0068 (0x00B0 - 0x0048)
class UMoviePipelineColorSetting final : public UMoviePipelineSetting
{
public:
	struct FOpenColorIODisplayConfiguration       OCIOConfiguration;                                 // 0x0048(0x0060)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bDisableToneCurve;                                 // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineColorSetting">();
	}
	static class UMoviePipelineColorSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineColorSetting>();
	}
};
static_assert(alignof(UMoviePipelineColorSetting) == 0x000008, "Wrong alignment on UMoviePipelineColorSetting");
static_assert(sizeof(UMoviePipelineColorSetting) == 0x0000B0, "Wrong size on UMoviePipelineColorSetting");
static_assert(offsetof(UMoviePipelineColorSetting, OCIOConfiguration) == 0x000048, "Member 'UMoviePipelineColorSetting::OCIOConfiguration' has a wrong offset!");
static_assert(offsetof(UMoviePipelineColorSetting, bDisableToneCurve) == 0x0000A8, "Member 'UMoviePipelineColorSetting::bDisableToneCurve' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineCommandLineEncoderSettings
// 0x00C8 (0x0100 - 0x0038)
class UMoviePipelineCommandLineEncoderSettings final : public UDeveloperSettings
{
public:
	class FString                                 ExecutablePath;                                    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   CodecHelpText;                                     // 0x0048(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FString                                 VideoCodec;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Low;                                // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Med;                                // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_High;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings_Epic;                               // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineCommandLineEncoderSettings">();
	}
	static class UMoviePipelineCommandLineEncoderSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineCommandLineEncoderSettings>();
	}
};
static_assert(alignof(UMoviePipelineCommandLineEncoderSettings) == 0x000008, "Wrong alignment on UMoviePipelineCommandLineEncoderSettings");
static_assert(sizeof(UMoviePipelineCommandLineEncoderSettings) == 0x000100, "Wrong size on UMoviePipelineCommandLineEncoderSettings");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, ExecutablePath) == 0x000038, "Member 'UMoviePipelineCommandLineEncoderSettings::ExecutablePath' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, CodecHelpText) == 0x000048, "Member 'UMoviePipelineCommandLineEncoderSettings::CodecHelpText' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, VideoCodec) == 0x000060, "Member 'UMoviePipelineCommandLineEncoderSettings::VideoCodec' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, AudioCodec) == 0x000070, "Member 'UMoviePipelineCommandLineEncoderSettings::AudioCodec' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, OutputFileExtension) == 0x000080, "Member 'UMoviePipelineCommandLineEncoderSettings::OutputFileExtension' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, CommandLineFormat) == 0x000090, "Member 'UMoviePipelineCommandLineEncoderSettings::CommandLineFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, VideoInputStringFormat) == 0x0000A0, "Member 'UMoviePipelineCommandLineEncoderSettings::VideoInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, AudioInputStringFormat) == 0x0000B0, "Member 'UMoviePipelineCommandLineEncoderSettings::AudioInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_Low) == 0x0000C0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_Low' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_Med) == 0x0000D0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_Med' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_High) == 0x0000E0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_High' has a wrong offset!");
static_assert(offsetof(UMoviePipelineCommandLineEncoderSettings, EncodeSettings_Epic) == 0x0000F0, "Member 'UMoviePipelineCommandLineEncoderSettings::EncodeSettings_Epic' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineConfigBase
// 0x0028 (0x0050 - 0x0028)
class UMoviePipelineConfigBase : public UObject
{
public:
	class FString                                 DisplayName;                                       // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMoviePipelineSetting*>          Settings;                                          // 0x0038(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CopyFrom(class UMoviePipelineConfigBase* InConfig);
	class UMoviePipelineSetting* FindOrAddSettingByClass(TSubclassOf<class UMoviePipelineSetting> InClass, const bool bIncludeDisabledSettings);
	void RemoveSetting(class UMoviePipelineSetting* InSetting);

	class UMoviePipelineSetting* FindSettingByClass(TSubclassOf<class UMoviePipelineSetting> InClass, const bool bIncludeDisabledSettings) const;
	TArray<class UMoviePipelineSetting*> FindSettingsByClass(TSubclassOf<class UMoviePipelineSetting> InClass, const bool bIncludeDisabledSettings) const;
	TArray<class UMoviePipelineSetting*> GetUserSettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineConfigBase">();
	}
	static class UMoviePipelineConfigBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineConfigBase>();
	}
};
static_assert(alignof(UMoviePipelineConfigBase) == 0x000008, "Wrong alignment on UMoviePipelineConfigBase");
static_assert(sizeof(UMoviePipelineConfigBase) == 0x000050, "Wrong size on UMoviePipelineConfigBase");
static_assert(offsetof(UMoviePipelineConfigBase, DisplayName) == 0x000028, "Member 'UMoviePipelineConfigBase::DisplayName' has a wrong offset!");
static_assert(offsetof(UMoviePipelineConfigBase, Settings) == 0x000038, "Member 'UMoviePipelineConfigBase::Settings' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineDebugSettings
// 0x0010 (0x0058 - 0x0048)
class UMoviePipelineDebugSettings final : public UMoviePipelineSetting
{
public:
	bool                                          bWriteAllSamples;                                  // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureFramesWithRenderDoc;                       // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CaptureFrame;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineDebugSettings">();
	}
	static class UMoviePipelineDebugSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineDebugSettings>();
	}
};
static_assert(alignof(UMoviePipelineDebugSettings) == 0x000008, "Wrong alignment on UMoviePipelineDebugSettings");
static_assert(sizeof(UMoviePipelineDebugSettings) == 0x000058, "Wrong size on UMoviePipelineDebugSettings");
static_assert(offsetof(UMoviePipelineDebugSettings, bWriteAllSamples) == 0x000048, "Member 'UMoviePipelineDebugSettings::bWriteAllSamples' has a wrong offset!");
static_assert(offsetof(UMoviePipelineDebugSettings, bCaptureFramesWithRenderDoc) == 0x000049, "Member 'UMoviePipelineDebugSettings::bCaptureFramesWithRenderDoc' has a wrong offset!");
static_assert(offsetof(UMoviePipelineDebugSettings, CaptureFrame) == 0x00004C, "Member 'UMoviePipelineDebugSettings::CaptureFrame' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineExecutorBase
// 0x00E0 (0x0108 - 0x0028)
class UMoviePipelineExecutorBase : public UObject
{
public:
	FMulticastInlineDelegateProperty_             OnExecutorFinishedDelegate;                        // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x18];                                      // 0x0038(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnExecutorErroredDelegate;                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             SocketMessageRecievedDelegate;                     // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             HTTPResponseRecievedDelegate;                      // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UMovieRenderDebugWidget>    DebugWidgetClass;                                  // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserData;                                          // 0x00A8(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMoviePipeline>             TargetPipelineClass;                               // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x48];                                      // 0x00C0(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelAllJobs();
	void CancelCurrentJob();
	bool ConnectSocket(const class FString& InHostName, const int32 InPort);
	void DisconnectSocket();
	void Execute(class UMoviePipelineQueue* InPipelineQueue);
	void OnBeginFrame();
	void OnExecutorErroredImpl(class UMoviePipeline* ErroredPipeline, bool bFatal, const class FText& ErrorReason);
	void OnExecutorFinishedImpl();
	int32 SendHTTPRequest(const class FString& InURL, const class FString& InVerb, const class FString& InMessage, const TMap<class FString, class FString>& InHeaders);
	bool SendSocketMessage(const class FString& InMessage);
	void SetMoviePipelineClass(class UClass* InPipelineClass);
	void SetStatusMessage(const class FString& InStatus);
	void SetStatusProgress(const float InProgress);

	class FString GetStatusMessage() const;
	float GetStatusProgress() const;
	bool IsRendering() const;
	bool IsSocketConnected() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineExecutorBase">();
	}
	static class UMoviePipelineExecutorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineExecutorBase>();
	}
};
static_assert(alignof(UMoviePipelineExecutorBase) == 0x000008, "Wrong alignment on UMoviePipelineExecutorBase");
static_assert(sizeof(UMoviePipelineExecutorBase) == 0x000108, "Wrong size on UMoviePipelineExecutorBase");
static_assert(offsetof(UMoviePipelineExecutorBase, OnExecutorFinishedDelegate) == 0x000028, "Member 'UMoviePipelineExecutorBase::OnExecutorFinishedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, OnExecutorErroredDelegate) == 0x000050, "Member 'UMoviePipelineExecutorBase::OnExecutorErroredDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, SocketMessageRecievedDelegate) == 0x000080, "Member 'UMoviePipelineExecutorBase::SocketMessageRecievedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, HTTPResponseRecievedDelegate) == 0x000090, "Member 'UMoviePipelineExecutorBase::HTTPResponseRecievedDelegate' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, DebugWidgetClass) == 0x0000A0, "Member 'UMoviePipelineExecutorBase::DebugWidgetClass' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, UserData) == 0x0000A8, "Member 'UMoviePipelineExecutorBase::UserData' has a wrong offset!");
static_assert(offsetof(UMoviePipelineExecutorBase, TargetPipelineClass) == 0x0000B8, "Member 'UMoviePipelineExecutorBase::TargetPipelineClass' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineOutputBase
// 0x0000 (0x0048 - 0x0048)
class UMoviePipelineOutputBase : public UMoviePipelineSetting
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineOutputBase">();
	}
	static class UMoviePipelineOutputBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineOutputBase>();
	}
};
static_assert(alignof(UMoviePipelineOutputBase) == 0x000008, "Wrong alignment on UMoviePipelineOutputBase");
static_assert(sizeof(UMoviePipelineOutputBase) == 0x000048, "Wrong size on UMoviePipelineOutputBase");

// Class MovieRenderPipelineCore.MoviePipelineFCPXMLExporter
// 0x0038 (0x0080 - 0x0048)
class UMoviePipelineFCPXMLExporter final : public UMoviePipelineOutputBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormatOverride;                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFCPXMLExportDataSource                       DataSource;                                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x1F];                                      // 0x0061(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineFCPXMLExporter">();
	}
	static class UMoviePipelineFCPXMLExporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineFCPXMLExporter>();
	}
};
static_assert(alignof(UMoviePipelineFCPXMLExporter) == 0x000008, "Wrong alignment on UMoviePipelineFCPXMLExporter");
static_assert(sizeof(UMoviePipelineFCPXMLExporter) == 0x000080, "Wrong size on UMoviePipelineFCPXMLExporter");
static_assert(offsetof(UMoviePipelineFCPXMLExporter, FileNameFormatOverride) == 0x000050, "Member 'UMoviePipelineFCPXMLExporter::FileNameFormatOverride' has a wrong offset!");
static_assert(offsetof(UMoviePipelineFCPXMLExporter, DataSource) == 0x000060, "Member 'UMoviePipelineFCPXMLExporter::DataSource' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineGameMode
// 0x0000 (0x0318 - 0x0318)
class AMoviePipelineGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineGameMode">();
	}
	static class AMoviePipelineGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMoviePipelineGameMode>();
	}
};
static_assert(alignof(AMoviePipelineGameMode) == 0x000008, "Wrong alignment on AMoviePipelineGameMode");
static_assert(sizeof(AMoviePipelineGameMode) == 0x000318, "Wrong size on AMoviePipelineGameMode");

// Class MovieRenderPipelineCore.MoviePipelineGameOverrideSetting
// 0x00C8 (0x0110 - 0x0048)
class UMoviePipelineGameOverrideSetting final : public UMoviePipelineSetting
{
public:
	TSubclassOf<class AGameModeBase>              GameModeOverride;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCinematicQualitySettings;                         // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMoviePipelineTextureStreamingMethod          TextureStreaming;                                  // 0x0051(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseLODZero;                                       // 0x0052(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableHLODs;                                     // 0x0053(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighQualityShadows;                            // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ShadowDistanceScale;                               // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShadowRadiusThreshold;                             // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideViewDistanceScale;                        // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ViewDistanceScale;                                 // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlushGrassStreaming;                              // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0xA7];                                      // 0x0069(0x00A7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineGameOverrideSetting">();
	}
	static class UMoviePipelineGameOverrideSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineGameOverrideSetting>();
	}
};
static_assert(alignof(UMoviePipelineGameOverrideSetting) == 0x000008, "Wrong alignment on UMoviePipelineGameOverrideSetting");
static_assert(sizeof(UMoviePipelineGameOverrideSetting) == 0x000110, "Wrong size on UMoviePipelineGameOverrideSetting");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, GameModeOverride) == 0x000048, "Member 'UMoviePipelineGameOverrideSetting::GameModeOverride' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bCinematicQualitySettings) == 0x000050, "Member 'UMoviePipelineGameOverrideSetting::bCinematicQualitySettings' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, TextureStreaming) == 0x000051, "Member 'UMoviePipelineGameOverrideSetting::TextureStreaming' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bUseLODZero) == 0x000052, "Member 'UMoviePipelineGameOverrideSetting::bUseLODZero' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bDisableHLODs) == 0x000053, "Member 'UMoviePipelineGameOverrideSetting::bDisableHLODs' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bUseHighQualityShadows) == 0x000054, "Member 'UMoviePipelineGameOverrideSetting::bUseHighQualityShadows' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, ShadowDistanceScale) == 0x000058, "Member 'UMoviePipelineGameOverrideSetting::ShadowDistanceScale' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, ShadowRadiusThreshold) == 0x00005C, "Member 'UMoviePipelineGameOverrideSetting::ShadowRadiusThreshold' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bOverrideViewDistanceScale) == 0x000060, "Member 'UMoviePipelineGameOverrideSetting::bOverrideViewDistanceScale' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, ViewDistanceScale) == 0x000064, "Member 'UMoviePipelineGameOverrideSetting::ViewDistanceScale' has a wrong offset!");
static_assert(offsetof(UMoviePipelineGameOverrideSetting, bFlushGrassStreaming) == 0x000068, "Member 'UMoviePipelineGameOverrideSetting::bFlushGrassStreaming' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineHighResSetting
// 0x0018 (0x0060 - 0x0048)
class UMoviePipelineHighResSetting final : public UMoviePipelineSetting
{
public:
	int32                                         TileCount;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TextureSharpnessBias;                              // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverlapRatio;                                      // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSubSurfaceScattering;                     // 0x0054(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BurleySampleCount;                                 // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineHighResSetting">();
	}
	static class UMoviePipelineHighResSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineHighResSetting>();
	}
};
static_assert(alignof(UMoviePipelineHighResSetting) == 0x000008, "Wrong alignment on UMoviePipelineHighResSetting");
static_assert(sizeof(UMoviePipelineHighResSetting) == 0x000060, "Wrong size on UMoviePipelineHighResSetting");
static_assert(offsetof(UMoviePipelineHighResSetting, TileCount) == 0x000048, "Member 'UMoviePipelineHighResSetting::TileCount' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, TextureSharpnessBias) == 0x00004C, "Member 'UMoviePipelineHighResSetting::TextureSharpnessBias' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, OverlapRatio) == 0x000050, "Member 'UMoviePipelineHighResSetting::OverlapRatio' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, bOverrideSubSurfaceScattering) == 0x000054, "Member 'UMoviePipelineHighResSetting::bOverrideSubSurfaceScattering' has a wrong offset!");
static_assert(offsetof(UMoviePipelineHighResSetting, BurleySampleCount) == 0x000058, "Member 'UMoviePipelineHighResSetting::BurleySampleCount' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineLinearExecutorBase
// 0x0028 (0x0130 - 0x0108)
class UMoviePipelineLinearExecutorBase : public UMoviePipelineExecutorBase
{
public:
	class UMoviePipelineQueue*                    Queue;                                             // 0x0108(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMoviePipeline*                         ActiveMoviePipeline;                               // 0x0110(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x18];                                     // 0x0118(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineLinearExecutorBase">();
	}
	static class UMoviePipelineLinearExecutorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineLinearExecutorBase>();
	}
};
static_assert(alignof(UMoviePipelineLinearExecutorBase) == 0x000008, "Wrong alignment on UMoviePipelineLinearExecutorBase");
static_assert(sizeof(UMoviePipelineLinearExecutorBase) == 0x000130, "Wrong size on UMoviePipelineLinearExecutorBase");
static_assert(offsetof(UMoviePipelineLinearExecutorBase, Queue) == 0x000108, "Member 'UMoviePipelineLinearExecutorBase::Queue' has a wrong offset!");
static_assert(offsetof(UMoviePipelineLinearExecutorBase, ActiveMoviePipeline) == 0x000110, "Member 'UMoviePipelineLinearExecutorBase::ActiveMoviePipeline' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineInProcessExecutor
// 0x0038 (0x0168 - 0x0130)
class UMoviePipelineInProcessExecutor final : public UMoviePipelineLinearExecutorBase
{
public:
	bool                                          bUseCurrentLevel;                                  // 0x0130(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x37];                                     // 0x0131(0x0037)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineInProcessExecutor">();
	}
	static class UMoviePipelineInProcessExecutor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineInProcessExecutor>();
	}
};
static_assert(alignof(UMoviePipelineInProcessExecutor) == 0x000008, "Wrong alignment on UMoviePipelineInProcessExecutor");
static_assert(sizeof(UMoviePipelineInProcessExecutor) == 0x000168, "Wrong size on UMoviePipelineInProcessExecutor");
static_assert(offsetof(UMoviePipelineInProcessExecutor, bUseCurrentLevel) == 0x000130, "Member 'UMoviePipelineInProcessExecutor::bUseCurrentLevel' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineInProcessExecutorSettings
// 0x0030 (0x0068 - 0x0038)
class UMoviePipelineInProcessExecutorSettings final : public UDeveloperSettings
{
public:
	bool                                          bCloseEditor;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AdditionalCommandLineArguments;                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InheritedCommandLineArguments;                     // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, Config, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialDelayFrameCount;                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineInProcessExecutorSettings">();
	}
	static class UMoviePipelineInProcessExecutorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineInProcessExecutorSettings>();
	}
};
static_assert(alignof(UMoviePipelineInProcessExecutorSettings) == 0x000008, "Wrong alignment on UMoviePipelineInProcessExecutorSettings");
static_assert(sizeof(UMoviePipelineInProcessExecutorSettings) == 0x000068, "Wrong size on UMoviePipelineInProcessExecutorSettings");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, bCloseEditor) == 0x000038, "Member 'UMoviePipelineInProcessExecutorSettings::bCloseEditor' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, AdditionalCommandLineArguments) == 0x000040, "Member 'UMoviePipelineInProcessExecutorSettings::AdditionalCommandLineArguments' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, InheritedCommandLineArguments) == 0x000050, "Member 'UMoviePipelineInProcessExecutorSettings::InheritedCommandLineArguments' has a wrong offset!");
static_assert(offsetof(UMoviePipelineInProcessExecutorSettings, InitialDelayFrameCount) == 0x000060, "Member 'UMoviePipelineInProcessExecutorSettings::InitialDelayFrameCount' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineMasterConfig
// 0x0068 (0x00B8 - 0x0050)
class UMoviePipelineMasterConfig final : public UMoviePipelineConfigBase
{
public:
	TMap<class FString, class UMoviePipelineShotConfig*> PerShotConfigMapping;                              // 0x0050(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UMoviePipelineOutputSetting*            OutputSetting;                                     // 0x00A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UMoviePipelineSetting*>          TransientSettings;                                 // 0x00A8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

public:
	void InitializeTransientSettings();

	TArray<class UMoviePipelineSetting*> GetAllSettings(const bool bIncludeDisabledSettings, const bool bIncludeTransientSettings) const;
	struct FFrameRate GetEffectiveFrameRate(const class ULevelSequence* InSequence) const;
	TArray<class UMoviePipelineSetting*> GetTransientSettings() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MoviePipelineMasterConfig">();
	}
	static class UMoviePipelineMasterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMoviePipelineMasterConfig>();
	}
};
static_assert(alignof(UMoviePipelineMasterConfig) == 0x000008, "Wrong alignment on UMoviePipelineMasterConfig");
static_assert(sizeof(UMoviePipelineMasterConfig) == 0x0000B8, "Wrong size on UMoviePipelineMasterConfig");
static_assert(offsetof(UMoviePipelineMasterConfig, PerShotConfigMapping) == 0x000050, "Member 'UMoviePipelineMasterConfig::PerShotConfigMapping' has a wrong offset!");
static_assert(offsetof(UMoviePipelineMasterConfig, OutputSetting) == 0x0000A0, "Member 'UMoviePipelineMasterConfig::OutputSetting' has a wrong offset!");
static_assert(offsetof(UMoviePipelineMasterConfig, TransientSettings) == 0x0000A8, "Member 'UMoviePipelineMasterConfig::TransientSettings' has a wrong offset!");

// Class MovieRenderPipelineCore.MoviePipelineOutputSetting
// 0x0068 (0x00B0 - 0x0048)
class UMoviePipelineOutputSetting final : public UMoviePipelineSetting
{
public:
	struct FDirectoryPath                         OutputDirectory;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FileNameFormat;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              OutputResolution;                                  // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomFrameRate;                               // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFrameRate                             OutputFrameRate;                                   // 0x0074(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bOverrideExistingOutput;                           // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HandleFrameCount;                                  // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputFrameStep;                                   // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCustomPlaybackRange;                           // 0x008C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
