#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieRenderPipelineCore_structs.hpp"


namespace SDK::Params
{

// Function MovieRenderPipelineCore.MoviePipelineSetting.BuildNewProcessCommandLine
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineSetting_BuildNewProcessCommandLine final
{
public:
	class FString                                 InOutUnrealURLParams;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InOutCommandLineArgs;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineSetting_BuildNewProcessCommandLine) == 0x000008, "Wrong alignment on MoviePipelineSetting_BuildNewProcessCommandLine");
static_assert(sizeof(MoviePipelineSetting_BuildNewProcessCommandLine) == 0x000020, "Wrong size on MoviePipelineSetting_BuildNewProcessCommandLine");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLine, InOutUnrealURLParams) == 0x000000, "Member 'MoviePipelineSetting_BuildNewProcessCommandLine::InOutUnrealURLParams' has a wrong offset!");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLine, InOutCommandLineArgs) == 0x000010, "Member 'MoviePipelineSetting_BuildNewProcessCommandLine::InOutCommandLineArgs' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineSetting.BuildNewProcessCommandLineArgs
// 0x0040 (0x0040 - 0x0000)
struct MoviePipelineSetting_BuildNewProcessCommandLineArgs final
{
public:
	TArray<class FString>                         InOutUnrealURLParams;                              // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         InOutCommandLineArgs;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         InOutDeviceProfileCvars;                           // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         InOutExecCmds;                                     // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineSetting_BuildNewProcessCommandLineArgs) == 0x000008, "Wrong alignment on MoviePipelineSetting_BuildNewProcessCommandLineArgs");
static_assert(sizeof(MoviePipelineSetting_BuildNewProcessCommandLineArgs) == 0x000040, "Wrong size on MoviePipelineSetting_BuildNewProcessCommandLineArgs");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLineArgs, InOutUnrealURLParams) == 0x000000, "Member 'MoviePipelineSetting_BuildNewProcessCommandLineArgs::InOutUnrealURLParams' has a wrong offset!");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLineArgs, InOutCommandLineArgs) == 0x000010, "Member 'MoviePipelineSetting_BuildNewProcessCommandLineArgs::InOutCommandLineArgs' has a wrong offset!");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLineArgs, InOutDeviceProfileCvars) == 0x000020, "Member 'MoviePipelineSetting_BuildNewProcessCommandLineArgs::InOutDeviceProfileCvars' has a wrong offset!");
static_assert(offsetof(MoviePipelineSetting_BuildNewProcessCommandLineArgs, InOutExecCmds) == 0x000030, "Member 'MoviePipelineSetting_BuildNewProcessCommandLineArgs::InOutExecCmds' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.Initialize
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_Initialize final
{
public:
	class UMoviePipelineExecutorJob*              InJob;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_Initialize) == 0x000008, "Wrong alignment on MoviePipeline_Initialize");
static_assert(sizeof(MoviePipeline_Initialize) == 0x000008, "Wrong size on MoviePipeline_Initialize");
static_assert(offsetof(MoviePipeline_Initialize, InJob) == 0x000000, "Member 'MoviePipeline_Initialize::InJob' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.RequestShutdown
// 0x0001 (0x0001 - 0x0000)
struct MoviePipeline_RequestShutdown final
{
public:
	bool                                          bIsError;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_RequestShutdown) == 0x000001, "Wrong alignment on MoviePipeline_RequestShutdown");
static_assert(sizeof(MoviePipeline_RequestShutdown) == 0x000001, "Wrong size on MoviePipeline_RequestShutdown");
static_assert(offsetof(MoviePipeline_RequestShutdown, bIsError) == 0x000000, "Member 'MoviePipeline_RequestShutdown::bIsError' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.SetInitializationTime
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_SetInitializationTime final
{
public:
	struct FDateTime                              InDateTime;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_SetInitializationTime) == 0x000008, "Wrong alignment on MoviePipeline_SetInitializationTime");
static_assert(sizeof(MoviePipeline_SetInitializationTime) == 0x000008, "Wrong size on MoviePipeline_SetInitializationTime");
static_assert(offsetof(MoviePipeline_SetInitializationTime, InDateTime) == 0x000000, "Member 'MoviePipeline_SetInitializationTime::InDateTime' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.Shutdown
// 0x0001 (0x0001 - 0x0000)
struct MoviePipeline_Shutdown final
{
public:
	bool                                          bError;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_Shutdown) == 0x000001, "Wrong alignment on MoviePipeline_Shutdown");
static_assert(sizeof(MoviePipeline_Shutdown) == 0x000001, "Wrong size on MoviePipeline_Shutdown");
static_assert(offsetof(MoviePipeline_Shutdown, bError) == 0x000000, "Member 'MoviePipeline_Shutdown::bError' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.GetCurrentJob
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_GetCurrentJob final
{
public:
	class UMoviePipelineExecutorJob*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_GetCurrentJob) == 0x000008, "Wrong alignment on MoviePipeline_GetCurrentJob");
static_assert(sizeof(MoviePipeline_GetCurrentJob) == 0x000008, "Wrong size on MoviePipeline_GetCurrentJob");
static_assert(offsetof(MoviePipeline_GetCurrentJob, ReturnValue) == 0x000000, "Member 'MoviePipeline_GetCurrentJob::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.GetInitializationTime
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_GetInitializationTime final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_GetInitializationTime) == 0x000008, "Wrong alignment on MoviePipeline_GetInitializationTime");
static_assert(sizeof(MoviePipeline_GetInitializationTime) == 0x000008, "Wrong size on MoviePipeline_GetInitializationTime");
static_assert(offsetof(MoviePipeline_GetInitializationTime, ReturnValue) == 0x000000, "Member 'MoviePipeline_GetInitializationTime::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.GetPipelineMasterConfig
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_GetPipelineMasterConfig final
{
public:
	class UMoviePipelineMasterConfig*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_GetPipelineMasterConfig) == 0x000008, "Wrong alignment on MoviePipeline_GetPipelineMasterConfig");
static_assert(sizeof(MoviePipeline_GetPipelineMasterConfig) == 0x000008, "Wrong size on MoviePipeline_GetPipelineMasterConfig");
static_assert(offsetof(MoviePipeline_GetPipelineMasterConfig, ReturnValue) == 0x000000, "Member 'MoviePipeline_GetPipelineMasterConfig::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.GetPreviewTexture
// 0x0008 (0x0008 - 0x0000)
struct MoviePipeline_GetPreviewTexture final
{
public:
	class UTexture*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_GetPreviewTexture) == 0x000008, "Wrong alignment on MoviePipeline_GetPreviewTexture");
static_assert(sizeof(MoviePipeline_GetPreviewTexture) == 0x000008, "Wrong size on MoviePipeline_GetPreviewTexture");
static_assert(offsetof(MoviePipeline_GetPreviewTexture, ReturnValue) == 0x000000, "Member 'MoviePipeline_GetPreviewTexture::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipeline.IsShutdownRequested
// 0x0001 (0x0001 - 0x0000)
struct MoviePipeline_IsShutdownRequested final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipeline_IsShutdownRequested) == 0x000001, "Wrong alignment on MoviePipeline_IsShutdownRequested");
static_assert(sizeof(MoviePipeline_IsShutdownRequested) == 0x000001, "Wrong size on MoviePipeline_IsShutdownRequested");
static_assert(offsetof(MoviePipeline_IsShutdownRequested, ReturnValue) == 0x000000, "Member 'MoviePipeline_IsShutdownRequested::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.DuplicateSequence
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_DuplicateSequence final
{
public:
	class UObject*                                Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieSceneSequence*                    InSequence;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieSceneSequence*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_DuplicateSequence) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_DuplicateSequence");
static_assert(sizeof(MoviePipelineBlueprintLibrary_DuplicateSequence) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_DuplicateSequence");
static_assert(offsetof(MoviePipelineBlueprintLibrary_DuplicateSequence, Outer_0) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_DuplicateSequence::Outer_0' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_DuplicateSequence, InSequence) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_DuplicateSequence::InSequence' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_DuplicateSequence, ReturnValue) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_DuplicateSequence::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.FindOrGetDefaultSettingForShot
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot final
{
public:
	TSubclassOf<class UMoviePipelineSetting>      InSettingType;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UMoviePipelineMasterConfig*       InMasterConfig;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UMoviePipelineExecutorShot*       InShot;                                            // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineSetting*                  ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot");
static_assert(sizeof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot");
static_assert(offsetof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot, InSettingType) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot::InSettingType' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot, InMasterConfig) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot::InMasterConfig' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot, InShot) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot::InShot' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot, ReturnValue) == 0x000018, "Member 'MoviePipelineBlueprintLibrary_FindOrGetDefaultSettingForShot::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCompletionPercentage
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCompletionPercentage final
{
public:
	const class UMoviePipeline*                   InPipeline;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCompletionPercentage) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCompletionPercentage");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCompletionPercentage) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCompletionPercentage");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCompletionPercentage, InPipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCompletionPercentage::InPipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCompletionPercentage, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCompletionPercentage::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentAperture
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentAperture final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentAperture) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentAperture");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentAperture) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentAperture");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentAperture, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentAperture::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentAperture, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentAperture::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentExecutorShot
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentExecutorShot final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorShot*             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentExecutorShot) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentExecutorShot");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentExecutorShot) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentExecutorShot");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentExecutorShot, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentExecutorShot::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentExecutorShot, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentExecutorShot::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentFocalLength
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentFocalLength final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentFocalLength) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentFocalLength");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentFocalLength) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentFocalLength");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentFocalLength, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentFocalLength::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentFocalLength, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentFocalLength::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentFocusDistance
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentFocusDistance final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentFocusDistance) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentFocusDistance");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentFocusDistance) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentFocusDistance");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentFocusDistance, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentFocusDistance::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentFocusDistance, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentFocusDistance::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentSegmentName
// 0x0038 (0x0038 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentSegmentName final
{
public:
	class UMoviePipeline*                         InMoviePipeline;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutOuterName;                                      // 0x0008(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                   OutInnerName;                                      // 0x0020(0x0018)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentSegmentName) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentSegmentName");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentSegmentName) == 0x000038, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentSegmentName");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentName, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentName::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentName, OutOuterName) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentName::OutOuterName' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentName, OutInnerName) == 0x000020, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentName::OutInnerName' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentSegmentState
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentSegmentState final
{
public:
	class UMoviePipeline*                         InMoviePipeline;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieRenderShotState                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentSegmentState) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentSegmentState");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentSegmentState) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentSegmentState");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentState, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentState::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentState, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentState::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentSegmentWorkMetrics
// 0x0030 (0x0030 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoviePipelineSegmentWorkMetrics       ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics) == 0x000030, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSegmentWorkMetrics::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentSequence
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentSequence final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULevelSequence*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentSequence) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentSequence");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentSequence) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentSequence");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSequence, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSequence::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentSequence, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentSequence::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentShotFrameNumber
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentShotFrameNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetCurrentShotTimecode
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetCurrentShotTimecode final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x0008(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetCurrentShotTimecode) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetCurrentShotTimecode");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetCurrentShotTimecode) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_GetCurrentShotTimecode");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentShotTimecode, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetCurrentShotTimecode::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetCurrentShotTimecode, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetCurrentShotTimecode::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetEffectiveOutputResolution
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution final
{
public:
	class UMoviePipelineMasterConfig*             InMasterConfig;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorShot*             InPipelineExecutorShot;                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution, InMasterConfig) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution::InMasterConfig' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution, InPipelineExecutorShot) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution::InPipelineExecutorShot' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution, ReturnValue) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_GetEffectiveOutputResolution::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetEstimatedTimeRemaining
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining final
{
public:
	const class UMoviePipeline*                   InPipeline;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              OutEstimate;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining, InPipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining::InPipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining, OutEstimate) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining::OutEstimate' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining, ReturnValue) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_GetEstimatedTimeRemaining::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetJobAuthor
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetJobAuthor final
{
public:
	class UMoviePipeline*                         InMoviePipeline;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetJobAuthor) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetJobAuthor");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetJobAuthor) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_GetJobAuthor");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobAuthor, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetJobAuthor::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobAuthor, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetJobAuthor::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetJobInitializationTime
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetJobInitializationTime final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetJobInitializationTime) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetJobInitializationTime");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetJobInitializationTime) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetJobInitializationTime");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobInitializationTime, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetJobInitializationTime::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobInitializationTime, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetJobInitializationTime::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetJobName
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetJobName final
{
public:
	class UMoviePipeline*                         InMoviePipeline;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetJobName) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetJobName");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetJobName) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_GetJobName");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobName, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetJobName::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetJobName, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetJobName::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetMapPackageName
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetMapPackageName final
{
public:
	class UMoviePipelineExecutorJob*              InJob;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetMapPackageName) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetMapPackageName");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetMapPackageName) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_GetMapPackageName");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMapPackageName, InJob) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetMapPackageName::InJob' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMapPackageName, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetMapPackageName::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetMasterFrameNumber
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetMasterFrameNumber final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetMasterFrameNumber) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetMasterFrameNumber");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetMasterFrameNumber) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetMasterFrameNumber");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMasterFrameNumber, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetMasterFrameNumber::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMasterFrameNumber, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetMasterFrameNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetMasterTimecode
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetMasterTimecode final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x0008(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetMasterTimecode) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetMasterTimecode");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetMasterTimecode) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_GetMasterTimecode");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMasterTimecode, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetMasterTimecode::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMasterTimecode, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetMasterTimecode::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetMoviePipelineEngineChangelistLabel
// 0x0020 (0x0020 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel) == 0x000020, "Wrong size on MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetMoviePipelineEngineChangelistLabel::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetOverallOutputFrames
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetOverallOutputFrames final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutCurrentIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalCount;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetOverallOutputFrames) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetOverallOutputFrames");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetOverallOutputFrames) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetOverallOutputFrames");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallOutputFrames, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetOverallOutputFrames::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallOutputFrames, OutCurrentIndex) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetOverallOutputFrames::OutCurrentIndex' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallOutputFrames, OutTotalCount) == 0x00000C, "Member 'MoviePipelineBlueprintLibrary_GetOverallOutputFrames::OutTotalCount' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetOverallSegmentCounts
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetOverallSegmentCounts final
{
public:
	const class UMoviePipeline*                   InMoviePipeline;                                   // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutCurrentIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalCount;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetOverallSegmentCounts) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetOverallSegmentCounts");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetOverallSegmentCounts) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetOverallSegmentCounts");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallSegmentCounts, InMoviePipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetOverallSegmentCounts::InMoviePipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallSegmentCounts, OutCurrentIndex) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetOverallSegmentCounts::OutCurrentIndex' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetOverallSegmentCounts, OutTotalCount) == 0x00000C, "Member 'MoviePipelineBlueprintLibrary_GetOverallSegmentCounts::OutTotalCount' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.GetPipelineState
// 0x0010 (0x0010 - 0x0000)
struct MoviePipelineBlueprintLibrary_GetPipelineState final
{
public:
	const class UMoviePipeline*                   InPipeline;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieRenderPipelineState                     ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_GetPipelineState) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_GetPipelineState");
static_assert(sizeof(MoviePipelineBlueprintLibrary_GetPipelineState) == 0x000010, "Wrong size on MoviePipelineBlueprintLibrary_GetPipelineState");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetPipelineState, InPipeline) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_GetPipelineState::InPipeline' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_GetPipelineState, ReturnValue) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_GetPipelineState::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.LoadManifestFileFromString
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_LoadManifestFileFromString final
{
public:
	class FString                                 InManifestFilePath;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineQueue*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_LoadManifestFileFromString) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_LoadManifestFileFromString");
static_assert(sizeof(MoviePipelineBlueprintLibrary_LoadManifestFileFromString) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_LoadManifestFileFromString");
static_assert(offsetof(MoviePipelineBlueprintLibrary_LoadManifestFileFromString, InManifestFilePath) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_LoadManifestFileFromString::InManifestFilePath' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_LoadManifestFileFromString, ReturnValue) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_LoadManifestFileFromString::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.ResolveFilenameFormatArguments
// 0x01C8 (0x01C8 - 0x0000)
struct MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments final
{
public:
	class FString                                 InFormatString;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoviePipelineFilenameResolveParams    InParams;                                          // 0x0010(0x0100)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 OutFinalPath;                                      // 0x0110(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoviePipelineFormatArgs               OutMergedFormatArgs;                               // 0x0120(0x00A8)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments");
static_assert(sizeof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments) == 0x0001C8, "Wrong size on MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments, InFormatString) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments::InFormatString' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments, InParams) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments::InParams' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments, OutFinalPath) == 0x000110, "Member 'MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments::OutFinalPath' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments, OutMergedFormatArgs) == 0x000120, "Member 'MoviePipelineBlueprintLibrary_ResolveFilenameFormatArguments::OutMergedFormatArgs' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.ResolveVersionNumber
// 0x0108 (0x0108 - 0x0000)
struct MoviePipelineBlueprintLibrary_ResolveVersionNumber final
{
public:
	struct FMoviePipelineFilenameResolveParams    InParams;                                          // 0x0000(0x0100)(Parm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0100(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_ResolveVersionNumber) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_ResolveVersionNumber");
static_assert(sizeof(MoviePipelineBlueprintLibrary_ResolveVersionNumber) == 0x000108, "Wrong size on MoviePipelineBlueprintLibrary_ResolveVersionNumber");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveVersionNumber, InParams) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_ResolveVersionNumber::InParams' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_ResolveVersionNumber, ReturnValue) == 0x000100, "Member 'MoviePipelineBlueprintLibrary_ResolveVersionNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineBlueprintLibrary.UpdateJobShotListFromSequence
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence final
{
public:
	class ULevelSequence*                         InSequence;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoviePipelineExecutorJob*              InJob;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShotsChanged;                                     // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence) == 0x000008, "Wrong alignment on MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence");
static_assert(sizeof(MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence) == 0x000018, "Wrong size on MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence");
static_assert(offsetof(MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence, InSequence) == 0x000000, "Member 'MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence::InSequence' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence, InJob) == 0x000008, "Member 'MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence::InJob' has a wrong offset!");
static_assert(offsetof(MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence, bShotsChanged) == 0x000010, "Member 'MoviePipelineBlueprintLibrary_UpdateJobShotListFromSequence::bShotsChanged' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineConfigBase.CopyFrom
// 0x0008 (0x0008 - 0x0000)
struct MoviePipelineConfigBase_CopyFrom final
{
public:
	class UMoviePipelineConfigBase*               InConfig;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineConfigBase_CopyFrom) == 0x000008, "Wrong alignment on MoviePipelineConfigBase_CopyFrom");
static_assert(sizeof(MoviePipelineConfigBase_CopyFrom) == 0x000008, "Wrong size on MoviePipelineConfigBase_CopyFrom");
static_assert(offsetof(MoviePipelineConfigBase_CopyFrom, InConfig) == 0x000000, "Member 'MoviePipelineConfigBase_CopyFrom::InConfig' has a wrong offset!");

// Function MovieRenderPipelineCore.MoviePipelineConfigBase.FindOrAddSettingByClass
// 0x0018 (0x0018 - 0x0000)
struct MoviePipelineConfigBase_FindOrAddSettingByClass final
{
public:
	TSubclassOf<class UMoviePipelineSetting>      InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeDisabledSettings;                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoviePipelineSetting*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MoviePipelineConfigBase_FindOrAddSettingByClass) == 0x000008, "Wrong alignment on MoviePipelineConfigBase_FindOrAddSettingByClass");
static_assert(sizeof(MoviePipelineConfigBase_FindOrAddSettingByClass) == 0x000018, "Wrong size on MoviePipelineConfigBase_FindOrAddSettingByClass");
static_assert(offsetof(MoviePipelineConfigBase_FindOrAddSettingByClass, InClass) == 0x000000, "Member 'MoviePipelineConfigBase_FindOrAddSettingByClass::InClass' has a wrong offset!");
