#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Niagara.NiagaraActor.OnNiagaraSystemFinished
// 0x0008 (0x0008 - 0x0000)
struct NiagaraActor_OnNiagaraSystemFinished final
{
public:
	class UNiagaraComponent*                      FinishedComponent;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActor_OnNiagaraSystemFinished) == 0x000008, "Wrong alignment on NiagaraActor_OnNiagaraSystemFinished");
static_assert(sizeof(NiagaraActor_OnNiagaraSystemFinished) == 0x000008, "Wrong size on NiagaraActor_OnNiagaraSystemFinished");
static_assert(offsetof(NiagaraActor_OnNiagaraSystemFinished, FinishedComponent) == 0x000000, "Member 'NiagaraActor_OnNiagaraSystemFinished::FinishedComponent' has a wrong offset!");

// Function Niagara.NiagaraActor.SetDestroyOnSystemFinish
// 0x0001 (0x0001 - 0x0000)
struct NiagaraActor_SetDestroyOnSystemFinish final
{
public:
	bool                                          bShouldDestroyOnSystemFinish;                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraActor_SetDestroyOnSystemFinish) == 0x000001, "Wrong alignment on NiagaraActor_SetDestroyOnSystemFinish");
static_assert(sizeof(NiagaraActor_SetDestroyOnSystemFinish) == 0x000001, "Wrong size on NiagaraActor_SetDestroyOnSystemFinish");
static_assert(offsetof(NiagaraActor_SetDestroyOnSystemFinish, bShouldDestroyOnSystemFinish) == 0x000000, "Member 'NiagaraActor_SetDestroyOnSystemFinish::bShouldDestroyOnSystemFinish' has a wrong offset!");

// Function Niagara.NiagaraComponent.AdvanceSimulation
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_AdvanceSimulation final
{
public:
	int32                                         TickCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickDeltaSeconds;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_AdvanceSimulation) == 0x000004, "Wrong alignment on NiagaraComponent_AdvanceSimulation");
static_assert(sizeof(NiagaraComponent_AdvanceSimulation) == 0x000008, "Wrong size on NiagaraComponent_AdvanceSimulation");
static_assert(offsetof(NiagaraComponent_AdvanceSimulation, TickCount) == 0x000000, "Member 'NiagaraComponent_AdvanceSimulation::TickCount' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_AdvanceSimulation, TickDeltaSeconds) == 0x000004, "Member 'NiagaraComponent_AdvanceSimulation::TickDeltaSeconds' has a wrong offset!");

// Function Niagara.NiagaraComponent.AdvanceSimulationByTime
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_AdvanceSimulationByTime final
{
public:
	float                                         SimulateTime;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TickDeltaSeconds;                                  // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_AdvanceSimulationByTime) == 0x000004, "Wrong alignment on NiagaraComponent_AdvanceSimulationByTime");
static_assert(sizeof(NiagaraComponent_AdvanceSimulationByTime) == 0x000008, "Wrong size on NiagaraComponent_AdvanceSimulationByTime");
static_assert(offsetof(NiagaraComponent_AdvanceSimulationByTime, SimulateTime) == 0x000000, "Member 'NiagaraComponent_AdvanceSimulationByTime::SimulateTime' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_AdvanceSimulationByTime, TickDeltaSeconds) == 0x000004, "Member 'NiagaraComponent_AdvanceSimulationByTime::TickDeltaSeconds' has a wrong offset!");

// Function Niagara.NiagaraComponent.ClearEmitterFixedBounds
// 0x0008 (0x0008 - 0x0000)
struct NiagaraComponent_ClearEmitterFixedBounds final
{
public:
	class FName                                   EmitterName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_ClearEmitterFixedBounds) == 0x000004, "Wrong alignment on NiagaraComponent_ClearEmitterFixedBounds");
static_assert(sizeof(NiagaraComponent_ClearEmitterFixedBounds) == 0x000008, "Wrong size on NiagaraComponent_ClearEmitterFixedBounds");
static_assert(offsetof(NiagaraComponent_ClearEmitterFixedBounds, EmitterName) == 0x000000, "Member 'NiagaraComponent_ClearEmitterFixedBounds::EmitterName' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetDataInterface
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_GetDataInterface final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraDataInterface*                  ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetDataInterface) == 0x000008, "Wrong alignment on NiagaraComponent_GetDataInterface");
static_assert(sizeof(NiagaraComponent_GetDataInterface) == 0x000018, "Wrong size on NiagaraComponent_GetDataInterface");
static_assert(offsetof(NiagaraComponent_GetDataInterface, Name_0) == 0x000000, "Member 'NiagaraComponent_GetDataInterface::Name_0' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetDataInterface, ReturnValue) == 0x000010, "Member 'NiagaraComponent_GetDataInterface::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticlePositions_DebugOnly
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_GetNiagaraParticlePositions_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticlePositions_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly) == 0x000020, "Wrong size on NiagaraComponent_GetNiagaraParticlePositions_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticlePositions_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticlePositions_DebugOnly, ReturnValue) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticlePositions_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticleValues_DebugOnly
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_GetNiagaraParticleValues_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticleValues_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly) == 0x000030, "Wrong size on NiagaraComponent_GetNiagaraParticleValues_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, InValueName) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValues_DebugOnly, ReturnValue) == 0x000020, "Member 'NiagaraComponent_GetNiagaraParticleValues_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.GetNiagaraParticleValueVec3_DebugOnly
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly final
{
public:
	class FString                                 InEmitterName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InValueName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly) == 0x000008, "Wrong alignment on NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly");
static_assert(sizeof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly) == 0x000030, "Wrong size on NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, InEmitterName) == 0x000000, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::InEmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, InValueName) == 0x000010, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::InValueName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly, ReturnValue) == 0x000020, "Member 'NiagaraComponent_GetNiagaraParticleValueVec3_DebugOnly::ReturnValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SeekToDesiredAge
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SeekToDesiredAge final
{
public:
	float                                         InDesiredAge;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SeekToDesiredAge) == 0x000004, "Wrong alignment on NiagaraComponent_SeekToDesiredAge");
static_assert(sizeof(NiagaraComponent_SeekToDesiredAge) == 0x000004, "Wrong size on NiagaraComponent_SeekToDesiredAge");
static_assert(offsetof(NiagaraComponent_SeekToDesiredAge, InDesiredAge) == 0x000000, "Member 'NiagaraComponent_SeekToDesiredAge::InDesiredAge' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAgeUpdateMode
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAgeUpdateMode final
{
public:
	ENiagaraAgeUpdateMode                         InAgeUpdateMode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAgeUpdateMode) == 0x000001, "Wrong alignment on NiagaraComponent_SetAgeUpdateMode");
static_assert(sizeof(NiagaraComponent_SetAgeUpdateMode) == 0x000001, "Wrong size on NiagaraComponent_SetAgeUpdateMode");
static_assert(offsetof(NiagaraComponent_SetAgeUpdateMode, InAgeUpdateMode) == 0x000000, "Member 'NiagaraComponent_SetAgeUpdateMode::InAgeUpdateMode' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAllowScalability
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAllowScalability final
{
public:
	bool                                          bAllow;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAllowScalability) == 0x000001, "Wrong alignment on NiagaraComponent_SetAllowScalability");
static_assert(sizeof(NiagaraComponent_SetAllowScalability) == 0x000001, "Wrong size on NiagaraComponent_SetAllowScalability");
static_assert(offsetof(NiagaraComponent_SetAllowScalability, bAllow) == 0x000000, "Member 'NiagaraComponent_SetAllowScalability::bAllow' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAsset
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetAsset final
{
public:
	class UNiagaraSystem*                         InAsset;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bResetExistingOverrideParameters;                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetAsset) == 0x000008, "Wrong alignment on NiagaraComponent_SetAsset");
static_assert(sizeof(NiagaraComponent_SetAsset) == 0x000010, "Wrong size on NiagaraComponent_SetAsset");
static_assert(offsetof(NiagaraComponent_SetAsset, InAsset) == 0x000000, "Member 'NiagaraComponent_SetAsset::InAsset' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetAsset, bResetExistingOverrideParameters) == 0x000008, "Member 'NiagaraComponent_SetAsset::bResetExistingOverrideParameters' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetAutoDestroy
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetAutoDestroy final
{
public:
	bool                                          bInAutoDestroy;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetAutoDestroy) == 0x000001, "Wrong alignment on NiagaraComponent_SetAutoDestroy");
static_assert(sizeof(NiagaraComponent_SetAutoDestroy) == 0x000001, "Wrong size on NiagaraComponent_SetAutoDestroy");
static_assert(offsetof(NiagaraComponent_SetAutoDestroy, bInAutoDestroy) == 0x000000, "Member 'NiagaraComponent_SetAutoDestroy::bInAutoDestroy' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetCanRenderWhileSeeking
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetCanRenderWhileSeeking final
{
public:
	bool                                          bInCanRenderWhileSeeking;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetCanRenderWhileSeeking) == 0x000001, "Wrong alignment on NiagaraComponent_SetCanRenderWhileSeeking");
static_assert(sizeof(NiagaraComponent_SetCanRenderWhileSeeking) == 0x000001, "Wrong size on NiagaraComponent_SetCanRenderWhileSeeking");
static_assert(offsetof(NiagaraComponent_SetCanRenderWhileSeeking, bInCanRenderWhileSeeking) == 0x000000, "Member 'NiagaraComponent_SetCanRenderWhileSeeking::bInCanRenderWhileSeeking' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetCustomTimeDilation
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetCustomTimeDilation final
{
public:
	float                                         Dilation;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetCustomTimeDilation) == 0x000004, "Wrong alignment on NiagaraComponent_SetCustomTimeDilation");
static_assert(sizeof(NiagaraComponent_SetCustomTimeDilation) == 0x000004, "Wrong size on NiagaraComponent_SetCustomTimeDilation");
static_assert(offsetof(NiagaraComponent_SetCustomTimeDilation, Dilation) == 0x000000, "Member 'NiagaraComponent_SetCustomTimeDilation::Dilation' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetDesiredAge
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetDesiredAge final
{
public:
	float                                         InDesiredAge;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetDesiredAge) == 0x000004, "Wrong alignment on NiagaraComponent_SetDesiredAge");
static_assert(sizeof(NiagaraComponent_SetDesiredAge) == 0x000004, "Wrong size on NiagaraComponent_SetDesiredAge");
static_assert(offsetof(NiagaraComponent_SetDesiredAge, InDesiredAge) == 0x000000, "Member 'NiagaraComponent_SetDesiredAge::InDesiredAge' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetEmitterFixedBounds
// 0x0040 (0x0040 - 0x0000)
struct NiagaraComponent_SetEmitterFixedBounds final
{
public:
	class FName                                   EmitterName;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   LocalBounds;                                       // 0x0008(0x0038)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetEmitterFixedBounds) == 0x000008, "Wrong alignment on NiagaraComponent_SetEmitterFixedBounds");
static_assert(sizeof(NiagaraComponent_SetEmitterFixedBounds) == 0x000040, "Wrong size on NiagaraComponent_SetEmitterFixedBounds");
static_assert(offsetof(NiagaraComponent_SetEmitterFixedBounds, EmitterName) == 0x000000, "Member 'NiagaraComponent_SetEmitterFixedBounds::EmitterName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetEmitterFixedBounds, LocalBounds) == 0x000008, "Member 'NiagaraComponent_SetEmitterFixedBounds::LocalBounds' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetForceLocalPlayerEffect
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetForceLocalPlayerEffect final
{
public:
	bool                                          bIsPlayerEffect;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetForceLocalPlayerEffect) == 0x000001, "Wrong alignment on NiagaraComponent_SetForceLocalPlayerEffect");
static_assert(sizeof(NiagaraComponent_SetForceLocalPlayerEffect) == 0x000001, "Wrong size on NiagaraComponent_SetForceLocalPlayerEffect");
static_assert(offsetof(NiagaraComponent_SetForceLocalPlayerEffect, bIsPlayerEffect) == 0x000000, "Member 'NiagaraComponent_SetForceLocalPlayerEffect::bIsPlayerEffect' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetForceSolo
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetForceSolo final
{
public:
	bool                                          bInForceSolo;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetForceSolo) == 0x000001, "Wrong alignment on NiagaraComponent_SetForceSolo");
static_assert(sizeof(NiagaraComponent_SetForceSolo) == 0x000001, "Wrong size on NiagaraComponent_SetForceSolo");
static_assert(offsetof(NiagaraComponent_SetForceSolo, bInForceSolo) == 0x000000, "Member 'NiagaraComponent_SetForceSolo::bInForceSolo' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetGpuComputeDebug
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetGpuComputeDebug final
{
public:
	bool                                          bEnableDebug;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetGpuComputeDebug) == 0x000001, "Wrong alignment on NiagaraComponent_SetGpuComputeDebug");
static_assert(sizeof(NiagaraComponent_SetGpuComputeDebug) == 0x000001, "Wrong size on NiagaraComponent_SetGpuComputeDebug");
static_assert(offsetof(NiagaraComponent_SetGpuComputeDebug, bEnableDebug) == 0x000000, "Member 'NiagaraComponent_SetGpuComputeDebug::bEnableDebug' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetLockDesiredAgeDeltaTimeToSeekDelta
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta final
{
public:
	bool                                          bLock;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta) == 0x000001, "Wrong alignment on NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta");
static_assert(sizeof(NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta) == 0x000001, "Wrong size on NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta");
static_assert(offsetof(NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta, bLock) == 0x000000, "Member 'NiagaraComponent_SetLockDesiredAgeDeltaTimeToSeekDelta::bLock' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetMaxSimTime
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetMaxSimTime final
{
public:
	float                                         InMaxTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetMaxSimTime) == 0x000004, "Wrong alignment on NiagaraComponent_SetMaxSimTime");
static_assert(sizeof(NiagaraComponent_SetMaxSimTime) == 0x000004, "Wrong size on NiagaraComponent_SetMaxSimTime");
static_assert(offsetof(NiagaraComponent_SetMaxSimTime, InMaxTime) == 0x000000, "Member 'NiagaraComponent_SetMaxSimTime::InMaxTime' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableActor
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableActor final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableActor) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableActor");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableActor) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableActor");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableActor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableActor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableActor, Actor) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableActor::Actor' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableBool
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableBool final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableBool) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableBool");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableBool) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableBool");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableBool, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableBool::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableBool, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableBool::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableFloat
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableFloat final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableFloat) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableFloat");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableFloat) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableFloat");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableFloat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableFloat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableFloat, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableFloat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableInt
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableInt final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableInt) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableInt");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableInt) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableInt");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableInt, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableInt::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableInt, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableInt::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableLinearColor
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableLinearColor final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InValue;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableLinearColor) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableLinearColor");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableLinearColor) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableLinearColor");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableLinearColor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableLinearColor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableLinearColor, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableLinearColor::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableObject
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableObject final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableObject) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableObject");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableObject) == 0x000018, "Wrong size on NiagaraComponent_SetNiagaraVariableObject");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableObject, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableObject::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableObject, Object) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableObject::Object' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariablePosition
// 0x0028 (0x0028 - 0x0000)
struct NiagaraComponent_SetNiagaraVariablePosition final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariablePosition) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariablePosition");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariablePosition) == 0x000028, "Wrong size on NiagaraComponent_SetNiagaraVariablePosition");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariablePosition, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariablePosition::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariablePosition, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariablePosition::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableQuat
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableQuat final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuat                                  InValue;                                           // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableQuat) == 0x000010, "Wrong alignment on NiagaraComponent_SetNiagaraVariableQuat");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableQuat) == 0x000030, "Wrong size on NiagaraComponent_SetNiagaraVariableQuat");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableQuat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableQuat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableQuat, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableQuat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec2
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec2 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InValue;                                           // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec2) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec2");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec2) == 0x000020, "Wrong size on NiagaraComponent_SetNiagaraVariableVec2");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec2, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec2::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec2, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec2::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec3
// 0x0028 (0x0028 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec3 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0010(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec3) == 0x000008, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec3");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec3) == 0x000028, "Wrong size on NiagaraComponent_SetNiagaraVariableVec3");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec3, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec3::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec3, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec3::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetNiagaraVariableVec4
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_SetNiagaraVariableVec4 final
{
public:
	class FString                                 InVariableName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               InValue;                                           // 0x0010(0x0020)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetNiagaraVariableVec4) == 0x000010, "Wrong alignment on NiagaraComponent_SetNiagaraVariableVec4");
static_assert(sizeof(NiagaraComponent_SetNiagaraVariableVec4) == 0x000030, "Wrong size on NiagaraComponent_SetNiagaraVariableVec4");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec4, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetNiagaraVariableVec4::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetNiagaraVariableVec4, InValue) == 0x000010, "Member 'NiagaraComponent_SetNiagaraVariableVec4::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetPaused
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetPaused final
{
public:
	bool                                          bInPaused;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetPaused) == 0x000001, "Wrong alignment on NiagaraComponent_SetPaused");
static_assert(sizeof(NiagaraComponent_SetPaused) == 0x000001, "Wrong size on NiagaraComponent_SetPaused");
static_assert(offsetof(NiagaraComponent_SetPaused, bInPaused) == 0x000000, "Member 'NiagaraComponent_SetPaused::bInPaused' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetPreviewLODDistance
// 0x000C (0x000C - 0x0000)
struct NiagaraComponent_SetPreviewLODDistance final
{
public:
	bool                                          bEnablePreviewLODDistance;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreviewLODDistance;                                // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PreviewMaxDistance;                                // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetPreviewLODDistance) == 0x000004, "Wrong alignment on NiagaraComponent_SetPreviewLODDistance");
static_assert(sizeof(NiagaraComponent_SetPreviewLODDistance) == 0x00000C, "Wrong size on NiagaraComponent_SetPreviewLODDistance");
static_assert(offsetof(NiagaraComponent_SetPreviewLODDistance, bEnablePreviewLODDistance) == 0x000000, "Member 'NiagaraComponent_SetPreviewLODDistance::bEnablePreviewLODDistance' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetPreviewLODDistance, PreviewLODDistance) == 0x000004, "Member 'NiagaraComponent_SetPreviewLODDistance::PreviewLODDistance' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetPreviewLODDistance, PreviewMaxDistance) == 0x000008, "Member 'NiagaraComponent_SetPreviewLODDistance::PreviewMaxDistance' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetRandomSeedOffset
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetRandomSeedOffset final
{
public:
	int32                                         NewRandomSeedOffset;                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetRandomSeedOffset) == 0x000004, "Wrong alignment on NiagaraComponent_SetRandomSeedOffset");
static_assert(sizeof(NiagaraComponent_SetRandomSeedOffset) == 0x000004, "Wrong size on NiagaraComponent_SetRandomSeedOffset");
static_assert(offsetof(NiagaraComponent_SetRandomSeedOffset, NewRandomSeedOffset) == 0x000000, "Member 'NiagaraComponent_SetRandomSeedOffset::NewRandomSeedOffset' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetRenderingEnabled
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetRenderingEnabled final
{
public:
	bool                                          bInRenderingEnabled;                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetRenderingEnabled) == 0x000001, "Wrong alignment on NiagaraComponent_SetRenderingEnabled");
static_assert(sizeof(NiagaraComponent_SetRenderingEnabled) == 0x000001, "Wrong size on NiagaraComponent_SetRenderingEnabled");
static_assert(offsetof(NiagaraComponent_SetRenderingEnabled, bInRenderingEnabled) == 0x000000, "Member 'NiagaraComponent_SetRenderingEnabled::bInRenderingEnabled' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetSeekDelta
// 0x0004 (0x0004 - 0x0000)
struct NiagaraComponent_SetSeekDelta final
{
public:
	float                                         InSeekDelta;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetSeekDelta) == 0x000004, "Wrong alignment on NiagaraComponent_SetSeekDelta");
static_assert(sizeof(NiagaraComponent_SetSeekDelta) == 0x000004, "Wrong size on NiagaraComponent_SetSeekDelta");
static_assert(offsetof(NiagaraComponent_SetSeekDelta, InSeekDelta) == 0x000000, "Member 'NiagaraComponent_SetSeekDelta::InSeekDelta' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetSystemFixedBounds
// 0x0038 (0x0038 - 0x0000)
struct NiagaraComponent_SetSystemFixedBounds final
{
public:
	struct FBox                                   LocalBounds;                                       // 0x0000(0x0038)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetSystemFixedBounds) == 0x000008, "Wrong alignment on NiagaraComponent_SetSystemFixedBounds");
static_assert(sizeof(NiagaraComponent_SetSystemFixedBounds) == 0x000038, "Wrong size on NiagaraComponent_SetSystemFixedBounds");
static_assert(offsetof(NiagaraComponent_SetSystemFixedBounds, LocalBounds) == 0x000000, "Member 'NiagaraComponent_SetSystemFixedBounds::LocalBounds' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetTickBehavior
// 0x0001 (0x0001 - 0x0000)
struct NiagaraComponent_SetTickBehavior final
{
public:
	ENiagaraTickBehavior                          NewTickBehavior;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetTickBehavior) == 0x000001, "Wrong alignment on NiagaraComponent_SetTickBehavior");
static_assert(sizeof(NiagaraComponent_SetTickBehavior) == 0x000001, "Wrong size on NiagaraComponent_SetTickBehavior");
static_assert(offsetof(NiagaraComponent_SetTickBehavior, NewTickBehavior) == 0x000000, "Member 'NiagaraComponent_SetTickBehavior::NewTickBehavior' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableActor
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableActor final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Actor;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableActor) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableActor");
static_assert(sizeof(NiagaraComponent_SetVariableActor) == 0x000010, "Wrong size on NiagaraComponent_SetVariableActor");
static_assert(offsetof(NiagaraComponent_SetVariableActor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableActor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableActor, Actor) == 0x000008, "Member 'NiagaraComponent_SetVariableActor::Actor' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableBool
// 0x000C (0x000C - 0x0000)
struct NiagaraComponent_SetVariableBool final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InValue;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(NiagaraComponent_SetVariableBool) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableBool");
static_assert(sizeof(NiagaraComponent_SetVariableBool) == 0x00000C, "Wrong size on NiagaraComponent_SetVariableBool");
static_assert(offsetof(NiagaraComponent_SetVariableBool, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableBool::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableBool, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableBool::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableFloat
// 0x000C (0x000C - 0x0000)
struct NiagaraComponent_SetVariableFloat final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableFloat) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableFloat");
static_assert(sizeof(NiagaraComponent_SetVariableFloat) == 0x00000C, "Wrong size on NiagaraComponent_SetVariableFloat");
static_assert(offsetof(NiagaraComponent_SetVariableFloat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableFloat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableFloat, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableFloat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableInt
// 0x000C (0x000C - 0x0000)
struct NiagaraComponent_SetVariableInt final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InValue;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableInt) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableInt");
static_assert(sizeof(NiagaraComponent_SetVariableInt) == 0x00000C, "Wrong size on NiagaraComponent_SetVariableInt");
static_assert(offsetof(NiagaraComponent_SetVariableInt, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableInt::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableInt, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableInt::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableLinearColor
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetVariableLinearColor final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InValue;                                           // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableLinearColor) == 0x000004, "Wrong alignment on NiagaraComponent_SetVariableLinearColor");
static_assert(sizeof(NiagaraComponent_SetVariableLinearColor) == 0x000018, "Wrong size on NiagaraComponent_SetVariableLinearColor");
static_assert(offsetof(NiagaraComponent_SetVariableLinearColor, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableLinearColor::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableLinearColor, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableLinearColor::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableMaterial
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableMaterial final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     Object;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableMaterial) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableMaterial");
static_assert(sizeof(NiagaraComponent_SetVariableMaterial) == 0x000010, "Wrong size on NiagaraComponent_SetVariableMaterial");
static_assert(offsetof(NiagaraComponent_SetVariableMaterial, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableMaterial::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableMaterial, Object) == 0x000008, "Member 'NiagaraComponent_SetVariableMaterial::Object' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableObject
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableObject final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableObject) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableObject");
static_assert(sizeof(NiagaraComponent_SetVariableObject) == 0x000010, "Wrong size on NiagaraComponent_SetVariableObject");
static_assert(offsetof(NiagaraComponent_SetVariableObject, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableObject::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableObject, Object) == 0x000008, "Member 'NiagaraComponent_SetVariableObject::Object' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariablePosition
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetVariablePosition final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariablePosition) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariablePosition");
static_assert(sizeof(NiagaraComponent_SetVariablePosition) == 0x000020, "Wrong size on NiagaraComponent_SetVariablePosition");
static_assert(offsetof(NiagaraComponent_SetVariablePosition, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariablePosition::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariablePosition, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariablePosition::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableQuat
// 0x0030 (0x0030 - 0x0000)
struct NiagaraComponent_SetVariableQuat final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  InValue;                                           // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableQuat) == 0x000010, "Wrong alignment on NiagaraComponent_SetVariableQuat");
static_assert(sizeof(NiagaraComponent_SetVariableQuat) == 0x000030, "Wrong size on NiagaraComponent_SetVariableQuat");
static_assert(offsetof(NiagaraComponent_SetVariableQuat, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableQuat::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableQuat, InValue) == 0x000010, "Member 'NiagaraComponent_SetVariableQuat::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableStaticMesh
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableStaticMesh final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            InValue;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableStaticMesh) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableStaticMesh");
static_assert(sizeof(NiagaraComponent_SetVariableStaticMesh) == 0x000010, "Wrong size on NiagaraComponent_SetVariableStaticMesh");
static_assert(offsetof(NiagaraComponent_SetVariableStaticMesh, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableStaticMesh::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableStaticMesh, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableStaticMesh::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableTexture
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableTexture final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                               Texture;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableTexture) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableTexture");
static_assert(sizeof(NiagaraComponent_SetVariableTexture) == 0x000010, "Wrong size on NiagaraComponent_SetVariableTexture");
static_assert(offsetof(NiagaraComponent_SetVariableTexture, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableTexture::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableTexture, Texture) == 0x000008, "Member 'NiagaraComponent_SetVariableTexture::Texture' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableTextureRenderTarget
// 0x0010 (0x0010 - 0x0000)
struct NiagaraComponent_SetVariableTextureRenderTarget final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget*                   TextureRenderTarget;                               // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableTextureRenderTarget) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableTextureRenderTarget");
static_assert(sizeof(NiagaraComponent_SetVariableTextureRenderTarget) == 0x000010, "Wrong size on NiagaraComponent_SetVariableTextureRenderTarget");
static_assert(offsetof(NiagaraComponent_SetVariableTextureRenderTarget, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableTextureRenderTarget::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableTextureRenderTarget, TextureRenderTarget) == 0x000008, "Member 'NiagaraComponent_SetVariableTextureRenderTarget::TextureRenderTarget' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableVec2
// 0x0018 (0x0018 - 0x0000)
struct NiagaraComponent_SetVariableVec2 final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InValue;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableVec2) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableVec2");
static_assert(sizeof(NiagaraComponent_SetVariableVec2) == 0x000018, "Wrong size on NiagaraComponent_SetVariableVec2");
static_assert(offsetof(NiagaraComponent_SetVariableVec2, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableVec2::InVariableName' has a wrong offset!");
static_assert(offsetof(NiagaraComponent_SetVariableVec2, InValue) == 0x000008, "Member 'NiagaraComponent_SetVariableVec2::InValue' has a wrong offset!");

// Function Niagara.NiagaraComponent.SetVariableVec3
// 0x0020 (0x0020 - 0x0000)
struct NiagaraComponent_SetVariableVec3 final
{
public:
	class FName                                   InVariableName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InValue;                                           // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(NiagaraComponent_SetVariableVec3) == 0x000008, "Wrong alignment on NiagaraComponent_SetVariableVec3");
static_assert(sizeof(NiagaraComponent_SetVariableVec3) == 0x000020, "Wrong size on NiagaraComponent_SetVariableVec3");
static_assert(offsetof(NiagaraComponent_SetVariableVec3, InVariableName) == 0x000000, "Member 'NiagaraComponent_SetVariableVec3::InVariableName' has a wrong offset!");
