#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_structs.hpp"
#include "NiagaraCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "NiagaraShader_structs.hpp"


namespace SDK
{

// Enum Niagara.ENiagaraSystemSpawnSectionStartBehavior
// NumValues: 0x0002
enum class ENiagaraSystemSpawnSectionStartBehavior : uint32
{
	Activate                                 = 0,
	ENiagaraSystemSpawnSectionStartBehavior_MAX = 1,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEvaluateBehavior
// NumValues: 0x0003
enum class ENiagaraSystemSpawnSectionEvaluateBehavior : uint32
{
	ActivateIfInactive                       = 0,
	None                                     = 1,
	ENiagaraSystemSpawnSectionEvaluateBehavior_MAX = 2,
};

// Enum Niagara.ENiagaraSystemSpawnSectionEndBehavior
// NumValues: 0x0004
enum class ENiagaraSystemSpawnSectionEndBehavior : uint32
{
	SetSystemInactive                        = 0,
	Deactivate                               = 1,
	None                                     = 2,
	ENiagaraSystemSpawnSectionEndBehavior_MAX = 3,
};

// Enum Niagara.ENiagaraBakerViewMode
// NumValues: 0x0009
enum class ENiagaraBakerViewMode : uint32
{
	Perspective                              = 0,
	OrthoFront                               = 1,
	OrthoBack                                = 2,
	OrthoLeft                                = 3,
	OrthoRight                               = 4,
	OrthoTop                                 = 5,
	OrthoBottom                              = 6,
	Num                                      = 7,
	ENiagaraBakerViewMode_MAX                = 8,
};

// Enum Niagara.ENiagaraCollisionMode
// NumValues: 0x0005
enum class ENiagaraCollisionMode : uint8
{
	None                                     = 0,
	SceneGeometry                            = 1,
	DepthBuffer                              = 2,
	DistanceField                            = 3,
	ENiagaraCollisionMode_MAX                = 4,
};

// Enum Niagara.ENiagaraTickBehavior
// NumValues: 0x0005
enum class ENiagaraTickBehavior : uint8
{
	UsePrereqs                               = 0,
	UseComponentTickGroup                    = 1,
	ForceTickFirst                           = 2,
	ForceTickLast                            = 3,
	ENiagaraTickBehavior_MAX                 = 4,
};

// Enum Niagara.ENiagaraGpuBufferFormat
// NumValues: 0x0004
enum class ENiagaraGpuBufferFormat : uint8
{
	Float                                    = 0,
	HalfFloat                                = 1,
	UnsignedNormalizedByte                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraGpuSyncMode
// NumValues: 0x0005
enum class ENiagaraGpuSyncMode : uint32
{
	None                                     = 0,
	SyncCpuToGpu                             = 1,
	SyncGpuToCpu                             = 2,
	SyncBoth                                 = 3,
	ENiagaraGpuSyncMode_MAX                  = 4,
};

// Enum Niagara.ENiagaraMipMapGeneration
// NumValues: 0x0004
enum class ENiagaraMipMapGeneration : uint8
{
	Disabled                                 = 0,
	PostStage                                = 1,
	PostSimulate                             = 2,
	ENiagaraMipMapGeneration_MAX             = 3,
};

// Enum Niagara.ENiagaraDefaultMode
// NumValues: 0x0005
enum class ENiagaraDefaultMode : uint8
{
	Value                                    = 0,
	Binding                                  = 1,
	Custom                                   = 2,
	FailIfPreviouslyNotSet                   = 3,
	ENiagaraDefaultMode_MAX                  = 4,
};

// Enum Niagara.ENiagaraDefaultRendererMotionVectorSetting
// NumValues: 0x0003
enum class ENiagaraDefaultRendererMotionVectorSetting : uint32
{
	Precise                                  = 0,
	Approximate                              = 1,
	ENiagaraDefaultRendererMotionVectorSetting_MAX = 2,
};

// Enum Niagara.ENiagaraRendererMotionVectorSetting
// NumValues: 0x0005
enum class ENiagaraRendererMotionVectorSetting : uint32
{
	AutoDetect                               = 0,
	Precise                                  = 1,
	Approximate                              = 2,
	Disable                                  = 3,
	ENiagaraRendererMotionVectorSetting_MAX  = 4,
};

// Enum Niagara.ENiagaraSimTarget
// NumValues: 0x0003
enum class ENiagaraSimTarget : uint8
{
	CPUSim                                   = 0,
	GPUComputeSim                            = 1,
	ENiagaraSimTarget_MAX                    = 2,
};

// Enum Niagara.ENiagaraAgeUpdateMode
// NumValues: 0x0004
enum class ENiagaraAgeUpdateMode : uint8
{
	TickDeltaTime                            = 0,
	DesiredAge                               = 1,
	DesiredAgeNoSeek                         = 2,
	ENiagaraAgeUpdateMode_MAX                = 3,
};

// Enum Niagara.ENiagaraStatEvaluationType
// NumValues: 0x0003
enum class ENiagaraStatEvaluationType : uint8
{
	Average                                  = 0,
	Maximum                                  = 1,
	ENiagaraStatEvaluationType_MAX           = 2,
};

// Enum Niagara.ENiagaraStatDisplayMode
// NumValues: 0x0003
enum class ENiagaraStatDisplayMode : uint8
{
	Percent                                  = 0,
	Absolute                                 = 1,
	ENiagaraStatDisplayMode_MAX              = 2,
};

// Enum Niagara.ENiagaraDataSetType
// NumValues: 0x0004
enum class ENiagaraDataSetType : uint8
{
	ParticleData                             = 0,
	Shared                                   = 1,
	Event                                    = 2,
	ENiagaraDataSetType_MAX                  = 3,
};

// Enum Niagara.ENiagaraInputNodeUsage
// NumValues: 0x0007
enum class ENiagaraInputNodeUsage : uint8
{
	Undefined                                = 0,
	Parameter                                = 1,
	Attribute                                = 2,
	SystemConstant                           = 3,
	TranslatorConstant                       = 4,
	RapidIterationParameter                  = 5,
	ENiagaraInputNodeUsage_MAX               = 6,
};

// Enum Niagara.ENiagaraScriptCompileStatus
// NumValues: 0x0008
enum class ENiagaraScriptCompileStatus : uint8
{
	NCS_Unknown                              = 0,
	NCS_Dirty                                = 1,
	NCS_Error                                = 2,
	NCS_UpToDate                             = 3,
	NCS_BeingCreated                         = 4,
	NCS_UpToDateWithWarnings                 = 5,
	NCS_ComputeUpToDateWithWarnings          = 6,
	NCS_MAX                                  = 7,
};

// Enum Niagara.ENiagaraScriptUsage
// NumValues: 0x000E
enum class ENiagaraScriptUsage : uint8
{
	Function                                 = 0,
	Module                                   = 1,
	DynamicInput                             = 2,
	ParticleSpawnScript                      = 3,
	ParticleSpawnScriptInterpolated          = 4,
	ParticleUpdateScript                     = 5,
	ParticleEventScript                      = 6,
	ParticleSimulationStageScript            = 7,
	ParticleGPUComputeScript                 = 8,
	EmitterSpawnScript                       = 9,
	EmitterUpdateScript                      = 10,
	SystemSpawnScript                        = 11,
	SystemUpdateScript                       = 12,
	ENiagaraScriptUsage_MAX                  = 13,
};

// Enum Niagara.ENiagaraCompileUsageStaticSwitch
// NumValues: 0x0006
enum class ENiagaraCompileUsageStaticSwitch : uint8
{
	Spawn                                    = 0,
	Update                                   = 1,
	Event                                    = 2,
	SimulationStage                          = 3,
	Default                                  = 4,
	ENiagaraCompileUsageStaticSwitch_MAX     = 5,
};

// Enum Niagara.ENiagaraScriptContextStaticSwitch
// NumValues: 0x0004
enum class ENiagaraScriptContextStaticSwitch : uint8
{
	System                                   = 0,
	Emitter                                  = 1,
	Particle                                 = 2,
	ENiagaraScriptContextStaticSwitch_MAX    = 3,
};

// Enum Niagara.ENiagaraScriptGroup
// NumValues: 0x0004
enum class ENiagaraScriptGroup : uint8
{
	Particle                                 = 0,
	Emitter                                  = 1,
	System                                   = 2,
	Max                                      = 3,
};

// Enum Niagara.ENiagaraIterationSource
// NumValues: 0x0003
enum class ENiagaraIterationSource : uint8
{
	Particles                                = 0,
	DataInterface                            = 1,
	ENiagaraIterationSource_MAX              = 2,
};

// Enum Niagara.ENiagaraBindingSource
// NumValues: 0x0007
enum class ENiagaraBindingSource : uint8
{
	ImplicitFromSource                       = 0,
	ExplicitParticles                        = 1,
	ExplicitEmitter                          = 2,
	ExplicitSystem                           = 3,
	ExplicitUser                             = 4,
	MaxBindingSource                         = 5,
	ENiagaraBindingSource_MAX                = 6,
};

// Enum Niagara.ENiagaraRendererSourceDataMode
// NumValues: 0x0003
enum class ENiagaraRendererSourceDataMode : uint8
{
	Particles                                = 0,
	Emitter                                  = 1,
	ENiagaraRendererSourceDataMode_MAX       = 2,
};

// Enum Niagara.ENiagaraLegacyTrailWidthMode
// NumValues: 0x0004
enum class ENiagaraLegacyTrailWidthMode : uint8
{
	FromCentre                               = 0,
	FromFirst                                = 1,
	FromSecond                               = 2,
	ENiagaraLegacyTrailWidthMode_MAX         = 3,
};

// Enum Niagara.ENCPoolMethod
// NumValues: 0x0006
enum class ENCPoolMethod : uint8
{
	None                                     = 0,
	AutoRelease                              = 1,
	ManualRelease                            = 2,
	ManualRelease_OnComplete                 = 3,
	FreeInPool                               = 4,
	ENCPoolMethod_MAX                        = 5,
};

// Enum Niagara.ENiagaraSystemInstanceState
// NumValues: 0x0008
enum class ENiagaraSystemInstanceState : uint8
{
	None                                     = 0,
	PendingSpawn                             = 1,
	PendingSpawnPaused                       = 2,
	Spawning                                 = 3,
	Running                                  = 4,
	Paused                                   = 5,
	Num                                      = 6,
	ENiagaraSystemInstanceState_MAX          = 7,
};

// Enum Niagara.ENiagaraFunctionDebugState
// NumValues: 0x0003
enum class ENiagaraFunctionDebugState : uint8
{
	NoDebug                                  = 0,
	Basic                                    = 1,
	ENiagaraFunctionDebugState_MAX           = 2,
};

// Enum Niagara.ENiagaraDataInterfaceEmitterBindingMode
// NumValues: 0x0003
enum class ENiagaraDataInterfaceEmitterBindingMode : uint32
{
	Self                                     = 0,
	Other                                    = 1,
	ENiagaraDataInterfaceEmitterBindingMode_MAX = 2,
};

// Enum Niagara.ENDIExport_GPUAllocationMode
// NumValues: 0x0003
enum class ENDIExport_GPUAllocationMode : uint8
{
	FixedSize                                = 0,
	PerParticle                              = 1,
	ENDIExport_MAX                           = 2,
};

// Enum Niagara.ENDILandscape_SourceMode
// NumValues: 0x0004
enum class ENDILandscape_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDILandscape_MAX                        = 3,
};

// Enum Niagara.ESetResolutionMethod
// NumValues: 0x0004
enum class ESetResolutionMethod : uint32
{
	Independent                              = 0,
	MaxAxis                                  = 1,
	CellSize                                 = 2,
	ESetResolutionMethod_MAX                 = 3,
};

// Enum Niagara.ENDISkeletalMesh_SourceMode
// NumValues: 0x0004
enum class ENDISkeletalMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	ENDISkeletalMesh_MAX                     = 3,
};

// Enum Niagara.ENDISkeletalMesh_SkinningMode
// NumValues: 0x0005
enum class ENDISkeletalMesh_SkinningMode : uint8
{
	Invalid                                  = 255,
	None                                     = 0,
	SkinOnTheFly                             = 1,
	PreSkin                                  = 2,
	ENDISkeletalMesh_MAX                     = 256,
};

// Enum Niagara.ENDIStaticMesh_SourceMode
// NumValues: 0x0005
enum class ENDIStaticMesh_SourceMode : uint8
{
	Default                                  = 0,
	Source                                   = 1,
	AttachParent                             = 2,
	DefaultMeshOnly                          = 3,
	ENDIStaticMesh_MAX                       = 4,
};

// Enum Niagara.ENiagaraDebugPlaybackMode
// NumValues: 0x0005
enum class ENiagaraDebugPlaybackMode : uint8
{
	Play                                     = 0,
	Loop                                     = 1,
	Paused                                   = 2,
	Step                                     = 3,
	ENiagaraDebugPlaybackMode_MAX            = 4,
};

// Enum Niagara.ENiagaraDebugHudHAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudHAlign : uint8
{
	Left                                     = 0,
	Center                                   = 1,
	Right                                    = 2,
	ENiagaraDebugHudHAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudVAlign
// NumValues: 0x0004
enum class ENiagaraDebugHudVAlign : uint8
{
	Top                                      = 0,
	Center                                   = 1,
	Bottom                                   = 2,
	ENiagaraDebugHudVAlign_MAX               = 3,
};

// Enum Niagara.ENiagaraDebugHudFont
// NumValues: 0x0003
enum class ENiagaraDebugHudFont : uint32
{
	Small                                    = 0,
	Normal                                   = 1,
	ENiagaraDebugHudFont_MAX                 = 2,
};

// Enum Niagara.ENiagaraDebugHudVerbosity
// NumValues: 0x0004
enum class ENiagaraDebugHudVerbosity : uint32
{
	None                                     = 0,
	Basic                                    = 1,
	Verbose                                  = 2,
	ENiagaraDebugHudVerbosity_MAX            = 3,
};

// Enum Niagara.ENiagaraDebugHUDOverviewMode
// NumValues: 0x0005
enum class ENiagaraDebugHUDOverviewMode : uint32
{
	Overview                                 = 0,
	Scalability                              = 1,
	Performance                              = 2,
	GpuComputePerformance                    = 3,
	ENiagaraDebugHUDOverviewMode_MAX         = 4,
};

// Enum Niagara.ENiagaraDebugHUDPerfGraphMode
// NumValues: 0x0005
enum class ENiagaraDebugHUDPerfGraphMode : uint32
{
	None                                     = 0,
	GameThread                               = 1,
	RenderThread                             = 2,
	GPU                                      = 3,
	ENiagaraDebugHUDPerfGraphMode_MAX        = 4,
};

// Enum Niagara.ENiagaraDebugHUDPerfSampleMode
// NumValues: 0x0003
enum class ENiagaraDebugHUDPerfSampleMode : uint32
{
	FrameTotal                               = 0,
	PerInstanceAverage                       = 1,
	ENiagaraDebugHUDPerfSampleMode_MAX       = 2,
};

// Enum Niagara.ENiagaraCullReaction
// NumValues: 0x0005
enum class ENiagaraCullReaction : uint32
{
	Deactivate                               = 0,
	DeactivateImmediate                      = 1,
	DeactivateResume                         = 2,
	DeactivateImmediateResume                = 3,
	ENiagaraCullReaction_MAX                 = 4,
};

// Enum Niagara.ENiagaraScalabilityUpdateFrequency
// NumValues: 0x0006
enum class ENiagaraScalabilityUpdateFrequency : uint32
{
	SpawnOnly                                = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	Continuous                               = 4,
	ENiagaraScalabilityUpdateFrequency_MAX   = 5,
};

// Enum Niagara.ENiagaraCullProxyMode
// NumValues: 0x0003
enum class ENiagaraCullProxyMode : uint32
{
	None                                     = 0,
	Instanced_Rendered                       = 1,
	ENiagaraCullProxyMode_MAX                = 2,
};

// Enum Niagara.EScriptExecutionMode
// NumValues: 0x0004
enum class EScriptExecutionMode : uint8
{
	EveryParticle                            = 0,
	SpawnedParticles                         = 1,
	SingleParticle                           = 2,
	EScriptExecutionMode_MAX                 = 3,
};

// Enum Niagara.EParticleAllocationMode
// NumValues: 0x0004
enum class EParticleAllocationMode : uint8
{
	AutomaticEstimate                        = 0,
	ManualEstimate                           = 1,
	FixedCount                               = 2,
	EParticleAllocationMode_MAX              = 3,
};

// Enum Niagara.ENiagaraSortMode
// NumValues: 0x0006
enum class ENiagaraSortMode : uint8
{
	None                                     = 0,
	ViewDepth                                = 1,
	ViewDistance                             = 2,
	CustomAscending                          = 3,
	CustomDecending                          = 4,
	ENiagaraSortMode_MAX                     = 5,
};

// Enum Niagara.ENiagaraMeshFacingMode
// NumValues: 0x0005
enum class ENiagaraMeshFacingMode : uint8
{
	Default                                  = 0,
	Velocity                                 = 1,
	CameraPosition                           = 2,
	CameraPlane                              = 3,
	ENiagaraMeshFacingMode_MAX               = 4,
};

// Enum Niagara.ENiagaraMeshPivotOffsetSpace
// NumValues: 0x0005
enum class ENiagaraMeshPivotOffsetSpace : uint8
{
	Mesh                                     = 0,
	Simulation                               = 1,
	World                                    = 2,
	Local                                    = 3,
	ENiagaraMeshPivotOffsetSpace_MAX         = 4,
};

// Enum Niagara.ENiagaraMeshLockedAxisSpace
// NumValues: 0x0004
enum class ENiagaraMeshLockedAxisSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraMeshLockedAxisSpace_MAX          = 3,
};

// Enum Niagara.ENiagaraPlatformSelectionState
// NumValues: 0x0004
enum class ENiagaraPlatformSelectionState : uint8
{
	Default                                  = 0,
	Enabled                                  = 1,
	Disabled                                 = 2,
	ENiagaraPlatformSelectionState_MAX       = 3,
};

// Enum Niagara.ENiagaraPlatformSetState
// NumValues: 0x0005
enum class ENiagaraPlatformSetState : uint8
{
	Disabled                                 = 0,
	Enabled                                  = 1,
	Active                                   = 2,
	Unknown                                  = 3,
	ENiagaraPlatformSetState_MAX             = 4,
};

// Enum Niagara.ENiagaraCVarConditionResponse
// NumValues: 0x0004
enum class ENiagaraCVarConditionResponse : uint8
{
	None                                     = 0,
	Enable                                   = 1,
	Disable                                  = 2,
	ENiagaraCVarConditionResponse_MAX        = 3,
};

// Enum Niagara.ENiagaraDeviceProfileRedirectMode
// NumValues: 0x0003
enum class ENiagaraDeviceProfileRedirectMode : uint8
{
	CVar                                     = 0,
	DeviceProfile                            = 1,
	ENiagaraDeviceProfileRedirectMode_MAX    = 2,
};

// Enum Niagara.ENiagaraPreviewGridResetMode
// NumValues: 0x0004
enum class ENiagaraPreviewGridResetMode : uint8
{
	Never                                    = 0,
	Individual                               = 1,
	All                                      = 2,
	ENiagaraPreviewGridResetMode_MAX         = 3,
};

// Enum Niagara.ENiagaraRibbonFacingMode
// NumValues: 0x0004
enum class ENiagaraRibbonFacingMode : uint8
{
	Screen                                   = 0,
	Custom                                   = 1,
	CustomSideVector                         = 2,
	ENiagaraRibbonFacingMode_MAX             = 3,
};

// Enum Niagara.ENiagaraRibbonAgeOffsetMode
// NumValues: 0x0003
enum class ENiagaraRibbonAgeOffsetMode : uint8
{
	Scale                                    = 0,
	Clip                                     = 1,
	ENiagaraRibbonAgeOffsetMode_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonDrawDirection
// NumValues: 0x0003
enum class ENiagaraRibbonDrawDirection : uint8
{
	FrontToBack                              = 0,
	BackToFront                              = 1,
	ENiagaraRibbonDrawDirection_MAX          = 2,
};

// Enum Niagara.ENiagaraRibbonShapeMode
// NumValues: 0x0005
enum class ENiagaraRibbonShapeMode : uint8
{
	Plane                                    = 0,
	MultiPlane                               = 1,
	Tube                                     = 2,
	Custom                                   = 3,
	ENiagaraRibbonShapeMode_MAX              = 4,
};

// Enum Niagara.ENiagaraRibbonTessellationMode
// NumValues: 0x0004
enum class ENiagaraRibbonTessellationMode : uint8
{
	Automatic                                = 0,
	Custom                                   = 1,
	Disabled                                 = 2,
	ENiagaraRibbonTessellationMode_MAX       = 3,
};

// Enum Niagara.ENiagaraRibbonUVEdgeMode
// NumValues: 0x0003
enum class ENiagaraRibbonUVEdgeMode : uint32
{
	SmoothTransition                         = 0,
	Locked                                   = 1,
	ENiagaraRibbonUVEdgeMode_MAX             = 2,
};

// Enum Niagara.ENiagaraRibbonUVDistributionMode
// NumValues: 0x0005
enum class ENiagaraRibbonUVDistributionMode : uint32
{
	ScaledUniformly                          = 0,
	ScaledUsingRibbonSegmentLength           = 1,
	TiledOverRibbonLength                    = 2,
	TiledFromStartOverRibbonLength           = 3,
	ENiagaraRibbonUVDistributionMode_MAX     = 4,
};

// Enum Niagara.ENiagaraReorientedRibbonsDirectLightingMode
// NumValues: 0x0004
enum class ENiagaraReorientedRibbonsDirectLightingMode : uint8
{
	Off                                      = 0,
	On                                       = 1,
	Inline                                   = 2,
	ENiagaraReorientedRibbonsDirectLightingMode_MAX = 3,
};

// Enum Niagara.EUnusedAttributeBehaviour
// NumValues: 0x0006
enum class EUnusedAttributeBehaviour : uint8
{
	Copy                                     = 0,
	Zero                                     = 1,
	None                                     = 2,
	MarkInvalid                              = 3,
	PassThrough                              = 4,
	EUnusedAttributeBehaviour_MAX            = 5,
};

// Enum Niagara.ENiagaraModuleDependencyType
// NumValues: 0x0003
enum class ENiagaraModuleDependencyType : uint8
{
	PreDependency                            = 0,
	PostDependency                           = 1,
	ENiagaraModuleDependencyType_MAX         = 2,
};

// Enum Niagara.ENiagaraModuleDependencyScriptConstraint
// NumValues: 0x0003
enum class ENiagaraModuleDependencyScriptConstraint : uint8
{
	SameScript                               = 0,
	AllScripts                               = 1,
	ENiagaraModuleDependencyScriptConstraint_MAX = 2,
};

// Enum Niagara.ENiagaraScriptLibraryVisibility
// NumValues: 0x0005
enum class ENiagaraScriptLibraryVisibility : uint8
{
	Invalid                                  = 0,
	Unexposed                                = 1,
	Library                                  = 2,
	Hidden                                   = 3,
	ENiagaraScriptLibraryVisibility_MAX      = 4,
};

// Enum Niagara.ENiagaraScriptTemplateSpecification
// NumValues: 0x0004
enum class ENiagaraScriptTemplateSpecification : uint8
{
	None                                     = 0,
	Template                                 = 1,
	Behavior                                 = 2,
	ENiagaraScriptTemplateSpecification_MAX  = 3,
};

// Enum Niagara.ENDISkelMesh_GpuMaxInfluences
// NumValues: 0x0004
enum class ENDISkelMesh_GpuMaxInfluences : uint8
{
	AllowMax4                                = 0,
	AllowMax8                                = 1,
	Unlimited                                = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENDISkelMesh_GpuUniformSamplingFormat
// NumValues: 0x0004
enum class ENDISkelMesh_GpuUniformSamplingFormat : uint8
{
	Full                                     = 0,
	Limited_24_8                             = 1,
	Limited_23_9                             = 2,
	ENDISkelMesh_MAX                         = 3,
};

// Enum Niagara.ENDISkelMesh_AdjacencyTriangleIndexFormat
// NumValues: 0x0003
enum class ENDISkelMesh_AdjacencyTriangleIndexFormat : uint8
{
	Full                                     = 0,
	Half                                     = 1,
	ENDISkelMesh_MAX                         = 2,
};

// Enum Niagara.ENiagaraDefaultRendererPixelCoverageMode
// NumValues: 0x0003
enum class ENiagaraDefaultRendererPixelCoverageMode : uint8
{
	Enabled                                  = 0,
	Disabled                                 = 1,
	ENiagaraDefaultRendererPixelCoverageMode_MAX = 2,
};

// Enum Niagara.ENDICollisionQuery_AsyncGpuTraceProvider
// NumValues: 0x0005
enum class ENDICollisionQuery_AsyncGpuTraceProvider : uint8
{
	Default                                  = 0,
	HWRT                                     = 1,
	GSDF                                     = 2,
	None                                     = 3,
	ENDICollisionQuery_MAX                   = 4,
};

// Enum Niagara.ENiagaraSpriteAlignment
// NumValues: 0x0004
enum class ENiagaraSpriteAlignment : uint8
{
	Unaligned                                = 0,
	VelocityAligned                          = 1,
	CustomAlignment                          = 2,
	ENiagaraSpriteAlignment_MAX              = 3,
};

// Enum Niagara.ENiagaraSpriteFacingMode
// NumValues: 0x0006
enum class ENiagaraSpriteFacingMode : uint8
{
	FaceCamera                               = 0,
	FaceCameraPlane                          = 1,
	CustomFacingVector                       = 2,
	FaceCameraPosition                       = 3,
	FaceCameraDistanceBlend                  = 4,
	ENiagaraSpriteFacingMode_MAX             = 5,
};

// Enum Niagara.ENiagaraRendererPixelCoverageMode
// NumValues: 0x0007
enum class ENiagaraRendererPixelCoverageMode : uint8
{
	Automatic                                = 0,
	Disabled                                 = 1,
	Enabled                                  = 2,
	Enabled_RGBA                             = 3,
	Enabled_RGB                              = 4,
	Enabled_A                                = 5,
	ENiagaraRendererPixelCoverageMode_MAX    = 6,
};

// Enum Niagara.ENiagaraReorientedSpritesSortMode
// NumValues: 0x0004
enum class ENiagaraReorientedSpritesSortMode : uint8
{
	Unordered                                = 0,
	Sort                                     = 1,
	WBOIT                                    = 2,
	ENiagaraReorientedSpritesSortMode_MAX    = 3,
};

// Enum Niagara.ENiagaraReorientedSpritesDirectLightingMode
// NumValues: 0x0004
enum class ENiagaraReorientedSpritesDirectLightingMode : uint8
{
	Off                                      = 0,
	On                                       = 1,
	Inline                                   = 2,
	ENiagaraReorientedSpritesDirectLightingMode_MAX = 3,
};

// Enum Niagara.ENiagaraCompilationState
// NumValues: 0x0009
enum class ENiagaraCompilationState : uint8
{
	CheckDDC                                 = 0,
	Precompile                               = 1,
	StartCompileJob                          = 2,
	AwaitResult                              = 3,
	ProcessResult                            = 4,
	PutToDDC                                 = 5,
	Finished                                 = 6,
	Aborted                                  = 7,
	ENiagaraCompilationState_MAX             = 8,
};

// Enum Niagara.ENiagaraStructConversionType
// NumValues: 0x0007
enum class ENiagaraStructConversionType : uint8
{
	CopyOnly                                 = 0,
	DoubleToFloat                            = 1,
	Vector2                                  = 2,
	Vector3                                  = 3,
	Vector4                                  = 4,
	Quat                                     = 5,
	ENiagaraStructConversionType_MAX         = 6,
};

// Enum Niagara.ENiagaraNumericOutputTypeSelectionMode
// NumValues: 0x0006
enum class ENiagaraNumericOutputTypeSelectionMode : uint8
{
	None                                     = 0,
	Largest                                  = 1,
	Smallest                                 = 2,
	Scalar                                   = 3,
	Custom                                   = 4,
	ENiagaraNumericOutputTypeSelectionMode_MAX = 5,
};

// Enum Niagara.ENiagaraExecutionStateSource
// NumValues: 0x0005
enum class ENiagaraExecutionStateSource : uint8
{
	Scalability                              = 0,
	Internal                                 = 1,
	Owner                                    = 2,
	InternalCompletion                       = 3,
	ENiagaraExecutionStateSource_MAX         = 4,
};

// Enum Niagara.ENiagaraExecutionState
// NumValues: 0x0007
enum class ENiagaraExecutionState : uint32
{
	Active                                   = 0,
	Inactive                                 = 1,
	InactiveClear                            = 2,
	Complete                                 = 3,
	Disabled                                 = 4,
	Num                                      = 5,
	ENiagaraExecutionState_MAX               = 6,
};

// Enum Niagara.ENiagaraCoordinateSpace
// NumValues: 0x0004
enum class ENiagaraCoordinateSpace : uint8
{
	Simulation                               = 0,
	World                                    = 1,
	Local                                    = 2,
	ENiagaraCoordinateSpace_MAX              = 3,
};

// Enum Niagara.ENiagaraPythonUpdateScriptReference
// NumValues: 0x0004
enum class ENiagaraPythonUpdateScriptReference : uint8
{
	None                                     = 0,
	ScriptAsset                              = 1,
	DirectTextEntry                          = 2,
	ENiagaraPythonUpdateScriptReference_MAX  = 3,
};

// Enum Niagara.ENiagaraOrientationAxis
// NumValues: 0x0004
enum class ENiagaraOrientationAxis : uint8
{
	XAxis                                    = 0,
	YAxis                                    = 1,
	ZAxis                                    = 2,
	ENiagaraOrientationAxis_MAX              = 3,
};

// Enum Niagara.ENiagaraBoolDisplayMode
// NumValues: 0x0004
enum class ENiagaraBoolDisplayMode : uint8
{
	DisplayAlways                            = 0,
	DisplayIfTrue                            = 1,
	DisplayIfFalse                           = 2,
	ENiagaraBoolDisplayMode_MAX              = 3,
};

// Enum Niagara.ENiagaraVariantMode
// NumValues: 0x0005
enum class ENiagaraVariantMode : uint32
{
	None                                     = 0,
	Object                                   = 1,
	DataInterface                            = 2,
	Bytes                                    = 3,
	ENiagaraVariantMode_MAX                  = 4,
};

// Enum Niagara.EVolumeCacheType
// NumValues: 0x0002
enum class EVolumeCacheType : uint8
{
	OpenVDB                                  = 0,
	EVolumeCacheType_MAX                     = 1,
};

// ScriptStruct Niagara.NiagaraDebuggerExecuteConsoleCommand
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraDebuggerExecuteConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRequiresWorld;                                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraDebuggerExecuteConsoleCommand) == 0x000008, "Wrong alignment on FNiagaraDebuggerExecuteConsoleCommand");
static_assert(sizeof(FNiagaraDebuggerExecuteConsoleCommand) == 0x000018, "Wrong size on FNiagaraDebuggerExecuteConsoleCommand");
static_assert(offsetof(FNiagaraDebuggerExecuteConsoleCommand, Command) == 0x000000, "Member 'FNiagaraDebuggerExecuteConsoleCommand::Command' has a wrong offset!");
static_assert(offsetof(FNiagaraDebuggerExecuteConsoleCommand, bRequiresWorld) == 0x000010, "Member 'FNiagaraDebuggerExecuteConsoleCommand::bRequiresWorld' has a wrong offset!");

// ScriptStruct Niagara.NiagaraTypeDefinitionHandle
// 0x0004 (0x0004 - 0x0000)
struct FNiagaraTypeDefinitionHandle final
{
public:
	int32                                         RegisteredTypeIndex;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong alignment on FNiagaraTypeDefinitionHandle");
static_assert(sizeof(FNiagaraTypeDefinitionHandle) == 0x000004, "Wrong size on FNiagaraTypeDefinitionHandle");
static_assert(offsetof(FNiagaraTypeDefinitionHandle, RegisteredTypeIndex) == 0x000000, "Member 'FNiagaraTypeDefinitionHandle::RegisteredTypeIndex' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariableBase
// 0x000C (0x000C - 0x0000)
struct FNiagaraVariableBase
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FNiagaraTypeDefinitionHandle           TypeDefHandle;                                     // 0x0008(0x0004)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FNiagaraVariableBase) == 0x000004, "Wrong alignment on FNiagaraVariableBase");
static_assert(sizeof(FNiagaraVariableBase) == 0x00000C, "Wrong size on FNiagaraVariableBase");
static_assert(offsetof(FNiagaraVariableBase, Name) == 0x000000, "Member 'FNiagaraVariableBase::Name' has a wrong offset!");
static_assert(offsetof(FNiagaraVariableBase, TypeDefHandle) == 0x000008, "Member 'FNiagaraVariableBase::TypeDefHandle' has a wrong offset!");

// ScriptStruct Niagara.NiagaraVariable
// 0x0014 (0x0020 - 0x000C)
struct FNiagaraVariable final : public FNiagaraVariableBase
{
public:
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 VarData;                                           // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FNiagaraVariable) == 0x000008, "Wrong alignment on FNiagaraVariable");
static_assert(sizeof(FNiagaraVariable) == 0x000020, "Wrong size on FNiagaraVariable");
static_assert(offsetof(FNiagaraVariable, VarData) == 0x000010, "Member 'FNiagaraVariable::VarData' has a wrong offset!");

// ScriptStruct Niagara.MovieSceneNiagaraParameterSectionTemplate
// 0x0020 (0x0040 - 0x0020)
struct FMovieSceneNiagaraParameterSectionTemplate : public FMovieSceneEvalTemplate
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0020(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};
static_assert(alignof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000008, "Wrong alignment on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(sizeof(FMovieSceneNiagaraParameterSectionTemplate) == 0x000040, "Wrong size on FMovieSceneNiagaraParameterSectionTemplate");
static_assert(offsetof(FMovieSceneNiagaraParameterSectionTemplate, Parameter) == 0x000020, "Member 'FMovieSceneNiagaraParameterSectionTemplate::Parameter' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerEmitterInstanceData
// 0x0020 (0x0020 - 0x0000)
struct FNiagaraOutlinerEmitterInstanceData final
{
public:
	class FString                                 EmitterName;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraSimTarget                             SimTarget;                                         // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraExecutionState                        ExecState;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumParticles;                                      // 0x0018(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRequiresPersistentIDs : 1;                        // 0x001C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraOutlinerEmitterInstanceData) == 0x000008, "Wrong alignment on FNiagaraOutlinerEmitterInstanceData");
static_assert(sizeof(FNiagaraOutlinerEmitterInstanceData) == 0x000020, "Wrong size on FNiagaraOutlinerEmitterInstanceData");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, EmitterName) == 0x000000, "Member 'FNiagaraOutlinerEmitterInstanceData::EmitterName' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, SimTarget) == 0x000010, "Member 'FNiagaraOutlinerEmitterInstanceData::SimTarget' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, ExecState) == 0x000014, "Member 'FNiagaraOutlinerEmitterInstanceData::ExecState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerEmitterInstanceData, NumParticles) == 0x000018, "Member 'FNiagaraOutlinerEmitterInstanceData::NumParticles' has a wrong offset!");

// ScriptStruct Niagara.NiagaraScalabilityState
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraScalabilityState final
{
public:
	float                                         Significance;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x2];                                        // 0x0004(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bCulled : 1;                                       // 0x0006(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bPreviousCulled : 1;                               // 0x0006(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByDistance : 1;                             // 0x0006(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByInstanceCount : 1;                        // 0x0006(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByVisibility : 1;                           // 0x0006(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCulledByGlobalBudget : 1;                         // 0x0006(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraScalabilityState) == 0x000004, "Wrong alignment on FNiagaraScalabilityState");
static_assert(sizeof(FNiagaraScalabilityState) == 0x000008, "Wrong size on FNiagaraScalabilityState");
static_assert(offsetof(FNiagaraScalabilityState, Significance) == 0x000000, "Member 'FNiagaraScalabilityState::Significance' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerTimingData
// 0x0008 (0x0008 - 0x0000)
struct FNiagaraOutlinerTimingData final
{
public:
	float                                         GameThread;                                        // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RenderThread;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraOutlinerTimingData) == 0x000004, "Wrong alignment on FNiagaraOutlinerTimingData");
static_assert(sizeof(FNiagaraOutlinerTimingData) == 0x000008, "Wrong size on FNiagaraOutlinerTimingData");
static_assert(offsetof(FNiagaraOutlinerTimingData, GameThread) == 0x000000, "Member 'FNiagaraOutlinerTimingData::GameThread' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerTimingData, RenderThread) == 0x000004, "Member 'FNiagaraOutlinerTimingData::RenderThread' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerSystemInstanceData
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraOutlinerSystemInstanceData final
{
public:
	class FString                                 ComponentName;                                     // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraOutlinerEmitterInstanceData> Emitters;                                          // 0x0010(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	ENiagaraExecutionState                        ActualExecutionState;                              // 0x0020(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraExecutionState                        RequestedExecutionState;                           // 0x0024(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraScalabilityState               ScalabilityState;                                  // 0x0028(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bPendingKill : 1;                                  // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUsingCullProxy : 1;                               // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	ENCPoolMethod                                 PoolMethod;                                        // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraOutlinerTimingData             AverageTime;                                       // 0x0038(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             MaxTime;                                           // 0x0040(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	ETickingGroup                                 TickGroup;                                         // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsSolo : 1;                                       // 0x004C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresDistanceFieldData : 1;                    // 0x004C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresDepthBuffer : 1;                          // 0x004C(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresEarlyViewData : 1;                        // 0x004C(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresViewUniformBuffer : 1;                    // 0x004C(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bRequiresRayTracingScene : 1;                      // 0x004C(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraOutlinerSystemInstanceData) == 0x000008, "Wrong alignment on FNiagaraOutlinerSystemInstanceData");
static_assert(sizeof(FNiagaraOutlinerSystemInstanceData) == 0x000050, "Wrong size on FNiagaraOutlinerSystemInstanceData");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ComponentName) == 0x000000, "Member 'FNiagaraOutlinerSystemInstanceData::ComponentName' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, Emitters) == 0x000010, "Member 'FNiagaraOutlinerSystemInstanceData::Emitters' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ActualExecutionState) == 0x000020, "Member 'FNiagaraOutlinerSystemInstanceData::ActualExecutionState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, RequestedExecutionState) == 0x000024, "Member 'FNiagaraOutlinerSystemInstanceData::RequestedExecutionState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, ScalabilityState) == 0x000028, "Member 'FNiagaraOutlinerSystemInstanceData::ScalabilityState' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, PoolMethod) == 0x000034, "Member 'FNiagaraOutlinerSystemInstanceData::PoolMethod' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, AverageTime) == 0x000038, "Member 'FNiagaraOutlinerSystemInstanceData::AverageTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, MaxTime) == 0x000040, "Member 'FNiagaraOutlinerSystemInstanceData::MaxTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemInstanceData, TickGroup) == 0x000048, "Member 'FNiagaraOutlinerSystemInstanceData::TickGroup' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerSystemData
// 0x0030 (0x0030 - 0x0000)
struct FNiagaraOutlinerSystemData final
{
public:
	TArray<struct FNiagaraOutlinerSystemInstanceData> SystemInstances;                                   // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             AveragePerFrameTime;                               // 0x0010(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             MaxPerFrameTime;                                   // 0x0018(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             AveragePerInstanceTime;                            // 0x0020(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             MaxPerInstanceTime;                                // 0x0028(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraOutlinerSystemData) == 0x000008, "Wrong alignment on FNiagaraOutlinerSystemData");
static_assert(sizeof(FNiagaraOutlinerSystemData) == 0x000030, "Wrong size on FNiagaraOutlinerSystemData");
static_assert(offsetof(FNiagaraOutlinerSystemData, SystemInstances) == 0x000000, "Member 'FNiagaraOutlinerSystemData::SystemInstances' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemData, AveragePerFrameTime) == 0x000010, "Member 'FNiagaraOutlinerSystemData::AveragePerFrameTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemData, MaxPerFrameTime) == 0x000018, "Member 'FNiagaraOutlinerSystemData::MaxPerFrameTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemData, AveragePerInstanceTime) == 0x000020, "Member 'FNiagaraOutlinerSystemData::AveragePerInstanceTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerSystemData, MaxPerInstanceTime) == 0x000028, "Member 'FNiagaraOutlinerSystemData::MaxPerInstanceTime' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerWorldData
// 0x0068 (0x0068 - 0x0000)
struct FNiagaraOutlinerWorldData final
{
public:
	TMap<class FString, struct FNiagaraOutlinerSystemData> Systems;                                           // 0x0000(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
	bool                                          bHasBegunPlay;                                     // 0x0050(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         WorldType;                                         // 0x0051(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         NetMode;                                           // 0x0052(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraOutlinerTimingData             AveragePerFrameTime;                               // 0x0054(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FNiagaraOutlinerTimingData             MaxPerFrameTime;                                   // 0x005C(0x0008)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FNiagaraOutlinerWorldData) == 0x000008, "Wrong alignment on FNiagaraOutlinerWorldData");
static_assert(sizeof(FNiagaraOutlinerWorldData) == 0x000068, "Wrong size on FNiagaraOutlinerWorldData");
static_assert(offsetof(FNiagaraOutlinerWorldData, Systems) == 0x000000, "Member 'FNiagaraOutlinerWorldData::Systems' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerWorldData, bHasBegunPlay) == 0x000050, "Member 'FNiagaraOutlinerWorldData::bHasBegunPlay' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerWorldData, WorldType) == 0x000051, "Member 'FNiagaraOutlinerWorldData::WorldType' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerWorldData, NetMode) == 0x000052, "Member 'FNiagaraOutlinerWorldData::NetMode' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerWorldData, AveragePerFrameTime) == 0x000054, "Member 'FNiagaraOutlinerWorldData::AveragePerFrameTime' has a wrong offset!");
static_assert(offsetof(FNiagaraOutlinerWorldData, MaxPerFrameTime) == 0x00005C, "Member 'FNiagaraOutlinerWorldData::MaxPerFrameTime' has a wrong offset!");

// ScriptStruct Niagara.NiagaraOutlinerData
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraOutlinerData final
{
public:
	TMap<class FString, struct FNiagaraOutlinerWorldData> WorldData;                                         // 0x0000(0x0050)(Edit, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraOutlinerData) == 0x000008, "Wrong alignment on FNiagaraOutlinerData");
static_assert(sizeof(FNiagaraOutlinerData) == 0x000050, "Wrong size on FNiagaraOutlinerData");
static_assert(offsetof(FNiagaraOutlinerData, WorldData) == 0x000000, "Member 'FNiagaraOutlinerData::WorldData' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebuggerOutlinerUpdate
// 0x0050 (0x0050 - 0x0000)
struct FNiagaraDebuggerOutlinerUpdate final
{
public:
	struct FNiagaraOutlinerData                   OutlinerData;                                      // 0x0000(0x0050)(Edit, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDebuggerOutlinerUpdate) == 0x000008, "Wrong alignment on FNiagaraDebuggerOutlinerUpdate");
static_assert(sizeof(FNiagaraDebuggerOutlinerUpdate) == 0x000050, "Wrong size on FNiagaraDebuggerOutlinerUpdate");
static_assert(offsetof(FNiagaraDebuggerOutlinerUpdate, OutlinerData) == 0x000000, "Member 'FNiagaraDebuggerOutlinerUpdate::OutlinerData' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebugHudTextOptions
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraDebugHudTextOptions final
{
public:
	ENiagaraDebugHudFont                          Font;                                              // 0x0000(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudHAlign                        HorizontalAlignment;                               // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudVAlign                        VerticalAlignment;                                 // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ScreenOffset;                                      // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDebugHudTextOptions) == 0x000008, "Wrong alignment on FNiagaraDebugHudTextOptions");
static_assert(sizeof(FNiagaraDebugHudTextOptions) == 0x000018, "Wrong size on FNiagaraDebugHudTextOptions");
static_assert(offsetof(FNiagaraDebugHudTextOptions, Font) == 0x000000, "Member 'FNiagaraDebugHudTextOptions::Font' has a wrong offset!");
static_assert(offsetof(FNiagaraDebugHudTextOptions, HorizontalAlignment) == 0x000004, "Member 'FNiagaraDebugHudTextOptions::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(FNiagaraDebugHudTextOptions, VerticalAlignment) == 0x000005, "Member 'FNiagaraDebugHudTextOptions::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(FNiagaraDebugHudTextOptions, ScreenOffset) == 0x000008, "Member 'FNiagaraDebugHudTextOptions::ScreenOffset' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebugHUDVariable
// 0x0018 (0x0018 - 0x0000)
struct FNiagaraDebugHUDVariable final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name;                                              // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FNiagaraDebugHUDVariable) == 0x000008, "Wrong alignment on FNiagaraDebugHUDVariable");
static_assert(sizeof(FNiagaraDebugHUDVariable) == 0x000018, "Wrong size on FNiagaraDebugHUDVariable");
static_assert(offsetof(FNiagaraDebugHUDVariable, bEnabled) == 0x000000, "Member 'FNiagaraDebugHUDVariable::bEnabled' has a wrong offset!");
static_assert(offsetof(FNiagaraDebugHUDVariable, Name) == 0x000008, "Member 'FNiagaraDebugHUDVariable::Name' has a wrong offset!");

// ScriptStruct Niagara.NiagaraDebugHUDSettingsData
// 0x0220 (0x0220 - 0x0000)
struct FNiagaraDebugHUDSettingsData final
{
public:
	bool                                          bHudEnabled;                                       // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidateSystemSimulationDataBuffers;              // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValidateParticleDataBuffers;                      // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverviewEnabled;                                  // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHUDOverviewMode                  OverviewMode;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraDebugHudFont                          OverviewFont;                                      // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OverviewLocation;                                  // 0x0010(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorFilter;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bComponentFilterEnabled;                           // 0x0030(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
