#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraUIRenderer

#include "Basic.hpp"

#include "Niagara_classes.hpp"
#include "NiagaraUIRenderer_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class NiagaraUIRenderer.NiagaraSystemWidget
// 0x00B0 (0x01E0 - 0x0130)
class UNiagaraSystemWidget final : public UWidget
{
public:
	class UNiagaraSystem*                         NiagaraSystemReference;                            // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoActivate;                                      // 0x0138(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TickWhenPaused;                                    // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FakeDepthScale;                                    // 0x013A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FakeDepthScaleDistance;                            // 0x013C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          GSIsNeedWidgetSizeParam;                           // 0x0140(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0xF];                                      // 0x0141(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               GSVec4A;                                           // 0x0150(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               GSVec4B;                                           // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GSColorA;                                          // 0x0190(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GSColorB;                                          // 0x01A0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSlateMeshData>                 MeshData;                                          // 0x01B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x10];                                     // 0x01C0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    NiagaraComponent;                                  // 0x01D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1D8[0x8];                                      // 0x01D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateSystem(bool Reset);
	void DeactivateSystem();
	class UNiagaraUIComponent* GetNiagaraComponent();
	void GSActiveFX(bool IsActive, bool IsReset);
	void GSDestoryFX();
	void GSPauseFX();
	void GSPlayFX(bool IsReset);
	void GSResumeFX();
	void GSSetNiagaraValBool(const class FString& InName, bool InVal);
	void GSSetNiagaraValFloat(const class FString& InName, float InVal);
	void GSSetNiagaraValInt(const class FString& InName, int32 InVal);
	void GSSetNiagaraValLinearColor(const class FString& InName, const struct FLinearColor& InVal);
	void GSSetNiagaraValVector(const class FString& InName, const struct FVector& InVal);
	void GSSetNiagaraValVector2(const class FString& InName, const struct FVector2D& InVal);
	void GSSetNiagaraValVector4(const class FString& InName, const struct FVector4& InVal);
	void GSStopFX(bool IsReset);
	void ReInitSystem();
	void SetGSColorA(const struct FLinearColor& InColor);
	void SetGSColorB(const struct FLinearColor& InColor);
	void SetGSVec4A(const struct FVector4& InVec4);
	void SetGSVec4B(const struct FVector4& InVec4);
	void UpdateNiagaraSystemReference(class UNiagaraSystem* NewNiagaraSystem);
	void UpdateTickWhenPaused(bool NewTickWhenPaused);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraSystemWidget">();
	}
	static class UNiagaraSystemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraSystemWidget>();
	}
};
static_assert(alignof(UNiagaraSystemWidget) == 0x000010, "Wrong alignment on UNiagaraSystemWidget");
static_assert(sizeof(UNiagaraSystemWidget) == 0x0001E0, "Wrong size on UNiagaraSystemWidget");
static_assert(offsetof(UNiagaraSystemWidget, NiagaraSystemReference) == 0x000130, "Member 'UNiagaraSystemWidget::NiagaraSystemReference' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, AutoActivate) == 0x000138, "Member 'UNiagaraSystemWidget::AutoActivate' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, TickWhenPaused) == 0x000139, "Member 'UNiagaraSystemWidget::TickWhenPaused' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, FakeDepthScale) == 0x00013A, "Member 'UNiagaraSystemWidget::FakeDepthScale' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, FakeDepthScaleDistance) == 0x00013C, "Member 'UNiagaraSystemWidget::FakeDepthScaleDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, GSIsNeedWidgetSizeParam) == 0x000140, "Member 'UNiagaraSystemWidget::GSIsNeedWidgetSizeParam' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, GSVec4A) == 0x000150, "Member 'UNiagaraSystemWidget::GSVec4A' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, GSVec4B) == 0x000170, "Member 'UNiagaraSystemWidget::GSVec4B' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, GSColorA) == 0x000190, "Member 'UNiagaraSystemWidget::GSColorA' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, GSColorB) == 0x0001A0, "Member 'UNiagaraSystemWidget::GSColorB' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, MeshData) == 0x0001B0, "Member 'UNiagaraSystemWidget::MeshData' has a wrong offset!");
static_assert(offsetof(UNiagaraSystemWidget, NiagaraComponent) == 0x0001D0, "Member 'UNiagaraSystemWidget::NiagaraComponent' has a wrong offset!");

// Class NiagaraUIRenderer.NiagaraUIComponent
// 0x0010 (0x07F0 - 0x07E0)
class UNiagaraUIComponent final : public UNiagaraComponent
{
public:
	uint8                                         Pad_7E0[0x10];                                     // 0x07E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraUIComponent">();
	}
	static class UNiagaraUIComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraUIComponent>();
	}
};
static_assert(alignof(UNiagaraUIComponent) == 0x000010, "Wrong alignment on UNiagaraUIComponent");
static_assert(sizeof(UNiagaraUIComponent) == 0x0007F0, "Wrong size on UNiagaraUIComponent");

// Class NiagaraUIRenderer.UINiagaraMInstanceConst
// 0x0000 (0x0220 - 0x0220)
class UUINiagaraMInstanceConst final : public UMaterialInstanceConstant
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINiagaraMInstanceConst">();
	}
	static class UUINiagaraMInstanceConst* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUINiagaraMInstanceConst>();
	}
};
static_assert(alignof(UUINiagaraMInstanceConst) == 0x000008, "Wrong alignment on UUINiagaraMInstanceConst");
static_assert(sizeof(UUINiagaraMInstanceConst) == 0x000220, "Wrong size on UUINiagaraMInstanceConst");

}

