#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "NiagaraCore_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NiagaraShader_structs.hpp"
#include "NiagaraShader_classes.hpp"


namespace SDK
{

// Class Niagara.NiagaraDataInterface
// 0x0010 (0x0038 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
static_assert(alignof(UNiagaraDataInterface) == 0x000008, "Wrong alignment on UNiagaraDataInterface");
static_assert(sizeof(UNiagaraDataInterface) == 0x000038, "Wrong size on UNiagaraDataInterface");

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRWBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRWBase");
static_assert(sizeof(UNiagaraDataInterfaceRWBase) == 0x000038, "Wrong size on UNiagaraDataInterfaceRWBase");

// Class Niagara.NiagaraDataInterfaceArray
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceArray : public UNiagaraDataInterfaceRWBase
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ENiagaraGpuSyncMode                           GpuSyncMode;                                       // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxElements;                                       // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArray">();
	}
	static class UNiagaraDataInterfaceArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArray>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArray) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArray");
static_assert(sizeof(UNiagaraDataInterfaceArray) == 0x000048, "Wrong size on UNiagaraDataInterfaceArray");
static_assert(offsetof(UNiagaraDataInterfaceArray, GpuSyncMode) == 0x000040, "Member 'UNiagaraDataInterfaceArray::GpuSyncMode' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceArray, MaxElements) == 0x000044, "Member 'UNiagaraDataInterfaceArray::MaxElements' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayQuat
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayQuat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FQuat>                          QuatData;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayQuat">();
	}
	static class UNiagaraDataInterfaceArrayQuat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayQuat>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayQuat) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayQuat");
static_assert(sizeof(UNiagaraDataInterfaceArrayQuat) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayQuat");
static_assert(offsetof(UNiagaraDataInterfaceArrayQuat, QuatData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayQuat::QuatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceOcclusion
// 0x0000 (0x0038 - 0x0038)
class UNiagaraDataInterfaceOcclusion final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceOcclusion">();
	}
	static class UNiagaraDataInterfaceOcclusion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceOcclusion>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceOcclusion) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceOcclusion");
static_assert(sizeof(UNiagaraDataInterfaceOcclusion) == 0x000038, "Wrong size on UNiagaraDataInterfaceOcclusion");

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x00A0 - 0x0090)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0090(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraTrack">();
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraTrack");
static_assert(sizeof(UMovieSceneNiagaraTrack) == 0x0000A0, "Wrong size on UMovieSceneNiagaraTrack");
static_assert(offsetof(UMovieSceneNiagaraTrack, Sections) == 0x000090, "Member 'UMovieSceneNiagaraTrack::Sections' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceParticleRead
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceParticleRead final : public UNiagaraDataInterfaceRWBase
{
public:
	class FString                                 EmitterName;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceParticleRead">();
	}
	static class UNiagaraDataInterfaceParticleRead* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceParticleRead>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceParticleRead) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceParticleRead");
static_assert(sizeof(UNiagaraDataInterfaceParticleRead) == 0x000048, "Wrong size on UNiagaraDataInterfaceParticleRead");
static_assert(offsetof(UNiagaraDataInterfaceParticleRead, EmitterName) == 0x000038, "Member 'UNiagaraDataInterfaceParticleRead::EmitterName' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0020 (0x00C0 - 0x00A0)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x00A0(0x0020)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraParameterTrack">();
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraParameterTrack) == 0x0000C0, "Wrong size on UMovieSceneNiagaraParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraParameterTrack, Parameter) == 0x0000A0, "Member 'UMovieSceneNiagaraParameterTrack::Parameter' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraBoolParameterTrack">();
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraBoolParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraBoolParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraBoolParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraBoolParameterTrack");

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraColorParameterTrack">();
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraColorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraColorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraColorParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraColorParameterTrack");

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraFloatParameterTrack">();
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraFloatParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraFloatParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraFloatParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraFloatParameterTrack");

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0008 (0x00C8 - 0x00C0)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraIntegerParameterTrack">();
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraIntegerParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraIntegerParameterTrack) == 0x0000C8, "Wrong size on UMovieSceneNiagaraIntegerParameterTrack");

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F8 - 0x00E8)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x00F4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bAllowScalability;                                 // 0x00F5(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemSpawnSection">();
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemSpawnSection) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemSpawnSection");
static_assert(sizeof(UMovieSceneNiagaraSystemSpawnSection) == 0x0000F8, "Wrong size on UMovieSceneNiagaraSystemSpawnSection");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionStartBehavior) == 0x0000E8, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionStartBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEvaluateBehavior) == 0x0000EC, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEvaluateBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEndBehavior) == 0x0000F0, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEndBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, AgeUpdateMode) == 0x0000F4, "Member 'UMovieSceneNiagaraSystemSpawnSection::AgeUpdateMode' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, bAllowScalability) == 0x0000F5, "Member 'UMovieSceneNiagaraSystemSpawnSection::bAllowScalability' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0008 (0x00A8 - 0x00A0)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemTrack">();
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemTrack");
static_assert(sizeof(UMovieSceneNiagaraSystemTrack) == 0x0000A8, "Wrong size on UMovieSceneNiagaraSystemTrack");

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0010 (0x00D0 - 0x00C0)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ChannelsUsed;                                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraVectorParameterTrack">();
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraVectorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraVectorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraVectorParameterTrack) == 0x0000D0, "Wrong size on UMovieSceneNiagaraVectorParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraVectorParameterTrack, ChannelsUsed) == 0x0000C8, "Member 'UMovieSceneNiagaraVectorParameterTrack::ChannelsUsed' has a wrong offset!");

// Class Niagara.NiagaraActor
// 0x0010 (0x0288 - 0x0278)
class ANiagaraActor : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bDestroyOnSystemFinish : 1;                        // 0x0280(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnNiagaraSystemFinished(class UNiagaraComponent* FinishedComponent);
	void SetDestroyOnSystemFinish(bool bShouldDestroyOnSystemFinish);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
static_assert(alignof(ANiagaraActor) == 0x000008, "Wrong alignment on ANiagaraActor");
static_assert(sizeof(ANiagaraActor) == 0x000288, "Wrong size on ANiagaraActor");
static_assert(offsetof(ANiagaraActor, NiagaraComponent) == 0x000278, "Member 'ANiagaraActor::NiagaraComponent' has a wrong offset!");

// Class Niagara.NiagaraBakerSettings
// 0x0198 (0x01C0 - 0x0028)
class UNiagaraBakerSettings final : public UObject
{
public:
	float                                         StartSeconds;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DurationSeconds;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesPerSecond;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bPreviewLooping : 1;                               // 0x0034(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              FramesPerDimension;                                // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraBakerTextureSettings>   OutputTextures;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	ENiagaraBakerViewMode                         CameraViewportMode;                                // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CameraViewportLocation[0x7];                       // 0x0058(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraViewportRotation[0x7];                       // 0x0100(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         CameraOrbitDistance;                               // 0x01A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraFOV;                                         // 0x01AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CameraOrthoWidth;                                  // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bUseCameraAspectRatio : 1;                         // 0x01B4(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraAspectRatio;                                 // 0x01B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRenderComponentOnly : 1;                          // 0x01BC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraBakerSettings">();
	}
	static class UNiagaraBakerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraBakerSettings>();
	}
};
static_assert(alignof(UNiagaraBakerSettings) == 0x000008, "Wrong alignment on UNiagaraBakerSettings");
static_assert(sizeof(UNiagaraBakerSettings) == 0x0001C0, "Wrong size on UNiagaraBakerSettings");
static_assert(offsetof(UNiagaraBakerSettings, StartSeconds) == 0x000028, "Member 'UNiagaraBakerSettings::StartSeconds' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, DurationSeconds) == 0x00002C, "Member 'UNiagaraBakerSettings::DurationSeconds' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, FramesPerSecond) == 0x000030, "Member 'UNiagaraBakerSettings::FramesPerSecond' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, FramesPerDimension) == 0x000038, "Member 'UNiagaraBakerSettings::FramesPerDimension' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, OutputTextures) == 0x000040, "Member 'UNiagaraBakerSettings::OutputTextures' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportMode) == 0x000050, "Member 'UNiagaraBakerSettings::CameraViewportMode' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportLocation) == 0x000058, "Member 'UNiagaraBakerSettings::CameraViewportLocation' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraViewportRotation) == 0x000100, "Member 'UNiagaraBakerSettings::CameraViewportRotation' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraOrbitDistance) == 0x0001A8, "Member 'UNiagaraBakerSettings::CameraOrbitDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraFOV) == 0x0001AC, "Member 'UNiagaraBakerSettings::CameraFOV' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraOrthoWidth) == 0x0001B0, "Member 'UNiagaraBakerSettings::CameraOrthoWidth' has a wrong offset!");
static_assert(offsetof(UNiagaraBakerSettings, CameraAspectRatio) == 0x0001B8, "Member 'UNiagaraBakerSettings::CameraAspectRatio' has a wrong offset!");

// Class Niagara.NiagaraComponent
// 0x0280 (0x07E0 - 0x0560)
class UNiagaraComponent : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x0558(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x0560(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomSeedOffset;                                  // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x0568(0x00D8)(NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x0640(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bEnableGpuComputeDebug : 1;                        // 0x0640(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_640_2 : 6;                                  // 0x0640(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_641[0x37];                                     // 0x0641(0x0037)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x0678(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x0678(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x0678(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x0678(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_680[0x8];                                      // 0x0680(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSystemFinished;                                  // 0x0688(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x0698(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x06A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x06AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bRenderInTranslucencyUpscaledRTPass : 1;           // 0x06AB(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BitPad_6AB_1 : 7;                                  // 0x06AB(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_6AC[0x8];                                      // 0x06AC(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         BitPad_6B4_0 : 4;                                  // 0x06B4(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bAllowScalability : 1;                             // 0x06B4(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_6B5[0x123];                                    // 0x06B5(0x0123)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraCullProxyComponent*             CullProxy;                                         // 0x07D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	void ClearEmitterFixedBounds(class FName EmitterName);
	void ClearSystemFixedBounds();
	class UNiagaraDataInterface* GetDataInterface(const class FString& Name_0);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void InitForPerformanceBaseline();
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset, bool bResetExistingOverrideParameters);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetCustomTimeDilation(float Dilation);
	void SetDesiredAge(float InDesiredAge);
	void SetEmitterFixedBounds(class FName EmitterName, const struct FBox& LocalBounds);
	void SetForceLocalPlayerEffect(bool bIsPlayerEffect);
	void SetForceSolo(bool bInForceSolo);
	void SetGpuComputeDebug(bool bEnableDebug);
	void SetLockDesiredAgeDeltaTimeToSeekDelta(bool bLock);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariablePosition(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance, float PreviewMaxDistance);
	void SetRandomSeedOffset(int32 NewRandomSeedOffset);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);
	void SetSystemFixedBounds(const struct FBox& LocalBounds);
	void SetTickBehavior(ENiagaraTickBehavior NewTickBehavior);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariablePosition(class FName InVariableName, const struct FVector& InValue);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableStaticMesh(class FName InVariableName, class UStaticMesh* InValue);
	void SetVariableTexture(class FName InVariableName, class UTexture* Texture);
	void SetVariableTextureRenderTarget(class FName InVariableName, class UTextureRenderTarget* TextureRenderTarget);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	bool GetAllowScalability() const;
	class UNiagaraSystem* GetAsset() const;
	float GetCustomTimeDilation() const;
	float GetDesiredAge() const;
	struct FBox GetEmitterFixedBounds(class FName EmitterName) const;
	bool GetForceLocalPlayerEffect() const;
	bool GetForceSolo() const;
	bool GetLockDesiredAgeDeltaTimeToSeekDelta() const;
	float GetMaxSimTime() const;
	float GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	int32 GetRandomSeedOffset() const;
	float GetSeekDelta() const;
	struct FBox GetSystemFixedBounds() const;
	ENiagaraTickBehavior GetTickBehavior() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
static_assert(alignof(UNiagaraComponent) == 0x000010, "Wrong alignment on UNiagaraComponent");
static_assert(sizeof(UNiagaraComponent) == 0x0007E0, "Wrong size on UNiagaraComponent");
static_assert(offsetof(UNiagaraComponent, Asset) == 0x000558, "Member 'UNiagaraComponent::Asset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, TickBehavior) == 0x000560, "Member 'UNiagaraComponent::TickBehavior' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, RandomSeedOffset) == 0x000564, "Member 'UNiagaraComponent::RandomSeedOffset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OverrideParameters) == 0x000568, "Member 'UNiagaraComponent::OverrideParameters' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, MaxTimeBeforeForceUpdateTransform) == 0x00067C, "Member 'UNiagaraComponent::MaxTimeBeforeForceUpdateTransform' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OnSystemFinished) == 0x000688, "Member 'UNiagaraComponent::OnSystemFinished' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachParent) == 0x000698, "Member 'UNiagaraComponent::AutoAttachParent' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachSocketName) == 0x0006A0, "Member 'UNiagaraComponent::AutoAttachSocketName' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachLocationRule) == 0x0006A8, "Member 'UNiagaraComponent::AutoAttachLocationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachRotationRule) == 0x0006A9, "Member 'UNiagaraComponent::AutoAttachRotationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachScaleRule) == 0x0006AA, "Member 'UNiagaraComponent::AutoAttachScaleRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, CullProxy) == 0x0007D8, "Member 'UNiagaraComponent::CullProxy' has a wrong offset!");

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0028(0x0050)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentPool">();
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};
static_assert(alignof(UNiagaraComponentPool) == 0x000008, "Wrong alignment on UNiagaraComponentPool");
static_assert(sizeof(UNiagaraComponentPool) == 0x000080, "Wrong size on UNiagaraComponentPool");
static_assert(offsetof(UNiagaraComponentPool, WorldParticleSystemPools) == 0x000028, "Member 'UNiagaraComponentPool::WorldParticleSystemPools' has a wrong offset!");

// Class Niagara.NiagaraRendererProperties
// 0x00A8 (0x00D0 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	struct FNiagaraPlatformSet                    Platforms;                                         // 0x0028(0x0030)(Edit, NativeAccessSpecifierPublic)
	int32                                         SortOrderHint;                                     // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRendererMotionVectorSetting           MotionVectorSetting;                               // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererEnabledBinding;                            // 0x0060(0x0058)(Edit, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowInCullProxies;                               // 0x00B9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x00BA(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_BB[0x15];                                      // 0x00BB(0x0015)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRendererProperties");
static_assert(sizeof(UNiagaraRendererProperties) == 0x0000D0, "Wrong size on UNiagaraRendererProperties");
static_assert(offsetof(UNiagaraRendererProperties, Platforms) == 0x000028, "Member 'UNiagaraRendererProperties::Platforms' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, SortOrderHint) == 0x000058, "Member 'UNiagaraRendererProperties::SortOrderHint' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, MotionVectorSetting) == 0x00005C, "Member 'UNiagaraRendererProperties::MotionVectorSetting' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, RendererEnabledBinding) == 0x000060, "Member 'UNiagaraRendererProperties::RendererEnabledBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bIsEnabled) == 0x0000B8, "Member 'UNiagaraRendererProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bAllowInCullProxies) == 0x0000B9, "Member 'UNiagaraRendererProperties::bAllowInCullProxies' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bMotionBlurEnabled) == 0x0000BA, "Member 'UNiagaraRendererProperties::bMotionBlurEnabled' has a wrong offset!");

// Class Niagara.NiagaraComponentRendererProperties
// 0x0140 (0x0210 - 0x00D0)
class UNiagaraComponentRendererProperties final : public UNiagaraRendererProperties
{
public:
	TSubclassOf<class USceneComponent>            ComponentType;                                     // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ComponentCountLimit;                               // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       EnabledBinding;                                    // 0x00E0(0x0058)(Edit, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RendererVisibilityTagBinding;                      // 0x0138(0x0058)(Edit, NativeAccessSpecifierPublic)
	bool                                          bAssignComponentsOnParticleID;                     // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyCreateComponentsOnParticleSpawn;              // 0x0191(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOnlyActivateNewlyAquiredComponents;               // 0x0192(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_193[0x1];                                      // 0x0193(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RendererVisibility;                                // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        TemplateComponent;                                 // 0x0198(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FNiagaraComponentPropertyBinding> PropertyBindings;                                  // 0x01A0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B0[0x60];                                     // 0x01B0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentRendererProperties">();
	}
	static class UNiagaraComponentRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentRendererProperties>();
	}
};
static_assert(alignof(UNiagaraComponentRendererProperties) == 0x000008, "Wrong alignment on UNiagaraComponentRendererProperties");
static_assert(sizeof(UNiagaraComponentRendererProperties) == 0x000210, "Wrong size on UNiagaraComponentRendererProperties");
static_assert(offsetof(UNiagaraComponentRendererProperties, ComponentType) == 0x0000D0, "Member 'UNiagaraComponentRendererProperties::ComponentType' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, ComponentCountLimit) == 0x0000D8, "Member 'UNiagaraComponentRendererProperties::ComponentCountLimit' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, EnabledBinding) == 0x0000E0, "Member 'UNiagaraComponentRendererProperties::EnabledBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, RendererVisibilityTagBinding) == 0x000138, "Member 'UNiagaraComponentRendererProperties::RendererVisibilityTagBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, bAssignComponentsOnParticleID) == 0x000190, "Member 'UNiagaraComponentRendererProperties::bAssignComponentsOnParticleID' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, bOnlyCreateComponentsOnParticleSpawn) == 0x000191, "Member 'UNiagaraComponentRendererProperties::bOnlyCreateComponentsOnParticleSpawn' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, bOnlyActivateNewlyAquiredComponents) == 0x000192, "Member 'UNiagaraComponentRendererProperties::bOnlyActivateNewlyAquiredComponents' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, RendererVisibility) == 0x000194, "Member 'UNiagaraComponentRendererProperties::RendererVisibility' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, TemplateComponent) == 0x000198, "Member 'UNiagaraComponentRendererProperties::TemplateComponent' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentRendererProperties, PropertyBindings) == 0x0001A0, "Member 'UNiagaraComponentRendererProperties::PropertyBindings' has a wrong offset!");

// Class Niagara.NiagaraComponentSettings
// 0x0190 (0x01B8 - 0x0028)
class UNiagaraComponentSettings final : public UObject
{
public:
	TSet<class FName>                             SuppressActivationList;                            // 0x0028(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             ForceAutoPooolingList;                             // 0x0078(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<struct FNiagaraEmitterNameSettingsRef>   SuppressEmitterList;                               // 0x00C8(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<struct FNiagaraEmitterNameSettingsRef>   GPUEmitterAllowList;                               // 0x0118(0x0050)(Config, NativeAccessSpecifierPublic)
	TSet<class FName>                             GpuDataInterfaceDenyList;                          // 0x0168(0x0050)(Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentSettings">();
	}
	static class UNiagaraComponentSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentSettings>();
	}
};
static_assert(alignof(UNiagaraComponentSettings) == 0x000008, "Wrong alignment on UNiagaraComponentSettings");
static_assert(sizeof(UNiagaraComponentSettings) == 0x0001B8, "Wrong size on UNiagaraComponentSettings");
static_assert(offsetof(UNiagaraComponentSettings, SuppressActivationList) == 0x000028, "Member 'UNiagaraComponentSettings::SuppressActivationList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, ForceAutoPooolingList) == 0x000078, "Member 'UNiagaraComponentSettings::ForceAutoPooolingList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, SuppressEmitterList) == 0x0000C8, "Member 'UNiagaraComponentSettings::SuppressEmitterList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, GPUEmitterAllowList) == 0x000118, "Member 'UNiagaraComponentSettings::GPUEmitterAllowList' has a wrong offset!");
static_assert(offsetof(UNiagaraComponentSettings, GpuDataInterfaceDenyList) == 0x000168, "Member 'UNiagaraComponentSettings::GpuDataInterfaceDenyList' has a wrong offset!");

// Class Niagara.NiagaraConvertInPlaceUtilityBase
// 0x0000 (0x0028 - 0x0028)
class UNiagaraConvertInPlaceUtilityBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraConvertInPlaceUtilityBase">();
	}
	static class UNiagaraConvertInPlaceUtilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraConvertInPlaceUtilityBase>();
	}
};
static_assert(alignof(UNiagaraConvertInPlaceUtilityBase) == 0x000008, "Wrong alignment on UNiagaraConvertInPlaceUtilityBase");
static_assert(sizeof(UNiagaraConvertInPlaceUtilityBase) == 0x000028, "Wrong size on UNiagaraConvertInPlaceUtilityBase");

// Class Niagara.NiagaraCullProxyComponent
// 0x0010 (0x07F0 - 0x07E0)
class UNiagaraCullProxyComponent final : public UNiagaraComponent
{
public:
	TArray<struct FNiagaraCulledComponentInfo>    Instances;                                         // 0x07E0(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraCullProxyComponent">();
	}
	static class UNiagaraCullProxyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraCullProxyComponent>();
	}
};
static_assert(alignof(UNiagaraCullProxyComponent) == 0x000010, "Wrong alignment on UNiagaraCullProxyComponent");
static_assert(sizeof(UNiagaraCullProxyComponent) == 0x0007F0, "Wrong size on UNiagaraCullProxyComponent");
static_assert(offsetof(UNiagaraCullProxyComponent, Instances) == 0x0007E0, "Member 'UNiagaraCullProxyComponent::Instances' has a wrong offset!");

// Class Niagara.NiagaraDataInterface2DArrayTexture
// 0x0028 (0x0060 - 0x0038)
class UNiagaraDataInterface2DArrayTexture final : public UNiagaraDataInterface
{
public:
	class UTexture2DArray*                        Texture;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           TextureUserParameter;                              // 0x0040(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface2DArrayTexture">();
	}
	static class UNiagaraDataInterface2DArrayTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface2DArrayTexture>();
	}
};
static_assert(alignof(UNiagaraDataInterface2DArrayTexture) == 0x000008, "Wrong alignment on UNiagaraDataInterface2DArrayTexture");
static_assert(sizeof(UNiagaraDataInterface2DArrayTexture) == 0x000060, "Wrong size on UNiagaraDataInterface2DArrayTexture");
static_assert(offsetof(UNiagaraDataInterface2DArrayTexture, Texture) == 0x000038, "Member 'UNiagaraDataInterface2DArrayTexture::Texture' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterface2DArrayTexture, TextureUserParameter) == 0x000040, "Member 'UNiagaraDataInterface2DArrayTexture::TextureUserParameter' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceActorComponent
// 0x0040 (0x0078 - 0x0038)
class UNiagaraDataInterfaceActorComponent final : public UNiagaraDataInterface
{
public:
	bool                                          bRequireCurrentFrameData;                          // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TLazyObjectPtr<class AActor>                  SourceActor;                                       // 0x003C(0x001C)(Edit, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           ActorOrComponentParameter;                         // 0x0058(0x0020)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceActorComponent">();
	}
	static class UNiagaraDataInterfaceActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceActorComponent>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceActorComponent) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceActorComponent");
static_assert(sizeof(UNiagaraDataInterfaceActorComponent) == 0x000078, "Wrong size on UNiagaraDataInterfaceActorComponent");
static_assert(offsetof(UNiagaraDataInterfaceActorComponent, bRequireCurrentFrameData) == 0x000038, "Member 'UNiagaraDataInterfaceActorComponent::bRequireCurrentFrameData' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceActorComponent, SourceActor) == 0x00003C, "Member 'UNiagaraDataInterfaceActorComponent::SourceActor' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceActorComponent, ActorOrComponentParameter) == 0x000058, "Member 'UNiagaraDataInterfaceActorComponent::ActorOrComponentParameter' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat final : public UNiagaraDataInterfaceArray
{
public:
	TArray<float>                                 FloatData;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat">();
	}
	static class UNiagaraDataInterfaceArrayFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayFloat");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat, FloatData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayFloat::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat2
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat2 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector2D>                      FloatData;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat2">();
	}
	static class UNiagaraDataInterfaceArrayFloat2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat2>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat2) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat2");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat2) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayFloat2");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat2, FloatData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayFloat2::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat3
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat3 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector>                        FloatData;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat3">();
	}
	static class UNiagaraDataInterfaceArrayFloat3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat3>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat3) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat3");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat3) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayFloat3");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat3, FloatData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayFloat3::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayPosition
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayPosition final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FNiagaraPosition>               PositionData;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayPosition">();
	}
	static class UNiagaraDataInterfaceArrayPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayPosition>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayPosition) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayPosition");
static_assert(sizeof(UNiagaraDataInterfaceArrayPosition) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayPosition");
static_assert(offsetof(UNiagaraDataInterfaceArrayPosition, PositionData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayPosition::PositionData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayFloat4
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayFloat4 final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FVector4>                       FloatData;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayFloat4">();
	}
	static class UNiagaraDataInterfaceArrayFloat4* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayFloat4>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceArrayFloat4) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceArrayFloat4");
static_assert(sizeof(UNiagaraDataInterfaceArrayFloat4) == 0x000058, "Wrong size on UNiagaraDataInterfaceArrayFloat4");
static_assert(offsetof(UNiagaraDataInterfaceArrayFloat4, FloatData) == 0x000048, "Member 'UNiagaraDataInterfaceArrayFloat4::FloatData' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceArrayColor
// 0x0010 (0x0058 - 0x0048)
class UNiagaraDataInterfaceArrayColor final : public UNiagaraDataInterfaceArray
{
public:
	TArray<struct FLinearColor>                   ColorData;                                         // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceArrayColor">();
	}
	static class UNiagaraDataInterfaceArrayColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceArrayColor>();
	}
};
