#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NiagaraTickManager

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class NiagaraTickManager.NiagaraTickInvoker
// 0x0008 (0x00B8 - 0x00B0)
class UNiagaraTickInvoker final : public UActorComponent
{
public:
	float                                         PauseDistance;                                     // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraTickInvoker">();
	}
	static class UNiagaraTickInvoker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraTickInvoker>();
	}
};
static_assert(alignof(UNiagaraTickInvoker) == 0x000008, "Wrong alignment on UNiagaraTickInvoker");
static_assert(sizeof(UNiagaraTickInvoker) == 0x0000B8, "Wrong size on UNiagaraTickInvoker");
static_assert(offsetof(UNiagaraTickInvoker, PauseDistance) == 0x0000B0, "Member 'UNiagaraTickInvoker::PauseDistance' has a wrong offset!");

// Class NiagaraTickManager.NiagaraTickWorldSubsystem
// 0x0068 (0x00A8 - 0x0040)
class UNiagaraTickWorldSubsystem final : public UTickableWorldSubsystem
{
public:
	uint8                                         Pad_40[0x68];                                      // 0x0040(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnComponentActivated(class UActorComponent* Component, bool bReset);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraTickWorldSubsystem">();
	}
	static class UNiagaraTickWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraTickWorldSubsystem>();
	}
};
static_assert(alignof(UNiagaraTickWorldSubsystem) == 0x000008, "Wrong alignment on UNiagaraTickWorldSubsystem");
static_assert(sizeof(UNiagaraTickWorldSubsystem) == 0x0000A8, "Wrong size on UNiagaraTickWorldSubsystem");

}

