#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpacityMicroMap

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct OpacityMicroMap.OpacityMicromapUsageCount
// 0x000C (0x000C - 0x0000)
struct FOpacityMicromapUsageCount final
{
public:
	uint32                                        Count;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SubdivisionLevel;                                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Format;                                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOpacityMicromapUsageCount) == 0x000004, "Wrong alignment on FOpacityMicromapUsageCount");
static_assert(sizeof(FOpacityMicromapUsageCount) == 0x00000C, "Wrong size on FOpacityMicromapUsageCount");
static_assert(offsetof(FOpacityMicromapUsageCount, Count) == 0x000000, "Member 'FOpacityMicromapUsageCount::Count' has a wrong offset!");
static_assert(offsetof(FOpacityMicromapUsageCount, SubdivisionLevel) == 0x000004, "Member 'FOpacityMicromapUsageCount::SubdivisionLevel' has a wrong offset!");
static_assert(offsetof(FOpacityMicromapUsageCount, Format) == 0x000008, "Member 'FOpacityMicromapUsageCount::Format' has a wrong offset!");

}

