#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Enum PCG.EPCGAttributeAccessorFlags
// NumValues: 0x0005
enum class EPCGAttributeAccessorFlags : uint8
{
	StrictType                               = 1,
	AllowBroadcast                           = 2,
	AllowConstructible                       = 4,
	AllowSetDefaultValue                     = 8,
	EPCGAttributeAccessorFlags_MAX           = 9,
};

// Enum PCG.EPCGActorSelection
// NumValues: 0x0005
enum class EPCGActorSelection : uint8
{
	ByTag                                    = 0,
	ByName                                   = 1,
	ByClass                                  = 2,
	Unknown                                  = 3,
	EPCGActorSelection_MAX                   = 4,
};

// Enum PCG.EPCGActorFilter
// NumValues: 0x0006
enum class EPCGActorFilter : uint8
{
	Self                                     = 0,
	Parent                                   = 1,
	Root                                     = 2,
	AllWorldActors                           = 3,
	Original                                 = 4,
	EPCGActorFilter_MAX                      = 5,
};

// Enum PCG.EPCGAttributeFilterOperation
// NumValues: 0x0003
enum class EPCGAttributeFilterOperation : uint32
{
	KeepSelectedAttributes                   = 0,
	DeleteSelectedAttributes                 = 1,
	EPCGAttributeFilterOperation_MAX         = 2,
};

// Enum PCG.EPCGAttributeNoiseMode
// NumValues: 0x0006
enum class EPCGAttributeNoiseMode : uint8
{
	Set                                      = 0,
	Minimum                                  = 1,
	Maximum                                  = 2,
	Add                                      = 3,
	Multiply                                 = 4,
	EPCGAttributeNoiseMode_MAX               = 5,
};

// Enum PCG.EPCGAttributePropertySelection
// NumValues: 0x0004
enum class EPCGAttributePropertySelection : uint32
{
	Attribute                                = 0,
	PointProperty                            = 1,
	ExtraProperty                            = 2,
	EPCGAttributePropertySelection_MAX       = 3,
};

// Enum PCG.EPCGExtraProperties
// NumValues: 0x0002
enum class EPCGExtraProperties : uint8
{
	Index                                    = 0,
	EPCGExtraProperties_MAX                  = 1,
};

// Enum PCG.EPCGAttributeReduceOperation
// NumValues: 0x0003
enum class EPCGAttributeReduceOperation : uint32
{
	Average                                  = 0,
	Max                                      = 1,
	Min                                      = 2,
};

// Enum PCG.EPCGAttributeSelectOperation
// NumValues: 0x0003
enum class EPCGAttributeSelectOperation : uint32
{
	Min                                      = 0,
	Max                                      = 1,
	Median                                   = 2,
};

// Enum PCG.EPCGAttributeSelectAxis
// NumValues: 0x0006
enum class EPCGAttributeSelectAxis : uint32
{
	X                                        = 0,
	Y                                        = 1,
	Z                                        = 2,
	W                                        = 3,
	CustomAxis                               = 4,
	EPCGAttributeSelectAxis_MAX              = 5,
};

// Enum PCG.EPCGBoundsModifierMode
// NumValues: 0x0006
enum class EPCGBoundsModifierMode : uint8
{
	Set                                      = 0,
	Intersect                                = 1,
	Include                                  = 2,
	Translate                                = 3,
	Scale                                    = 4,
	EPCGBoundsModifierMode_MAX               = 5,
};

// Enum PCG.EPCGChangeType
// NumValues: 0x0008
enum class EPCGChangeType : uint8
{
	None                                     = 0,
	Cosmetic                                 = 1,
	Settings                                 = 2,
	Input                                    = 4,
	Edge                                     = 8,
	Node                                     = 16,
	Structural                               = 32,
	EPCGChangeType_MAX                       = 33,
};

// Enum PCG.EPCGDataType
// NumValues: 0x0014
enum class EPCGDataType : uint32
{
	None                                     = 0,
	Point                                    = 2,
	Spline                                   = 4,
	LandscapeSpline                          = 8,
	PolyLine                                 = 12,
	Landscape                                = 16,
	Texture                                  = 32,
	RenderTarget                             = 64,
	BaseTexture                              = 96,
	Surface                                  = 112,
	Volume                                   = 128,
	Primitive                                = 256,
	Concrete                                 = 510,
	Composite                                = 512,
	Spatial                                  = 1022,
	Param                                    = 134217728,
	Settings                                 = 268435456,
	Other                                    = 536870912,
	Any                                      = 1073741823,
	EPCGDataType_MAX                         = 1073741824,
};

// Enum PCG.EPCGExclusiveDataType
// NumValues: 0x0014
enum class EPCGExclusiveDataType : uint8
{
	None                                     = 0,
	Point                                    = 1,
	Spline                                   = 2,
	LandscapeSpline                          = 3,
	PolyLine                                 = 4,
	Landscape                                = 5,
	Texture                                  = 6,
	RenderTarget                             = 7,
	BaseTexture                              = 8,
	Surface                                  = 9,
	Volume                                   = 10,
	Primitive                                = 11,
	Concrete                                 = 12,
	Composite                                = 13,
	Spatial                                  = 14,
	Param                                    = 15,
	Settings                                 = 16,
	Other                                    = 17,
	Any                                      = 18,
	EPCGExclusiveDataType_MAX                = 19,
};

// Enum PCG.EPCGHiGenGrid
// NumValues: 0x000D
enum class EPCGHiGenGrid : uint32
{
	Uninitialized                            = 0,
	Grid32                                   = 32,
	Grid64                                   = 64,
	Grid128                                  = 128,
	Grid256                                  = 256,
	Grid512                                  = 512,
	Grid1024                                 = 1024,
	Grid2048                                 = 2048,
	GridMin                                  = 32,
	GridMax                                  = 2048,
	Unbounded                                = 4096,
	GenerationDefault                        = 8192,
	EPCGHiGenGrid_MAX                        = 8193,
};

// Enum PCG.EPCGAttachOptions
// NumValues: 0x0004
enum class EPCGAttachOptions : uint32
{
	NotAttached                              = 0,
	Attached                                 = 1,
	InFolder                                 = 2,
	EPCGAttachOptions_MAX                    = 3,
};

// Enum PCG.EPCGComponentInput
// NumValues: 0x0004
enum class EPCGComponentInput : uint8
{
	Actor                                    = 0,
	Landscape                                = 1,
	Other                                    = 2,
	EPCGComponentInput_MAX                   = 3,
};

// Enum PCG.EPCGComponentGenerationTrigger
// NumValues: 0x0003
enum class EPCGComponentGenerationTrigger : uint8
{
	GenerateOnLoad                           = 0,
	GenerateOnDemand                         = 1,
	EPCGComponentGenerationTrigger_MAX       = 2,
};

// Enum PCG.EPCGComponentDirtyFlag
// NumValues: 0x0007
enum class EPCGComponentDirtyFlag : uint8
{
	None                                     = 0,
	Actor                                    = 1,
	Landscape                                = 2,
	Input                                    = 4,
	Data                                     = 8,
	All                                      = 15,
	EPCGComponentDirtyFlag_MAX               = 16,
};

// Enum PCG.EPCGExecutionPhase
// NumValues: 0x0006
enum class EPCGExecutionPhase : uint8
{
	NotExecuted                              = 0,
	PrepareData                              = 1,
	Execute                                  = 2,
	PostExecute                              = 3,
	Done                                     = 4,
	EPCGExecutionPhase_MAX                   = 5,
};

// Enum PCG.EPCGCopyPointsInheritanceMode
// NumValues: 0x0004
enum class EPCGCopyPointsInheritanceMode : uint8
{
	Relative                                 = 0,
	Source                                   = 1,
	Target                                   = 2,
	EPCGCopyPointsInheritanceMode_MAX        = 3,
};

// Enum PCG.EPCGCopyPointsMetadataInheritanceMode
// NumValues: 0x0006
enum class EPCGCopyPointsMetadataInheritanceMode : uint8
{
	SourceFirst                              = 0,
	TargetFirst                              = 1,
	SourceOnly                               = 2,
	TargetOnly                               = 3,
	None                                     = 4,
	EPCGCopyPointsMetadataInheritanceMode_MAX = 5,
};

// Enum PCG.EPCGCreateSplineMode
// NumValues: 0x0004
enum class EPCGCreateSplineMode : uint8
{
	CreateDataOnly                           = 0,
	CreateComponent                          = 1,
	CreateNewActor                           = 2,
	EPCGCreateSplineMode_MAX                 = 3,
};

// Enum PCG.EPCGGetDataFromActorMode
// NumValues: 0x0006
enum class EPCGGetDataFromActorMode : uint8
{
	ParseActorComponents                     = 0,
	GetSinglePoint                           = 1,
	GetDataFromProperty                      = 2,
	GetDataFromPCGComponent                  = 3,
	GetDataFromPCGComponentOrParseComponents = 4,
	EPCGGetDataFromActorMode_MAX             = 5,
};

// Enum PCG.EPCGDebugVisScaleMethod
// NumValues: 0x0004
enum class EPCGDebugVisScaleMethod : uint8
{
	Relative                                 = 0,
	Absolute                                 = 1,
	Extents                                  = 2,
	EPCGDebugVisScaleMethod_MAX              = 3,
};

// Enum PCG.EDeterminismLevel
// NumValues: 0x0008
enum class EDeterminismLevel : uint8
{
	None                                     = 0,
	NoDeterminism                            = 0,
	Basic                                    = 1,
	OrderOrthogonal                          = 2,
	OrderConsistent                          = 3,
	OrderIndependent                         = 4,
	Deterministic                            = 4,
	EDeterminismLevel_MAX                    = 5,
};

// Enum PCG.EPCGDifferenceDensityFunction
// NumValues: 0x0004
enum class EPCGDifferenceDensityFunction : uint8
{
	Minimum                                  = 0,
	ClampedSubstraction                      = 1,
	Binary                                   = 2,
	EPCGDifferenceDensityFunction_MAX        = 3,
};

// Enum PCG.EPCGDifferenceMode
// NumValues: 0x0004
enum class EPCGDifferenceMode : uint8
{
	Inferred                                 = 0,
	Continuous                               = 1,
	Discrete                                 = 2,
	EPCGDifferenceMode_MAX                   = 3,
};

// Enum PCG.PCGDistanceShape
// NumValues: 0x0004
enum class EPCGDistanceShape : uint32
{
	SphereBounds                             = 0,
	BoxBounds                                = 1,
	Center                                   = 2,
	PCGDistanceShape_MAX                     = 3,
};

// Enum PCG.EPCGFilterByTagOperation
// NumValues: 0x0003
enum class EPCGFilterByTagOperation : uint32
{
	KeepTagged                               = 0,
	RemoveTagged                             = 1,
	EPCGFilterByTagOperation_MAX             = 2,
};

// Enum PCG.EPCGIntersectionDensityFunction
// NumValues: 0x0003
enum class EPCGIntersectionDensityFunction : uint8
{
	Multiply                                 = 0,
	Minimum                                  = 1,
	EPCGIntersectionDensityFunction_MAX      = 2,
};

// Enum PCG.EPCGMeshSelectorMaterialOverrideMode
// NumValues: 0x0004
enum class EPCGMeshSelectorMaterialOverrideMode : uint8
{
	NoOverride                               = 0,
	StaticOverride                           = 1,
	ByAttributeOverride                      = 2,
	EPCGMeshSelectorMaterialOverrideMode_MAX = 3,
};

// Enum PCG.EPCGMetadataTypes
// NumValues: 0x0010
enum class EPCGMetadataTypes : uint8
{
	Float                                    = 0,
	Double                                   = 1,
	Integer32                                = 2,
	Integer64                                = 3,
	Vector2                                  = 4,
	Vector                                   = 5,
	Vector4                                  = 6,
	Quaternion                               = 7,
	Transform                                = 8,
	String                                   = 9,
	Boolean                                  = 10,
	Rotator                                  = 11,
	Name                                     = 12,
	Count                                    = 13,
	Unknown                                  = 255,
	EPCGMetadataTypes_MAX                    = 256,
};

// Enum PCG.EPCGMedadataBitwiseOperation
// NumValues: 0x0005
enum class EPCGMedadataBitwiseOperation : uint16
{
	And                                      = 0,
	Not                                      = 1,
	Or                                       = 2,
	Xor                                      = 3,
	EPCGMedadataBitwiseOperation_MAX         = 4,
};

// Enum PCG.EPCGMedadataBooleanOperation
// NumValues: 0x0005
enum class EPCGMedadataBooleanOperation : uint16
{
	And                                      = 0,
	Not                                      = 1,
	Or                                       = 2,
	Xor                                      = 3,
	EPCGMedadataBooleanOperation_MAX         = 4,
};

// Enum PCG.EPCGMetadataOp
// NumValues: 0x0008
enum class EPCGMetadataOp : uint8
{
	Min                                      = 0,
	Max                                      = 1,
	Sub                                      = 2,
	Add                                      = 3,
	Mul                                      = 4,
	Div                                      = 5,
	SourceValue                              = 6,
	TargetValue                              = 7,
};

// Enum PCG.EPCGMetadataFilterMode
// NumValues: 0x0003
enum class EPCGMetadataFilterMode : uint8
{
	ExcludeAttributes                        = 0,
	IncludeAttributes                        = 1,
	EPCGMetadataFilterMode_MAX               = 2,
};

// Enum PCG.EPCGMedadataCompareOperation
// NumValues: 0x0007
enum class EPCGMedadataCompareOperation : uint16
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Greater                                  = 2,
	GreaterOrEqual                           = 3,
	Less                                     = 4,
	LessOrEqual                              = 5,
	EPCGMedadataCompareOperation_MAX         = 6,
};

// Enum PCG.EPCGMetadataOperationTarget
// NumValues: 0x0004
enum class EPCGMetadataOperationTarget : uint8
{
	PropertyToAttribute                      = 0,
	AttributeToProperty                      = 1,
	AttributeToAttribute                     = 2,
	EPCGMetadataOperationTarget_MAX          = 3,
};

// Enum PCG.EPCGMetadataMakeRotatorOp
// NumValues: 0x000C
enum class EPCGMetadataMakeRotatorOp : uint8
{
	MakeRotFromX                             = 0,
	MakeRotFromY                             = 1,
	MakeRotFromZ                             = 2,
	MakeRotFromXY                            = 3,
	MakeRotFromYX                            = 4,
	MakeRotFromXZ                            = 5,
	MakeRotFromZX                            = 6,
	MakeRotFromYZ                            = 7,
	MakeRotFromZY                            = 8,
	MakeRotFromAxes                          = 9,
	MakeRotFromAngles                        = 10,
	EPCGMetadataMakeRotatorOp_MAX            = 11,
};

// Enum PCG.EPCGMetadataMakeVector3
// NumValues: 0x0003
enum class EPCGMetadataMakeVector3 : uint8
{
	ThreeValues                              = 0,
	Vector2AndValue                          = 1,
	EPCGMetadataMakeVector3_MAX              = 2,
};

// Enum PCG.EPCGMetadataMakeVector4
// NumValues: 0x0005
enum class EPCGMetadataMakeVector4 : uint8
{
	FourValues                               = 0,
	Vector2AndTwoValues                      = 1,
	TwoVector2                               = 2,
	Vector3AndValue                          = 3,
	EPCGMetadataMakeVector4_MAX              = 4,
};

// Enum PCG.EPCGMedadataMathsOperation
// NumValues: 0x0019
enum class EPCGMedadataMathsOperation : uint16
{
	UnaryOp                                  = 1024,
	Sign                                     = 1025,
	Frac                                     = 1026,
	Truncate                                 = 1027,
	Round                                    = 1028,
	Sqrt                                     = 1029,
	Abs                                      = 1030,
	Floor                                    = 1031,
	Ceil                                     = 1032,
	OneMinus                                 = 1033,
	BinaryOp                                 = 2048,
	Add                                      = 2049,
	Subtract                                 = 2050,
	Multiply                                 = 2051,
	Divide                                   = 2052,
	Max                                      = 2053,
	Min                                      = 2054,
	Pow                                      = 2055,
	ClampMin                                 = 2056,
	ClampMax                                 = 2057,
	Modulo                                   = 2058,
	Set                                      = 2059,
	TernaryOp                                = 4096,
	Clamp                                    = 4097,
	Lerp                                     = 4098,
};

// Enum PCG.EPCGMetadataSettingsBaseMode
// NumValues: 0x0004
enum class EPCGMetadataSettingsBaseMode : uint8
{
	Inferred                                 = 0,
	NoBroadcast                              = 1,
	Broadcast                                = 2,
	EPCGMetadataSettingsBaseMode_MAX         = 3,
};

// Enum PCG.EPCGMetadataSettingsBaseTypes
// NumValues: 0x0003
enum class EPCGMetadataSettingsBaseTypes : uint8
{
	AutoUpcastTypes                          = 0,
	StrictTypes                              = 1,
	EPCGMetadataSettingsBaseTypes_MAX        = 2,
};

// Enum PCG.EPCGMedadataRotatorOperation
// NumValues: 0x0009
enum class EPCGMedadataRotatorOperation : uint16
{
	RotatorOp                                = 0,
	Combine                                  = 1,
	Invert                                   = 2,
	Lerp                                     = 3,
	Normalize                                = 4,
	TransformOp                              = 100,
	TransformRotation                        = 101,
	InverseTransformRotation                 = 102,
	EPCGMedadataRotatorOperation_MAX         = 103,
};

// Enum PCG.EPCGMetadataStringOperation
// NumValues: 0x0002
enum class EPCGMetadataStringOperation : uint16
{
	Append                                   = 0,
	EPCGMetadataStringOperation_MAX          = 1,
};

// Enum PCG.EPCGMedadataTransformOperation
// NumValues: 0x0004
enum class EPCGMedadataTransformOperation : uint16
{
	Compose                                  = 0,
	Invert                                   = 1,
	Lerp                                     = 2,
	EPCGMedadataTransformOperation_MAX       = 3,
};

// Enum PCG.EPCGTransformLerpMode
// NumValues: 0x0004
enum class EPCGTransformLerpMode : uint16
{
	QuatInterp                               = 0,
	EulerInterp                              = 1,
	DualQuatInterp                           = 2,
	EPCGTransformLerpMode_MAX                = 3,
};

// Enum PCG.EPCGMedadataTrigOperation
// NumValues: 0x000A
enum class EPCGMedadataTrigOperation : uint16
{
	Acos                                     = 0,
	Asin                                     = 1,
	Atan                                     = 2,
	Atan2                                    = 3,
	Cos                                      = 4,
	Sin                                      = 5,
	Tan                                      = 6,
	DegToRad                                 = 7,
	RadToDeg                                 = 8,
	EPCGMedadataTrigOperation_MAX            = 9,
};

// Enum PCG.EPCGMetadataTypesConstantStructStringMode
// NumValues: 0x0004
enum class EPCGMetadataTypesConstantStructStringMode : uint32
{
	String                                   = 0,
	SoftObjectPath                           = 1,
	SoftClassPath                            = 2,
	EPCGMetadataTypesConstantStructStringMode_MAX = 3,
};

// Enum PCG.EPCGMedadataVectorOperation
// NumValues: 0x000D
enum class EPCGMedadataVectorOperation : uint16
{
	VectorOp                                 = 0,
	Cross                                    = 1,
	Dot                                      = 2,
	Distance                                 = 3,
	Normalize                                = 4,
	Length                                   = 5,
	RotateAroundAxis                         = 6,
	TransformOp                              = 100,
	TransformDirection                       = 101,
	TransformLocation                        = 102,
	InverseTransformDirection                = 103,
	InverseTransformLocation                 = 104,
	EPCGMedadataVectorOperation_MAX          = 105,
};

// Enum PCG.PCGNormalToDensityMode
// NumValues: 0x0008
enum class EPCGNormalToDensityMode : uint8
{
	Set                                      = 0,
	Minimum                                  = 1,
	Maximum                                  = 2,
	Add                                      = 3,
	Subtract                                 = 4,
	Multiply                                 = 5,
	Divide                                   = 6,
	PCGNormalToDensityMode_MAX               = 7,
};

// Enum PCG.EPCGTypeConversion
// NumValues: 0x0006
enum class EPCGTypeConversion : uint8
{
	NoConversionRequired                     = 0,
	CollapseToPoint                          = 1,
	Filter                                   = 2,
	MakeConcrete                             = 3,
	Failed                                   = 4,
	EPCGTypeConversion_MAX                   = 5,
};

// Enum PCG.EPCGPointProperties
// NumValues: 0x000D
enum class EPCGPointProperties : uint8
{
	Density                                  = 0,
	BoundsMin                                = 1,
	BoundsMax                                = 2,
	Extents                                  = 3,
	Color                                    = 4,
	Position                                 = 5,
	Rotation                                 = 6,
	Scale                                    = 7,
	Transform                                = 8,
	Steepness                                = 9,
	LocalCenter                              = 10,
	Seed                                     = 11,
	EPCGPointProperties_MAX                  = 12,
};

// Enum PCG.EPCGPointExtentsModifierMode
// NumValues: 0x0006
enum class EPCGPointExtentsModifierMode : uint8
{
	Set                                      = 0,
	Minimum                                  = 1,
	Maximum                                  = 2,
	Add                                      = 3,
	Multiply                                 = 4,
	EPCGPointExtentsModifierMode_MAX         = 5,
};

// Enum PCG.EPCGPointTargetFilterType
// NumValues: 0x0003
enum class EPCGPointTargetFilterType : uint8
{
	Property                                 = 0,
	Metadata                                 = 1,
	EPCGPointTargetFilterType_MAX            = 2,
};

// Enum PCG.EPCGPointThresholdType
// NumValues: 0x0004
enum class EPCGPointThresholdType : uint8
{
	Property                                 = 0,
	Metadata                                 = 1,
	Constant                                 = 2,
	EPCGPointThresholdType_MAX               = 3,
};

// Enum PCG.EPCGPointFilterConstantType
// NumValues: 0x0007
enum class EPCGPointFilterConstantType : uint8
{
	Integer64                                = 0,
	Float                                    = 1,
	Vector                                   = 2,
	Vector4                                  = 3,
	String                                   = 4,
	Unknown                                  = 5,
	EPCGPointFilterConstantType_MAX          = 6,
};

// Enum PCG.EPCGPointFilterOperator
// NumValues: 0x000A
enum class EPCGPointFilterOperator : uint8
{
	Greater                                  = 0,
	GreaterOrEqual                           = 1,
	Lesser                                   = 2,
	LesserOrEqual                            = 3,
	Equal                                    = 4,
	NotEqual                                 = 5,
	InRange                                  = 6,
	Substring                                = 7,
	Matches                                  = 8,
	EPCGPointFilterOperator_MAX              = 9,
};

// Enum PCG.EPCGUnitTestDummyEnum
// NumValues: 0x0004
enum class EPCGUnitTestDummyEnum : uint64
{
	One                                      = 0,
	Two                                      = 1,
	Three                                    = 2,
	EPCGUnitTestDummyEnum_MAX                = 3,
};

// Enum PCG.EPCGSelfPruningType
// NumValues: 0x0006
enum class EPCGSelfPruningType : uint8
{
	LargeToSmall                             = 0,
	SmallToLarge                             = 1,
	AllEqual                                 = 2,
	None                                     = 3,
	RemoveDuplicates                         = 4,
	EPCGSelfPruningType_MAX                  = 5,
};

// Enum PCG.EPCGSettingsExecutionMode
// NumValues: 0x0005
enum class EPCGSettingsExecutionMode : uint8
{
	Enabled                                  = 0,
	Debug                                    = 1,
	Isolated                                 = 2,
	Disabled                                 = 3,
	EPCGSettingsExecutionMode_MAX            = 4,
};

// Enum PCG.EPCGSettingsType
// NumValues: 0x000F
enum class EPCGSettingsType : uint8
{
	InputOutput                              = 0,
	Spatial                                  = 1,
	Density                                  = 2,
	Blueprint                                = 3,
	Metadata                                 = 4,
	Filter                                   = 5,
	Sampler                                  = 6,
	Spawner                                  = 7,
	Subgraph                                 = 8,
	Debug                                    = 9,
	Generic                                  = 10,
	Param                                    = 11,
	HierarchicalGeneration                   = 12,
	ControlFlow                              = 13,
	EPCGSettingsType_MAX                     = 14,
};

// Enum PCG.PCGSpatialNoiseMode
// NumValues: 0x0006
enum class EPCGSpatialNoiseMode : uint32
{
	Perlin2D                                 = 0,
	Caustic2D                                = 1,
	Voronoi2D                                = 2,
	FractionalBrownian2D                     = 3,
	EdgeMask2D                               = 4,
	PCGSpatialNoiseMode_MAX                  = 5,
};

// Enum PCG.PCGSpatialNoiseMask2DMode
// NumValues: 0x0004
enum class EPCGSpatialNoiseMask2DMode : uint32
{
	Perlin                                   = 0,
	Caustic                                  = 1,
	FractionalBrownian                       = 2,
	PCGSpatialNoiseMask2DMode_MAX            = 3,
};

// Enum PCG.EPCGSpawnActorOption
// NumValues: 0x0004
enum class EPCGSpawnActorOption : uint8
{
	CollapseActors                           = 0,
	MergePCGOnly                             = 1,
	NoMerging                                = 2,
	EPCGSpawnActorOption_MAX                 = 3,
};

// Enum PCG.EPCGSpawnActorGenerationTrigger
// NumValues: 0x0005
enum class EPCGSpawnActorGenerationTrigger : uint8
{
	Default                                  = 0,
	ForceGenerate                            = 1,
	DoNotGenerateInEditor                    = 2,
	DoNotGenerate                            = 3,
	EPCGSpawnActorGenerationTrigger_MAX      = 4,
};

// Enum PCG.EPCGSplineSamplingMode
// NumValues: 0x0003
enum class EPCGSplineSamplingMode : uint8
{
	Subdivision                              = 0,
	Distance                                 = 1,
	EPCGSplineSamplingMode_MAX               = 2,
};

// Enum PCG.EPCGSplineSamplingDimension
// NumValues: 0x0006
enum class EPCGSplineSamplingDimension : uint8
{
	OnSpline                                 = 0,
	OnHorizontal                             = 1,
	OnVertical                               = 2,
	OnVolume                                 = 3,
	OnInterior                               = 4,
	EPCGSplineSamplingDimension_MAX          = 5,
};

// Enum PCG.EPCGSplineSamplingFill
// NumValues: 0x0003
enum class EPCGSplineSamplingFill : uint8
{
	Fill                                     = 0,
	EdgesOnly                                = 1,
	EPCGSplineSamplingFill_MAX               = 2,
};

// Enum PCG.EPCGSplineSamplingInteriorOrientation
// NumValues: 0x0003
enum class EPCGSplineSamplingInteriorOrientation : uint8
{
	Uniform                                  = 0,
	FollowCurvature                          = 1,
	EPCGSplineSamplingInteriorOrientation_MAX = 2,
};

// Enum PCG.EPCGTextureColorChannel
// NumValues: 0x0005
enum class EPCGTextureColorChannel : uint8
{
	Red                                      = 0,
	Green                                    = 1,
	Blue                                     = 2,
	Alpha                                    = 3,
	EPCGTextureColorChannel_MAX              = 4,
};

// Enum PCG.EPCGTextureDensityFunction
// NumValues: 0x0003
enum class EPCGTextureDensityFunction : uint8
{
	Ignore                                   = 0,
	Multiply                                 = 1,
	EPCGTextureDensityFunction_MAX           = 2,
};

// Enum PCG.EPCGUnionType
// NumValues: 0x0004
enum class EPCGUnionType : uint8
{
	LeftToRightPriority                      = 0,
	RightToLeftPriority                      = 1,
	KeepAll                                  = 2,
	EPCGUnionType_MAX                        = 3,
};

// Enum PCG.EPCGUnionDensityFunction
// NumValues: 0x0004
enum class EPCGUnionDensityFunction : uint8
{
	Maximum                                  = 0,
	ClampedAddition                          = 1,
	Binary                                   = 2,
	EPCGUnionDensityFunction_MAX             = 3,
};

// Enum PCG.EPCGWorldQueryFilterByTag
// NumValues: 0x0004
enum class EPCGWorldQueryFilterByTag : uint32
{
	NoTagFilter                              = 0,
	IncludeTagged                            = 1,
	ExcludeTagged                            = 2,
	EPCGWorldQueryFilterByTag_MAX            = 3,
};

// Enum PCG.EPropertyBagPropertyType
// NumValues: 0x0012
enum class EPropertyBagPropertyType : uint8
{
	None                                     = 0,
	Bool                                     = 1,
	Byte                                     = 2,
	Int32                                    = 3,
	Int64                                    = 4,
	Float                                    = 5,
	Double                                   = 6,
	Name                                     = 7,
	String                                   = 8,
	Text                                     = 9,
	Enum                                     = 10,
	Struct                                   = 11,
	Object                                   = 12,
	SoftObject                               = 13,
	Class                                    = 14,
	SoftClass                                = 15,
	Count                                    = 16,
	EPropertyBagPropertyType_MAX             = 17,
};

// Enum PCG.EPropertyBagContainerType
// NumValues: 0x0004
enum class EPropertyBagContainerType : uint8
{
	None                                     = 0,
	Array                                    = 1,
	Count                                    = 2,
	EPropertyBagContainerType_MAX            = 3,
};

// Enum PCG.EPropertyBagResult
// NumValues: 0x0005
enum class EPropertyBagResult : uint8
{
	Success                                  = 0,
	TypeMismatch                             = 1,
	OutOfBounds                              = 2,
	PropertyNotFound                         = 3,
	EPropertyBagResult_MAX                   = 4,
};

// Enum PCG.EPropertyBagMissingEnum
// NumValues: 0x0002
enum class EPropertyBagMissingEnum : uint8
{
	Missing                                  = 0,
	EPropertyBagMissingEnum_MAX              = 1,
};

// ScriptStruct PCG.PCGActorSelectorSettings
// 0x0020 (0x0020 - 0x0000)
struct FPCGActorSelectorSettings final
{
public:
	EPCGActorFilter                               ActorFilter;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMustOverlapSelf;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeChildren;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableFilter;                                    // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGActorSelection                            ActorSelection;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActorSelectionTag;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                     ActorSelectionClass;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectMultiple;                                   // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreSelfAndChildren;                            // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActorFilter;                                  // 0x001A(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowIncludeChildren;                              // 0x001B(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActorSelection;                               // 0x001C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowActorSelectionClass;                          // 0x001D(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowSelectMultiple;                               // 0x001E(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGActorSelectorSettings) == 0x000008, "Wrong alignment on FPCGActorSelectorSettings");
static_assert(sizeof(FPCGActorSelectorSettings) == 0x000020, "Wrong size on FPCGActorSelectorSettings");
static_assert(offsetof(FPCGActorSelectorSettings, ActorFilter) == 0x000000, "Member 'FPCGActorSelectorSettings::ActorFilter' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bMustOverlapSelf) == 0x000001, "Member 'FPCGActorSelectorSettings::bMustOverlapSelf' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bIncludeChildren) == 0x000002, "Member 'FPCGActorSelectorSettings::bIncludeChildren' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bDisableFilter) == 0x000003, "Member 'FPCGActorSelectorSettings::bDisableFilter' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, ActorSelection) == 0x000004, "Member 'FPCGActorSelectorSettings::ActorSelection' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, ActorSelectionTag) == 0x000008, "Member 'FPCGActorSelectorSettings::ActorSelectionTag' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, ActorSelectionClass) == 0x000010, "Member 'FPCGActorSelectorSettings::ActorSelectionClass' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bSelectMultiple) == 0x000018, "Member 'FPCGActorSelectorSettings::bSelectMultiple' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bIgnoreSelfAndChildren) == 0x000019, "Member 'FPCGActorSelectorSettings::bIgnoreSelfAndChildren' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bShowActorFilter) == 0x00001A, "Member 'FPCGActorSelectorSettings::bShowActorFilter' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bShowIncludeChildren) == 0x00001B, "Member 'FPCGActorSelectorSettings::bShowIncludeChildren' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bShowActorSelection) == 0x00001C, "Member 'FPCGActorSelectorSettings::bShowActorSelection' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bShowActorSelectionClass) == 0x00001D, "Member 'FPCGActorSelectorSettings::bShowActorSelectionClass' has a wrong offset!");
static_assert(offsetof(FPCGActorSelectorSettings, bShowSelectMultiple) == 0x00001E, "Member 'FPCGActorSelectorSettings::bShowSelectMultiple' has a wrong offset!");

// ScriptStruct PCG.PCGAttributeExtractorTestStructDepth2
// 0x0004 (0x0004 - 0x0000)
struct FPCGAttributeExtractorTestStructDepth2 final
{
public:
	int32                                         IntValue;                                          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGAttributeExtractorTestStructDepth2) == 0x000004, "Wrong alignment on FPCGAttributeExtractorTestStructDepth2");
static_assert(sizeof(FPCGAttributeExtractorTestStructDepth2) == 0x000004, "Wrong size on FPCGAttributeExtractorTestStructDepth2");
static_assert(offsetof(FPCGAttributeExtractorTestStructDepth2, IntValue) == 0x000000, "Member 'FPCGAttributeExtractorTestStructDepth2::IntValue' has a wrong offset!");

// ScriptStruct PCG.PCGAttributeExtractorTestStructDepth1
// 0x0008 (0x0008 - 0x0000)
struct FPCGAttributeExtractorTestStructDepth1 final
{
public:
	struct FPCGAttributeExtractorTestStructDepth2 Depth2Struct;                                      // 0x0000(0x0004)(NoDestructor, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGAttributeExtractorTestStructDepth1) == 0x000004, "Wrong alignment on FPCGAttributeExtractorTestStructDepth1");
static_assert(sizeof(FPCGAttributeExtractorTestStructDepth1) == 0x000008, "Wrong size on FPCGAttributeExtractorTestStructDepth1");
static_assert(offsetof(FPCGAttributeExtractorTestStructDepth1, Depth2Struct) == 0x000000, "Member 'FPCGAttributeExtractorTestStructDepth1::Depth2Struct' has a wrong offset!");
static_assert(offsetof(FPCGAttributeExtractorTestStructDepth1, FloatValue) == 0x000004, "Member 'FPCGAttributeExtractorTestStructDepth1::FloatValue' has a wrong offset!");

// ScriptStruct PCG.PCGAttributeExtractorTestStruct
// 0x0010 (0x0010 - 0x0000)
struct FPCGAttributeExtractorTestStruct final
{
public:
	struct FPCGAttributeExtractorTestStructDepth1 DepthStruct;                                       // 0x0000(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	class UPCGAttributeExtractorTestObject*       Object;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGAttributeExtractorTestStruct) == 0x000008, "Wrong alignment on FPCGAttributeExtractorTestStruct");
static_assert(sizeof(FPCGAttributeExtractorTestStruct) == 0x000010, "Wrong size on FPCGAttributeExtractorTestStruct");
static_assert(offsetof(FPCGAttributeExtractorTestStruct, DepthStruct) == 0x000000, "Member 'FPCGAttributeExtractorTestStruct::DepthStruct' has a wrong offset!");
static_assert(offsetof(FPCGAttributeExtractorTestStruct, Object) == 0x000008, "Member 'FPCGAttributeExtractorTestStruct::Object' has a wrong offset!");

// ScriptStruct PCG.PCGAttributePropertySelector
// 0x0028 (0x0028 - 0x0000)
struct FPCGAttributePropertySelector
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EPCGAttributePropertySelection                Selection;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   AttributeName;                                     // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPCGPointProperties                           PointProperty;                                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EPCGExtraProperties                           ExtraProperty;                                     // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ExtraNames;                                        // 0x0018(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FPCGAttributePropertySelector) == 0x000008, "Wrong alignment on FPCGAttributePropertySelector");
static_assert(sizeof(FPCGAttributePropertySelector) == 0x000028, "Wrong size on FPCGAttributePropertySelector");
static_assert(offsetof(FPCGAttributePropertySelector, Selection) == 0x000008, "Member 'FPCGAttributePropertySelector::Selection' has a wrong offset!");
static_assert(offsetof(FPCGAttributePropertySelector, AttributeName) == 0x00000C, "Member 'FPCGAttributePropertySelector::AttributeName' has a wrong offset!");
static_assert(offsetof(FPCGAttributePropertySelector, PointProperty) == 0x000014, "Member 'FPCGAttributePropertySelector::PointProperty' has a wrong offset!");
static_assert(offsetof(FPCGAttributePropertySelector, ExtraProperty) == 0x000015, "Member 'FPCGAttributePropertySelector::ExtraProperty' has a wrong offset!");
static_assert(offsetof(FPCGAttributePropertySelector, ExtraNames) == 0x000018, "Member 'FPCGAttributePropertySelector::ExtraNames' has a wrong offset!");

// ScriptStruct PCG.PCGAttributePropertyInputSelector
// 0x0000 (0x0028 - 0x0028)
struct FPCGAttributePropertyInputSelector final : public FPCGAttributePropertySelector
{
};
static_assert(alignof(FPCGAttributePropertyInputSelector) == 0x000008, "Wrong alignment on FPCGAttributePropertyInputSelector");
static_assert(sizeof(FPCGAttributePropertyInputSelector) == 0x000028, "Wrong size on FPCGAttributePropertyInputSelector");

// ScriptStruct PCG.PCGAttributePropertyOutputSelector
// 0x0000 (0x0028 - 0x0028)
struct FPCGAttributePropertyOutputSelector final : public FPCGAttributePropertySelector
{
};
static_assert(alignof(FPCGAttributePropertyOutputSelector) == 0x000008, "Wrong alignment on FPCGAttributePropertyOutputSelector");
static_assert(sizeof(FPCGAttributePropertyOutputSelector) == 0x000028, "Wrong size on FPCGAttributePropertyOutputSelector");

// ScriptStruct PCG.PCGAttributePropertyOutputNoSourceSelector
// 0x0000 (0x0028 - 0x0028)
struct FPCGAttributePropertyOutputNoSourceSelector final : public FPCGAttributePropertySelector
{
};
static_assert(alignof(FPCGAttributePropertyOutputNoSourceSelector) == 0x000008, "Wrong alignment on FPCGAttributePropertyOutputNoSourceSelector");
static_assert(sizeof(FPCGAttributePropertyOutputNoSourceSelector) == 0x000028, "Wrong size on FPCGAttributePropertyOutputNoSourceSelector");

// ScriptStruct PCG.PCGComponentInstanceData
// 0x0018 (0x0080 - 0x0068)
struct FPCGComponentInstanceData final : public FActorComponentInstanceData
{
public:
	TArray<class UPCGManagedResource*>            GeneratedResources;                                // 0x0068(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UPCGComponent*                          SourceComponent;                                   // 0x0078(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
};
static_assert(alignof(FPCGComponentInstanceData) == 0x000008, "Wrong alignment on FPCGComponentInstanceData");
static_assert(sizeof(FPCGComponentInstanceData) == 0x000080, "Wrong size on FPCGComponentInstanceData");
static_assert(offsetof(FPCGComponentInstanceData, GeneratedResources) == 0x000068, "Member 'FPCGComponentInstanceData::GeneratedResources' has a wrong offset!");
static_assert(offsetof(FPCGComponentInstanceData, SourceComponent) == 0x000078, "Member 'FPCGComponentInstanceData::SourceComponent' has a wrong offset!");

// ScriptStruct PCG.PCGContext
// 0x00B8 (0x00B8 - 0x0000)
struct alignas(0x08) FPCGContext
{
public:
	uint8                                         Pad_0[0xB8];                                       // 0x0000(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGContext) == 0x000008, "Wrong alignment on FPCGContext");
static_assert(sizeof(FPCGContext) == 0x0000B8, "Wrong size on FPCGContext");

// ScriptStruct PCG.PCGCrc
// 0x0008 (0x0008 - 0x0000)
struct FPCGCrc final
{
public:
	uint32                                        Value;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bValid;                                            // 0x0004(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGCrc) == 0x000004, "Wrong alignment on FPCGCrc");
static_assert(sizeof(FPCGCrc) == 0x000008, "Wrong size on FPCGCrc");
static_assert(offsetof(FPCGCrc, Value) == 0x000000, "Member 'FPCGCrc::Value' has a wrong offset!");
static_assert(offsetof(FPCGCrc, bValid) == 0x000004, "Member 'FPCGCrc::bValid' has a wrong offset!");

// ScriptStruct PCG.PCGTaggedData
// 0x0068 (0x0068 - 0x0000)
struct FPCGTaggedData final
{
public:
	class UPCGData*                               Data;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           Tags;                                              // 0x0008(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   Pin;                                               // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPinlessData;                                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGTaggedData) == 0x000008, "Wrong alignment on FPCGTaggedData");
static_assert(sizeof(FPCGTaggedData) == 0x000068, "Wrong size on FPCGTaggedData");
static_assert(offsetof(FPCGTaggedData, Data) == 0x000000, "Member 'FPCGTaggedData::Data' has a wrong offset!");
static_assert(offsetof(FPCGTaggedData, Tags) == 0x000008, "Member 'FPCGTaggedData::Tags' has a wrong offset!");
static_assert(offsetof(FPCGTaggedData, Pin) == 0x000058, "Member 'FPCGTaggedData::Pin' has a wrong offset!");
static_assert(offsetof(FPCGTaggedData, bPinlessData) == 0x000060, "Member 'FPCGTaggedData::bPinlessData' has a wrong offset!");

// ScriptStruct PCG.PCGDataCollection
// 0x0020 (0x0020 - 0x0000)
struct FPCGDataCollection final
{
public:
	TArray<struct FPCGTaggedData>                 TaggedData;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bCancelExecutionOnEmpty;                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGDataCollection) == 0x000008, "Wrong alignment on FPCGDataCollection");
static_assert(sizeof(FPCGDataCollection) == 0x000020, "Wrong size on FPCGDataCollection");
static_assert(offsetof(FPCGDataCollection, TaggedData) == 0x000000, "Member 'FPCGDataCollection::TaggedData' has a wrong offset!");
static_assert(offsetof(FPCGDataCollection, bCancelExecutionOnEmpty) == 0x000010, "Member 'FPCGDataCollection::bCancelExecutionOnEmpty' has a wrong offset!");

// ScriptStruct PCG.PCGDataTableRowToParamDataTestStruct
// 0x00A0 (0x00A0 - 0x0000)
struct FPCGDataTableRowToParamDataTestStruct final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         I32;                                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         I64;                                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         F32;                                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        F64;                                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              V2;                                                // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                V3;                                                // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               V4;                                                // 0x0060(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                        SoftPath;                                          // 0x0080(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGDataTableRowToParamDataTestStruct) == 0x000010, "Wrong alignment on FPCGDataTableRowToParamDataTestStruct");
static_assert(sizeof(FPCGDataTableRowToParamDataTestStruct) == 0x0000A0, "Wrong size on FPCGDataTableRowToParamDataTestStruct");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, Name) == 0x000000, "Member 'FPCGDataTableRowToParamDataTestStruct::Name' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, String) == 0x000008, "Member 'FPCGDataTableRowToParamDataTestStruct::String' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, I32) == 0x000018, "Member 'FPCGDataTableRowToParamDataTestStruct::I32' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, I64) == 0x000020, "Member 'FPCGDataTableRowToParamDataTestStruct::I64' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, F32) == 0x000028, "Member 'FPCGDataTableRowToParamDataTestStruct::F32' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, F64) == 0x000030, "Member 'FPCGDataTableRowToParamDataTestStruct::F64' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, V2) == 0x000038, "Member 'FPCGDataTableRowToParamDataTestStruct::V2' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, V3) == 0x000048, "Member 'FPCGDataTableRowToParamDataTestStruct::V3' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, V4) == 0x000060, "Member 'FPCGDataTableRowToParamDataTestStruct::V4' has a wrong offset!");
static_assert(offsetof(FPCGDataTableRowToParamDataTestStruct, SoftPath) == 0x000080, "Member 'FPCGDataTableRowToParamDataTestStruct::SoftPath' has a wrong offset!");

// ScriptStruct PCG.PCGDebugVisualizationSettings
// 0x0060 (0x0060 - 0x0000)
struct FPCGDebugVisualizationSettings final
{
public:
	float                                         PointScale;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGDebugVisScaleMethod                       ScaleMethod;                                       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             PointMesh;                                         // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMaterialInterface>      MaterialOverride;                                  // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCheckForDuplicates;                               // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FPCGDebugVisualizationSettings) == 0x000008, "Wrong alignment on FPCGDebugVisualizationSettings");
static_assert(sizeof(FPCGDebugVisualizationSettings) == 0x000060, "Wrong size on FPCGDebugVisualizationSettings");
static_assert(offsetof(FPCGDebugVisualizationSettings, PointScale) == 0x000000, "Member 'FPCGDebugVisualizationSettings::PointScale' has a wrong offset!");
static_assert(offsetof(FPCGDebugVisualizationSettings, ScaleMethod) == 0x000004, "Member 'FPCGDebugVisualizationSettings::ScaleMethod' has a wrong offset!");
static_assert(offsetof(FPCGDebugVisualizationSettings, PointMesh) == 0x000008, "Member 'FPCGDebugVisualizationSettings::PointMesh' has a wrong offset!");
static_assert(offsetof(FPCGDebugVisualizationSettings, MaterialOverride) == 0x000030, "Member 'FPCGDebugVisualizationSettings::MaterialOverride' has a wrong offset!");
static_assert(offsetof(FPCGDebugVisualizationSettings, bCheckForDuplicates) == 0x000058, "Member 'FPCGDebugVisualizationSettings::bCheckForDuplicates' has a wrong offset!");

// ScriptStruct PCG.PCGDeterminismSettings
// 0x0010 (0x0010 - 0x0000)
struct FPCGDeterminismSettings final
{
public:
	bool                                          bNativeTests;                                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBlueprintDeterminismTest;                      // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UPCGDeterminismTestBlueprintBase> DeterminismTestBlueprint;                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPCGDeterminismSettings) == 0x000008, "Wrong alignment on FPCGDeterminismSettings");
