#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PCG_structs.hpp"
#include "StructUtils_structs.hpp"


namespace SDK
{

// Class PCG.PCGActorHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGActorHelpers final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGActorHelpers">();
	}
	static class UPCGActorHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGActorHelpers>();
	}
};
static_assert(alignof(UPCGActorHelpers) == 0x000008, "Wrong alignment on UPCGActorHelpers");
static_assert(sizeof(UPCGActorHelpers) == 0x000028, "Wrong size on UPCGActorHelpers");

// Class PCG.PCGAttributeExtractorTestObject
// 0x0008 (0x0030 - 0x0028)
class UPCGAttributeExtractorTestObject final : public UObject
{
public:
	double                                        DoubleValue;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeExtractorTestObject">();
	}
	static class UPCGAttributeExtractorTestObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeExtractorTestObject>();
	}
};
static_assert(alignof(UPCGAttributeExtractorTestObject) == 0x000008, "Wrong alignment on UPCGAttributeExtractorTestObject");
static_assert(sizeof(UPCGAttributeExtractorTestObject) == 0x000030, "Wrong size on UPCGAttributeExtractorTestObject");
static_assert(offsetof(UPCGAttributeExtractorTestObject, DoubleValue) == 0x000028, "Member 'UPCGAttributeExtractorTestObject::DoubleValue' has a wrong offset!");

// Class PCG.PCGData
// 0x0010 (0x0038 - 0x0028)
class UPCGData : public UObject
{
public:
	uint64                                        UID;                                               // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGData">();
	}
	static class UPCGData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGData>();
	}
};
static_assert(alignof(UPCGData) == 0x000008, "Wrong alignment on UPCGData");
static_assert(sizeof(UPCGData) == 0x000038, "Wrong size on UPCGData");
static_assert(offsetof(UPCGData, UID) == 0x000028, "Member 'UPCGData::UID' has a wrong offset!");

// Class PCG.PCGSettingsInterface
// 0x0008 (0x0040 - 0x0038)
class UPCGSettingsInterface : public UPCGData
{
public:
	bool                                          bEnabled;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDebug;                                            // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettingsInterface">();
	}
	static class UPCGSettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettingsInterface>();
	}
};
static_assert(alignof(UPCGSettingsInterface) == 0x000008, "Wrong alignment on UPCGSettingsInterface");
static_assert(sizeof(UPCGSettingsInterface) == 0x000040, "Wrong size on UPCGSettingsInterface");
static_assert(offsetof(UPCGSettingsInterface, bEnabled) == 0x000038, "Member 'UPCGSettingsInterface::bEnabled' has a wrong offset!");
static_assert(offsetof(UPCGSettingsInterface, bDebug) == 0x000039, "Member 'UPCGSettingsInterface::bDebug' has a wrong offset!");

// Class PCG.PCGSettings
// 0x0110 (0x0150 - 0x0040)
class UPCGSettings : public UPCGSettingsInterface
{
public:
	int32                                         Seed;                                              // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           FilterOnTags;                                      // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bPassThroughFilteredOutInputs;                     // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           TagsAppliedOnOutput;                               // 0x00A0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x8];                                       // 0x00F0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bUseSeed;                                          // 0x00F8(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F9[0x3F];                                      // 0x00F9(0x003F)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPCGSettingsOverridableParam>   CachedOverridableParams;                           // 0x0138(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_148[0x8];                                      // 0x0148(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSettings">();
	}
	static class UPCGSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSettings>();
	}
};
static_assert(alignof(UPCGSettings) == 0x000008, "Wrong alignment on UPCGSettings");
static_assert(sizeof(UPCGSettings) == 0x000150, "Wrong size on UPCGSettings");
static_assert(offsetof(UPCGSettings, Seed) == 0x000040, "Member 'UPCGSettings::Seed' has a wrong offset!");
static_assert(offsetof(UPCGSettings, FilterOnTags) == 0x000048, "Member 'UPCGSettings::FilterOnTags' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bPassThroughFilteredOutInputs) == 0x000098, "Member 'UPCGSettings::bPassThroughFilteredOutInputs' has a wrong offset!");
static_assert(offsetof(UPCGSettings, TagsAppliedOnOutput) == 0x0000A0, "Member 'UPCGSettings::TagsAppliedOnOutput' has a wrong offset!");
static_assert(offsetof(UPCGSettings, bUseSeed) == 0x0000F8, "Member 'UPCGSettings::bUseSeed' has a wrong offset!");
static_assert(offsetof(UPCGSettings, CachedOverridableParams) == 0x000138, "Member 'UPCGSettings::CachedOverridableParams' has a wrong offset!");

// Class PCG.PCGAttributeFilterSettings
// 0x0018 (0x0168 - 0x0150)
class UPCGAttributeFilterSettings final : public UPCGSettings
{
public:
	EPCGAttributeFilterOperation                  Operation;                                         // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedAttributes;                                // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeFilterSettings">();
	}
	static class UPCGAttributeFilterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeFilterSettings>();
	}
};
static_assert(alignof(UPCGAttributeFilterSettings) == 0x000008, "Wrong alignment on UPCGAttributeFilterSettings");
static_assert(sizeof(UPCGAttributeFilterSettings) == 0x000168, "Wrong size on UPCGAttributeFilterSettings");
static_assert(offsetof(UPCGAttributeFilterSettings, Operation) == 0x000150, "Member 'UPCGAttributeFilterSettings::Operation' has a wrong offset!");
static_assert(offsetof(UPCGAttributeFilterSettings, SelectedAttributes) == 0x000158, "Member 'UPCGAttributeFilterSettings::SelectedAttributes' has a wrong offset!");

// Class PCG.PCGAttributeGetFromPointIndexSettings
// 0x0038 (0x0188 - 0x0150)
class UPCGAttributeGetFromPointIndexSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutputAttributeName;                               // 0x017C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeGetFromPointIndexSettings">();
	}
	static class UPCGAttributeGetFromPointIndexSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeGetFromPointIndexSettings>();
	}
};
static_assert(alignof(UPCGAttributeGetFromPointIndexSettings) == 0x000008, "Wrong alignment on UPCGAttributeGetFromPointIndexSettings");
static_assert(sizeof(UPCGAttributeGetFromPointIndexSettings) == 0x000188, "Wrong size on UPCGAttributeGetFromPointIndexSettings");
static_assert(offsetof(UPCGAttributeGetFromPointIndexSettings, InputSource) == 0x000150, "Member 'UPCGAttributeGetFromPointIndexSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeGetFromPointIndexSettings, Index_0) == 0x000178, "Member 'UPCGAttributeGetFromPointIndexSettings::Index_0' has a wrong offset!");
static_assert(offsetof(UPCGAttributeGetFromPointIndexSettings, OutputAttributeName) == 0x00017C, "Member 'UPCGAttributeGetFromPointIndexSettings::OutputAttributeName' has a wrong offset!");

// Class PCG.PCGAttributeNoiseSettings
// 0x0060 (0x01B0 - 0x0150)
class UPCGAttributeNoiseSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x0178(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EPCGAttributeNoiseMode                        Mode;                                              // 0x01A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NoiseMin;                                          // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseMax;                                          // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvertSource;                                     // 0x01AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClampResult;                                      // 0x01AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeNoiseSettings">();
	}
	static class UPCGAttributeNoiseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeNoiseSettings>();
	}
};
static_assert(alignof(UPCGAttributeNoiseSettings) == 0x000008, "Wrong alignment on UPCGAttributeNoiseSettings");
static_assert(sizeof(UPCGAttributeNoiseSettings) == 0x0001B0, "Wrong size on UPCGAttributeNoiseSettings");
static_assert(offsetof(UPCGAttributeNoiseSettings, InputSource) == 0x000150, "Member 'UPCGAttributeNoiseSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, OutputTarget) == 0x000178, "Member 'UPCGAttributeNoiseSettings::OutputTarget' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, Mode) == 0x0001A0, "Member 'UPCGAttributeNoiseSettings::Mode' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, NoiseMin) == 0x0001A4, "Member 'UPCGAttributeNoiseSettings::NoiseMin' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, NoiseMax) == 0x0001A8, "Member 'UPCGAttributeNoiseSettings::NoiseMax' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, bInvertSource) == 0x0001AC, "Member 'UPCGAttributeNoiseSettings::bInvertSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeNoiseSettings, bClampResult) == 0x0001AD, "Member 'UPCGAttributeNoiseSettings::bClampResult' has a wrong offset!");

// Class PCG.PCGAttributePropertySelectorBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGAttributePropertySelectorBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static struct FPCGAttributePropertyInputSelector CopyAndFixLast(const struct FPCGAttributePropertyInputSelector& Selector, const class UPCGData* InData);
	static struct FPCGAttributePropertyOutputSelector CopyAndFixSource(const struct FPCGAttributePropertyOutputSelector& Selector, const struct FPCGAttributePropertyInputSelector& InSelector);
	static class FName GetAttributeName(const struct FPCGAttributePropertySelector& Selector);
	static const TArray<class FString> GetExtraNames(const struct FPCGAttributePropertySelector& Selector);
	static EPCGExtraProperties GetExtraProperty(const struct FPCGAttributePropertySelector& Selector);
	static class FName GetName(const struct FPCGAttributePropertySelector& Selector);
	static EPCGPointProperties GetPointProperty(const struct FPCGAttributePropertySelector& Selector);
	static EPCGAttributePropertySelection GetSelection(const struct FPCGAttributePropertySelector& Selector);
	static bool SetAttributeName(struct FPCGAttributePropertySelector& Selector, class FName InAttributeName);
	static bool SetExtraProperty(struct FPCGAttributePropertySelector& Selector, EPCGExtraProperties InExtraProperty);
	static bool SetPointProperty(struct FPCGAttributePropertySelector& Selector, EPCGPointProperties InPointProperty);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributePropertySelectorBlueprintHelpers">();
	}
	static class UPCGAttributePropertySelectorBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributePropertySelectorBlueprintHelpers>();
	}
};
static_assert(alignof(UPCGAttributePropertySelectorBlueprintHelpers) == 0x000008, "Wrong alignment on UPCGAttributePropertySelectorBlueprintHelpers");
static_assert(sizeof(UPCGAttributePropertySelectorBlueprintHelpers) == 0x000028, "Wrong size on UPCGAttributePropertySelectorBlueprintHelpers");

// Class PCG.PCGAttributeReduceSettings
// 0x0038 (0x0188 - 0x0150)
class UPCGAttributeReduceSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   OutputAttributeName;                               // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttributeReduceOperation                  Operation;                                         // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeReduceSettings">();
	}
	static class UPCGAttributeReduceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeReduceSettings>();
	}
};
static_assert(alignof(UPCGAttributeReduceSettings) == 0x000008, "Wrong alignment on UPCGAttributeReduceSettings");
static_assert(sizeof(UPCGAttributeReduceSettings) == 0x000188, "Wrong size on UPCGAttributeReduceSettings");
static_assert(offsetof(UPCGAttributeReduceSettings, InputSource) == 0x000150, "Member 'UPCGAttributeReduceSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeReduceSettings, OutputAttributeName) == 0x000178, "Member 'UPCGAttributeReduceSettings::OutputAttributeName' has a wrong offset!");
static_assert(offsetof(UPCGAttributeReduceSettings, Operation) == 0x000180, "Member 'UPCGAttributeReduceSettings::Operation' has a wrong offset!");

// Class PCG.PCGAttributeSelectSettings
// 0x0060 (0x01B0 - 0x0150)
class UPCGAttributeSelectSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                   OutputAttributeName;                               // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttributeSelectOperation                  Operation;                                         // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttributeSelectAxis                       Axis;                                              // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_188[0x8];                                      // 0x0188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CustomAxis;                                        // 0x0190(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeSelectSettings">();
	}
	static class UPCGAttributeSelectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeSelectSettings>();
	}
};
static_assert(alignof(UPCGAttributeSelectSettings) == 0x000010, "Wrong alignment on UPCGAttributeSelectSettings");
static_assert(sizeof(UPCGAttributeSelectSettings) == 0x0001B0, "Wrong size on UPCGAttributeSelectSettings");
static_assert(offsetof(UPCGAttributeSelectSettings, InputSource) == 0x000150, "Member 'UPCGAttributeSelectSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGAttributeSelectSettings, OutputAttributeName) == 0x000178, "Member 'UPCGAttributeSelectSettings::OutputAttributeName' has a wrong offset!");
static_assert(offsetof(UPCGAttributeSelectSettings, Operation) == 0x000180, "Member 'UPCGAttributeSelectSettings::Operation' has a wrong offset!");
static_assert(offsetof(UPCGAttributeSelectSettings, Axis) == 0x000184, "Member 'UPCGAttributeSelectSettings::Axis' has a wrong offset!");
static_assert(offsetof(UPCGAttributeSelectSettings, CustomAxis) == 0x000190, "Member 'UPCGAttributeSelectSettings::CustomAxis' has a wrong offset!");

// Class PCG.PCGAttributeTransferSettings
// 0x0050 (0x01A0 - 0x0150)
class UPCGAttributeTransferSettings final : public UPCGSettings
{
public:
	struct FPCGAttributePropertyInputSelector     SourceAttributeProperty;                           // 0x0150(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGAttributePropertyOutputSelector    TargetAttributeProperty;                           // 0x0178(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAttributeTransferSettings">();
	}
	static class UPCGAttributeTransferSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAttributeTransferSettings>();
	}
};
static_assert(alignof(UPCGAttributeTransferSettings) == 0x000008, "Wrong alignment on UPCGAttributeTransferSettings");
static_assert(sizeof(UPCGAttributeTransferSettings) == 0x0001A0, "Wrong size on UPCGAttributeTransferSettings");
static_assert(offsetof(UPCGAttributeTransferSettings, SourceAttributeProperty) == 0x000150, "Member 'UPCGAttributeTransferSettings::SourceAttributeProperty' has a wrong offset!");
static_assert(offsetof(UPCGAttributeTransferSettings, TargetAttributeProperty) == 0x000178, "Member 'UPCGAttributeTransferSettings::TargetAttributeProperty' has a wrong offset!");

// Class PCG.PCGBlueprintHelpers
// 0x0000 (0x0028 - 0x0028)
class UPCGBlueprintHelpers final : public UBlueprintFunctionLibrary
{
public:
	static int32 ComputeSeedFromPosition(const struct FVector& InPosition);
	static class UPCGData* CreatePCGDataFromActor(class AActor* InActor, bool bParseActor);
	static struct FBox GetActorBoundsPCG(class AActor* InActor, bool bIgnorePCGCreatedComponents);
	static class UPCGData* GetActorData(struct FPCGContext& Context);
	static struct FBox GetActorLocalBoundsPCG(class AActor* InActor, bool bIgnorePCGCreatedComponents);
	static class UPCGComponent* GetComponent(struct FPCGContext& Context);
	static struct FVector GetExtents(const struct FPCGPoint& InPoint);
	static class UPCGData* GetInputData(struct FPCGContext& Context);
	static struct FVector GetLocalCenter(const struct FPCGPoint& InPoint);
	static class UPCGComponent* GetOriginalComponent(struct FPCGContext& Context);
	static struct FRandomStream GetRandomStream(const struct FPCGPoint& InPoint, const class UPCGSettings* OptionalSettings, const class UPCGComponent* OptionalComponent);
	static const class UPCGSettings* GetSettings(struct FPCGContext& Context);
	static class AActor* GetTargetActor(struct FPCGContext& Context, class UPCGSpatialData* SpatialData);
	static int64 GetTaskId(struct FPCGContext& Context);
	static struct FBox GetTransformedBounds(const struct FPCGPoint& InPoint);
	static void SetExtents(struct FPCGPoint& InPoint, const struct FVector& InExtents);
	static void SetLocalCenter(struct FPCGPoint& InPoint, const struct FVector& InLocalCenter);
	static void SetSeedFromPosition(struct FPCGPoint& InPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBlueprintHelpers">();
	}
	static class UPCGBlueprintHelpers* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBlueprintHelpers>();
	}
};
static_assert(alignof(UPCGBlueprintHelpers) == 0x000008, "Wrong alignment on UPCGBlueprintHelpers");
static_assert(sizeof(UPCGBlueprintHelpers) == 0x000028, "Wrong size on UPCGBlueprintHelpers");

// Class PCG.PCGBooleanSelectSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGBooleanSelectSettings final : public UPCGSettings
{
public:
	bool                                          bUseInputB;                                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBooleanSelectSettings">();
	}
	static class UPCGBooleanSelectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBooleanSelectSettings>();
	}
};
static_assert(alignof(UPCGBooleanSelectSettings) == 0x000008, "Wrong alignment on UPCGBooleanSelectSettings");
static_assert(sizeof(UPCGBooleanSelectSettings) == 0x000158, "Wrong size on UPCGBooleanSelectSettings");
static_assert(offsetof(UPCGBooleanSelectSettings, bUseInputB) == 0x000150, "Member 'UPCGBooleanSelectSettings::bUseInputB' has a wrong offset!");

// Class PCG.PCGBoundsModifierSettings
// 0x0040 (0x0190 - 0x0150)
class UPCGBoundsModifierSettings final : public UPCGSettings
{
public:
	EPCGBoundsModifierMode                        Mode;                                              // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoundsMin;                                         // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoundsMax;                                         // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectSteepness;                                  // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Steepness;                                         // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBoundsModifierSettings">();
	}
	static class UPCGBoundsModifierSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBoundsModifierSettings>();
	}
};
static_assert(alignof(UPCGBoundsModifierSettings) == 0x000008, "Wrong alignment on UPCGBoundsModifierSettings");
static_assert(sizeof(UPCGBoundsModifierSettings) == 0x000190, "Wrong size on UPCGBoundsModifierSettings");
static_assert(offsetof(UPCGBoundsModifierSettings, Mode) == 0x000150, "Member 'UPCGBoundsModifierSettings::Mode' has a wrong offset!");
static_assert(offsetof(UPCGBoundsModifierSettings, BoundsMin) == 0x000158, "Member 'UPCGBoundsModifierSettings::BoundsMin' has a wrong offset!");
static_assert(offsetof(UPCGBoundsModifierSettings, BoundsMax) == 0x000170, "Member 'UPCGBoundsModifierSettings::BoundsMax' has a wrong offset!");
static_assert(offsetof(UPCGBoundsModifierSettings, bAffectSteepness) == 0x000188, "Member 'UPCGBoundsModifierSettings::bAffectSteepness' has a wrong offset!");
static_assert(offsetof(UPCGBoundsModifierSettings, Steepness) == 0x00018C, "Member 'UPCGBoundsModifierSettings::Steepness' has a wrong offset!");

// Class PCG.PCGBranchSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGBranchSettings final : public UPCGSettings
{
public:
	bool                                          bOutputToB;                                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGBranchSettings">();
	}
	static class UPCGBranchSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGBranchSettings>();
	}
};
static_assert(alignof(UPCGBranchSettings) == 0x000008, "Wrong alignment on UPCGBranchSettings");
static_assert(sizeof(UPCGBranchSettings) == 0x000158, "Wrong size on UPCGBranchSettings");
static_assert(offsetof(UPCGBranchSettings, bOutputToB) == 0x000150, "Member 'UPCGBranchSettings::bOutputToB' has a wrong offset!");

// Class PCG.PCGCollapseSettings
// 0x0000 (0x0150 - 0x0150)
class UPCGCollapseSettings final : public UPCGSettings
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCollapseSettings">();
	}
	static class UPCGCollapseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCollapseSettings>();
	}
};
static_assert(alignof(UPCGCollapseSettings) == 0x000008, "Wrong alignment on UPCGCollapseSettings");
static_assert(sizeof(UPCGCollapseSettings) == 0x000150, "Wrong size on UPCGCollapseSettings");

// Class PCG.PCGSpatialData
// 0x0040 (0x0078 - 0x0038)
class UPCGSpatialData : public UPCGData
{
public:
	TWeakObjectPtr<class AActor>                  TargetActor;                                       // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPCGMetadata*                           MetaData;                                          // 0x0040(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHasCachedLastSelector;                            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     CachedLastSelector;                                // 0x0050(0x0028)(NativeAccessSpecifierPrivate)

public:
	class UPCGMetadata* CreateEmptyMetadata();
	void InitializeFromData(const class UPCGSpatialData* InSource, const class UPCGMetadata* InMetadataParentOverride, bool bInheritMetadata, bool bInheritAttributes);
	class UPCGMetadata* MutableMetadata();

	const class UPCGMetadata* ConstMetadata() const;
	struct FBox GetBounds() const;
	float GetDensityAtPosition(const struct FVector& InPosition) const;
	int32 GetDimension() const;
	struct FVector GetNormal() const;
	struct FBox GetStrictBounds() const;
	bool HasNonTrivialTransform() const;
	class UPCGIntersectionData* IntersectWith(const class UPCGSpatialData* InOther) const;
	class UPCGSpatialData* ProjectOn(const class UPCGSpatialData* InOther, const struct FPCGProjectionParams& InParams) const;
	bool ProjectPoint(const struct FTransform& InTransform, const struct FBox& InBounds, const struct FPCGProjectionParams& InParams, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	bool SamplePoint(const struct FTransform& Transform, const struct FBox& Bounds, struct FPCGPoint* OutPoint, class UPCGMetadata* OutMetadata) const;
	class UPCGDifferenceData* Subtract(const class UPCGSpatialData* InOther) const;
	const class UPCGPointData* ToPointData() const;
	const class UPCGPointData* ToPointDataWithContext(struct FPCGContext& Context) const;
	class UPCGUnionData* UnionWith(const class UPCGSpatialData* InOther) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpatialData">();
	}
	static class UPCGSpatialData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialData>();
	}
};
static_assert(alignof(UPCGSpatialData) == 0x000008, "Wrong alignment on UPCGSpatialData");
static_assert(sizeof(UPCGSpatialData) == 0x000078, "Wrong size on UPCGSpatialData");
static_assert(offsetof(UPCGSpatialData, TargetActor) == 0x000038, "Member 'UPCGSpatialData::TargetActor' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, MetaData) == 0x000040, "Member 'UPCGSpatialData::MetaData' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, bHasCachedLastSelector) == 0x000048, "Member 'UPCGSpatialData::bHasCachedLastSelector' has a wrong offset!");
static_assert(offsetof(UPCGSpatialData, CachedLastSelector) == 0x000050, "Member 'UPCGSpatialData::CachedLastSelector' has a wrong offset!");

// Class PCG.PCGSpatialDataWithPointCache
// 0x0050 (0x00C8 - 0x0078)
class UPCGSpatialDataWithPointCache : public UPCGSpatialData
{
public:
	class UPCGPointData*                          CachedPointData;                                   // 0x0078(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBox>                           CachedBoundedPointDataBoxes;                       // 0x0080(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UPCGPointData*>                  CachedBoundedPointData;                            // 0x0090(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGSpatialDataWithPointCache">();
	}
	static class UPCGSpatialDataWithPointCache* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGSpatialDataWithPointCache>();
	}
};
static_assert(alignof(UPCGSpatialDataWithPointCache) == 0x000008, "Wrong alignment on UPCGSpatialDataWithPointCache");
static_assert(sizeof(UPCGSpatialDataWithPointCache) == 0x0000C8, "Wrong size on UPCGSpatialDataWithPointCache");
static_assert(offsetof(UPCGSpatialDataWithPointCache, CachedPointData) == 0x000078, "Member 'UPCGSpatialDataWithPointCache::CachedPointData' has a wrong offset!");
static_assert(offsetof(UPCGSpatialDataWithPointCache, CachedBoundedPointDataBoxes) == 0x000080, "Member 'UPCGSpatialDataWithPointCache::CachedBoundedPointDataBoxes' has a wrong offset!");
static_assert(offsetof(UPCGSpatialDataWithPointCache, CachedBoundedPointData) == 0x000090, "Member 'UPCGSpatialDataWithPointCache::CachedBoundedPointData' has a wrong offset!");

// Class PCG.PCGCollisionShapeData
// 0x00F8 (0x01C0 - 0x00C8)
class UPCGCollisionShapeData final : public UPCGSpatialDataWithPointCache
{
public:
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x00D0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   CachedBounds;                                      // 0x0150(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FBox                                   CachedStrictBounds;                                // 0x0188(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCollisionShapeData">();
	}
	static class UPCGCollisionShapeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCollisionShapeData>();
	}
};
static_assert(alignof(UPCGCollisionShapeData) == 0x000010, "Wrong alignment on UPCGCollisionShapeData");
static_assert(sizeof(UPCGCollisionShapeData) == 0x0001C0, "Wrong size on UPCGCollisionShapeData");
static_assert(offsetof(UPCGCollisionShapeData, Transform) == 0x0000D0, "Member 'UPCGCollisionShapeData::Transform' has a wrong offset!");
static_assert(offsetof(UPCGCollisionShapeData, CachedBounds) == 0x000150, "Member 'UPCGCollisionShapeData::CachedBounds' has a wrong offset!");
static_assert(offsetof(UPCGCollisionShapeData, CachedStrictBounds) == 0x000188, "Member 'UPCGCollisionShapeData::CachedStrictBounds' has a wrong offset!");

// Class PCG.PCGComponent
// 0x0160 (0x0210 - 0x00B0)
class UPCGComponent final : public UActorComponent
{
public:
	EPCGComponentInput                            InputType;                                         // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bParseActorComponents;                             // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Seed;                                              // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivated;                                        // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsComponentPartitioned;                           // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGComponentGenerationTrigger                GenerationTrigger;                                 // 0x00BA(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerated;                                        // 0x00BB(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRuntimeGenerated;                                 // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           PostGenerateFunctionNames;                         // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UPCGGraphInstance*                      GraphInstance;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint32                                        GenerationGridSize;                                // 0x00D8(0x0004)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCGData*                               CachedPCGData;                                     // 0x00E0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedInputData;                                   // 0x00E8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedActorData;                                   // 0x00F0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedLandscapeData;                               // 0x00F8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPCGData*                               CachedLandscapeHeightData;                         // 0x0100(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPCGManagedResource*>            GeneratedResources;                                // 0x0108(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBox                                   LastGeneratedBounds;                               // 0x0120(0x0038)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FPCGDataCollection                     GeneratedGraphOutput;                              // 0x0158(0x0020)(NativeAccessSpecifierPrivate)
	TMap<class FString, struct FPCGDataCollection> PerPinGeneratedOutput;                             // 0x0178(0x0050)(Edit, Transient, EditConst, AdvancedDisplay, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C8[0x18];                                     // 0x01C8(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsComponentLocal;                                 // 0x01E0(0x0001)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1E1[0x2F];                                     // 0x01E1(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddToManagedResources(class UPCGManagedResource* InResource);
	void Cleanup(bool bRemoveComponents, bool bSave);
	void CleanupLocal(bool bRemoveComponents, bool bSave);
	class AActor* ClearPCGLink(class UClass* TemplateActor);
	void Generate(bool bForce);
	void GenerateLocal(bool bForce);
	void NotifyPropertiesChangedFromBlueprint();
	void SetGraph(class UPCGGraphInterface* InGraph);

	const struct FPCGDataCollection GetGeneratedGraphOutput() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGComponent">();
	}
	static class UPCGComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGComponent>();
	}
};
static_assert(alignof(UPCGComponent) == 0x000008, "Wrong alignment on UPCGComponent");
static_assert(sizeof(UPCGComponent) == 0x000210, "Wrong size on UPCGComponent");
static_assert(offsetof(UPCGComponent, InputType) == 0x0000B0, "Member 'UPCGComponent::InputType' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bParseActorComponents) == 0x0000B1, "Member 'UPCGComponent::bParseActorComponents' has a wrong offset!");
static_assert(offsetof(UPCGComponent, Seed) == 0x0000B4, "Member 'UPCGComponent::Seed' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bActivated) == 0x0000B8, "Member 'UPCGComponent::bActivated' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bIsComponentPartitioned) == 0x0000B9, "Member 'UPCGComponent::bIsComponentPartitioned' has a wrong offset!");
static_assert(offsetof(UPCGComponent, GenerationTrigger) == 0x0000BA, "Member 'UPCGComponent::GenerationTrigger' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bGenerated) == 0x0000BB, "Member 'UPCGComponent::bGenerated' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bRuntimeGenerated) == 0x0000BC, "Member 'UPCGComponent::bRuntimeGenerated' has a wrong offset!");
static_assert(offsetof(UPCGComponent, PostGenerateFunctionNames) == 0x0000C0, "Member 'UPCGComponent::PostGenerateFunctionNames' has a wrong offset!");
static_assert(offsetof(UPCGComponent, GraphInstance) == 0x0000D0, "Member 'UPCGComponent::GraphInstance' has a wrong offset!");
static_assert(offsetof(UPCGComponent, GenerationGridSize) == 0x0000D8, "Member 'UPCGComponent::GenerationGridSize' has a wrong offset!");
static_assert(offsetof(UPCGComponent, CachedPCGData) == 0x0000E0, "Member 'UPCGComponent::CachedPCGData' has a wrong offset!");
static_assert(offsetof(UPCGComponent, CachedInputData) == 0x0000E8, "Member 'UPCGComponent::CachedInputData' has a wrong offset!");
static_assert(offsetof(UPCGComponent, CachedActorData) == 0x0000F0, "Member 'UPCGComponent::CachedActorData' has a wrong offset!");
static_assert(offsetof(UPCGComponent, CachedLandscapeData) == 0x0000F8, "Member 'UPCGComponent::CachedLandscapeData' has a wrong offset!");
static_assert(offsetof(UPCGComponent, CachedLandscapeHeightData) == 0x000100, "Member 'UPCGComponent::CachedLandscapeHeightData' has a wrong offset!");
static_assert(offsetof(UPCGComponent, GeneratedResources) == 0x000108, "Member 'UPCGComponent::GeneratedResources' has a wrong offset!");
static_assert(offsetof(UPCGComponent, LastGeneratedBounds) == 0x000120, "Member 'UPCGComponent::LastGeneratedBounds' has a wrong offset!");
static_assert(offsetof(UPCGComponent, GeneratedGraphOutput) == 0x000158, "Member 'UPCGComponent::GeneratedGraphOutput' has a wrong offset!");
static_assert(offsetof(UPCGComponent, PerPinGeneratedOutput) == 0x000178, "Member 'UPCGComponent::PerPinGeneratedOutput' has a wrong offset!");
static_assert(offsetof(UPCGComponent, bIsComponentLocal) == 0x0001E0, "Member 'UPCGComponent::bIsComponentLocal' has a wrong offset!");

// Class PCG.PCGCopyPointsSettings
// 0x0008 (0x0158 - 0x0150)
class UPCGCopyPointsSettings final : public UPCGSettings
{
public:
	EPCGCopyPointsInheritanceMode                 RotationInheritance;                               // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGCopyPointsInheritanceMode                 ScaleInheritance;                                  // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGCopyPointsInheritanceMode                 ColorInheritance;                                  // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGCopyPointsInheritanceMode                 SeedInheritance;                                   // 0x0153(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGCopyPointsMetadataInheritanceMode         AttributeInheritance;                              // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCopyPointsSettings">();
	}
	static class UPCGCopyPointsSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCopyPointsSettings>();
	}
};
static_assert(alignof(UPCGCopyPointsSettings) == 0x000008, "Wrong alignment on UPCGCopyPointsSettings");
static_assert(sizeof(UPCGCopyPointsSettings) == 0x000158, "Wrong size on UPCGCopyPointsSettings");
static_assert(offsetof(UPCGCopyPointsSettings, RotationInheritance) == 0x000150, "Member 'UPCGCopyPointsSettings::RotationInheritance' has a wrong offset!");
static_assert(offsetof(UPCGCopyPointsSettings, ScaleInheritance) == 0x000151, "Member 'UPCGCopyPointsSettings::ScaleInheritance' has a wrong offset!");
static_assert(offsetof(UPCGCopyPointsSettings, ColorInheritance) == 0x000152, "Member 'UPCGCopyPointsSettings::ColorInheritance' has a wrong offset!");
static_assert(offsetof(UPCGCopyPointsSettings, SeedInheritance) == 0x000153, "Member 'UPCGCopyPointsSettings::SeedInheritance' has a wrong offset!");
static_assert(offsetof(UPCGCopyPointsSettings, AttributeInheritance) == 0x000154, "Member 'UPCGCopyPointsSettings::AttributeInheritance' has a wrong offset!");

// Class PCG.PCGCreateAttributeBaseSettings
// 0x0190 (0x02E0 - 0x0150)
class UPCGCreateAttributeBaseSettings : public UPCGSettings
{
public:
	bool                                          bDisplayFromSourceParamSetting;                    // 0x0150(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPCGAttributePropertyInputSelector     InputSource;                                       // 0x0158(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FPCGMetadataTypesConstantStruct        AttributeTypes;                                    // 0x0180(0x0160)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCreateAttributeBaseSettings">();
	}
	static class UPCGCreateAttributeBaseSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateAttributeBaseSettings>();
	}
};
static_assert(alignof(UPCGCreateAttributeBaseSettings) == 0x000010, "Wrong alignment on UPCGCreateAttributeBaseSettings");
static_assert(sizeof(UPCGCreateAttributeBaseSettings) == 0x0002E0, "Wrong size on UPCGCreateAttributeBaseSettings");
static_assert(offsetof(UPCGCreateAttributeBaseSettings, bDisplayFromSourceParamSetting) == 0x000150, "Member 'UPCGCreateAttributeBaseSettings::bDisplayFromSourceParamSetting' has a wrong offset!");
static_assert(offsetof(UPCGCreateAttributeBaseSettings, InputSource) == 0x000158, "Member 'UPCGCreateAttributeBaseSettings::InputSource' has a wrong offset!");
static_assert(offsetof(UPCGCreateAttributeBaseSettings, AttributeTypes) == 0x000180, "Member 'UPCGCreateAttributeBaseSettings::AttributeTypes' has a wrong offset!");

// Class PCG.PCGAddAttributeSettings
// 0x0030 (0x0310 - 0x02E0)
class UPCGAddAttributeSettings final : public UPCGCreateAttributeBaseSettings
{
public:
	struct FPCGAttributePropertyOutputSelector    OutputTarget;                                      // 0x02E0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGAddAttributeSettings">();
	}
	static class UPCGAddAttributeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGAddAttributeSettings>();
	}
};
static_assert(alignof(UPCGAddAttributeSettings) == 0x000010, "Wrong alignment on UPCGAddAttributeSettings");
static_assert(sizeof(UPCGAddAttributeSettings) == 0x000310, "Wrong size on UPCGAddAttributeSettings");
static_assert(offsetof(UPCGAddAttributeSettings, OutputTarget) == 0x0002E0, "Member 'UPCGAddAttributeSettings::OutputTarget' has a wrong offset!");

// Class PCG.PCGCreateAttributeSetSettings
// 0x0030 (0x0310 - 0x02E0)
class UPCGCreateAttributeSetSettings final : public UPCGCreateAttributeBaseSettings
{
public:
	struct FPCGAttributePropertyOutputNoSourceSelector OutputTarget;                                      // 0x02E0(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCreateAttributeSetSettings">();
	}
	static class UPCGCreateAttributeSetSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateAttributeSetSettings>();
	}
};
static_assert(alignof(UPCGCreateAttributeSetSettings) == 0x000010, "Wrong alignment on UPCGCreateAttributeSetSettings");
static_assert(sizeof(UPCGCreateAttributeSetSettings) == 0x000310, "Wrong size on UPCGCreateAttributeSetSettings");
static_assert(offsetof(UPCGCreateAttributeSetSettings, OutputTarget) == 0x0002E0, "Member 'UPCGCreateAttributeSetSettings::OutputTarget' has a wrong offset!");

// Class PCG.PCGCreateSplineSettings
// 0x0048 (0x0198 - 0x0150)
class UPCGCreateSplineSettings final : public UPCGSettings
{
public:
	EPCGCreateSplineMode                          Mode;                                              // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClosedLoop;                                       // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLinear;                                           // 0x0152(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyCustomTangents;                              // 0x0153(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ArriveTangentAttribute;                            // 0x0154(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LeaveTangentAttribute;                             // 0x015C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  TargetActor;                                       // 0x0168(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPCGAttachOptions                             AttachOptions;                                     // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGCreateSplineSettings">();
	}
	static class UPCGCreateSplineSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGCreateSplineSettings>();
	}
};
static_assert(alignof(UPCGCreateSplineSettings) == 0x000008, "Wrong alignment on UPCGCreateSplineSettings");
static_assert(sizeof(UPCGCreateSplineSettings) == 0x000198, "Wrong size on UPCGCreateSplineSettings");
static_assert(offsetof(UPCGCreateSplineSettings, Mode) == 0x000150, "Member 'UPCGCreateSplineSettings::Mode' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, bClosedLoop) == 0x000151, "Member 'UPCGCreateSplineSettings::bClosedLoop' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, bLinear) == 0x000152, "Member 'UPCGCreateSplineSettings::bLinear' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, bApplyCustomTangents) == 0x000153, "Member 'UPCGCreateSplineSettings::bApplyCustomTangents' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, ArriveTangentAttribute) == 0x000154, "Member 'UPCGCreateSplineSettings::ArriveTangentAttribute' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, LeaveTangentAttribute) == 0x00015C, "Member 'UPCGCreateSplineSettings::LeaveTangentAttribute' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, TargetActor) == 0x000168, "Member 'UPCGCreateSplineSettings::TargetActor' has a wrong offset!");
static_assert(offsetof(UPCGCreateSplineSettings, AttachOptions) == 0x000190, "Member 'UPCGCreateSplineSettings::AttachOptions' has a wrong offset!");

// Class PCG.PCGCreateTargetActor
// 0x00B0 (0x0200 - 0x0150)
class UPCGCreateTargetActor final : public UPCGSettings
{
public:
	TSubclassOf<class AActor>                     TemplateActorClass;                                // 0x0150(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TemplateActor;                                     // 0x0158(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowTemplateActorEditing;                        // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EPCGAttachOptions                             AttachOptions;                                     // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class AActor>                  RootActor;                                         // 0x0168(0x0028)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ActorLabel;                                        // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ActorPivot;                                        // 0x01A0(0x0060)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
