#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Reflection_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Reflection_Parameters.Reflection_Parameters
// 0x0260 (0x0260 - 0x0000)
struct FReflection_Parameters final
{
public:
	class FString                                 EnableReflection_13_F507403D4F7A1CD01010E9A6F04587D1; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableHeightFoginReflection_14_55A2CFFF4743A2FC0CC28AA5CADADFE3; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionSortMaterials_15_F69BD15C43B20A76600613BAD71A11DA; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableReflectionShadow_16_5CE4011344B44695A51F5DBB57926695; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionMaxRoughness_17_094F87434A4CA2EF78446385751DA11D; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionScreenPercentage_18_872B98A040695DB673733C87B039D4B0; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionMaxRayDistance_19_A0E3D15745EF03C12C73608BB897FCE5; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionMinRayDistance_20_6D12EE6E48A718B502DB929484EDBBD6; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionMaxBounces_21_81B8DA514D86E8694A43E79814041786; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RTEnableReflectionCapture_23_8F28E19F49F2BCB9FBAA08B7A899CAB2; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableReflectionTestRoughness_24_0883B4184EE12DA29A43128E2D24FB4F; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionSkyLightContribution_38_63342FE64D2759F0A072E992588DDE8D; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsRoughnessMultiplier_28_2DEC260341D957BF835DF89E8D4C715D; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HybridReflection_29_A64910B440FDB3B211D60DA855E15843; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectedTranslucencyMode_34_E9B43ED24B20AF57BCCD4B82D4074935; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectedTranslucencyMaxBounces_35_30526005497114ACA32D4CA9E09190A3; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectedTranslucencyTransmissionThreshold_37_BBC1DF1646E5DD7F79B8F5B29C5CDBB3; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsEnableTwoSidedGeometry_41_C7FA80DB463DAB7DB041F09EC67DD112; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MaxUnderCoatBounces_62_688C1C5C4D17318FDDC5ED80073BA4D7; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionSPP_44_FED6320D427E492AF4204489AD917995; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableExperimentalDeferredReflection_66_343BD64D4F5BDBC896028185CB7FBFAD; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        AdaptiveScreenResFactor_56_7728DE014FEF7D04C7DEBEA4CF6B19C2; // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAdaptiveReflectionBasedOnPlayerSpeed_57_0A7CA6C542DEEE71FFAC1C983313AD2A; // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableAdaptiveScreenRes_77_15C3863D4619C6022DE09E86F10B590C; // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReflectionSER_89_18733D034E7DBD7A7642C995390A2CD7; // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FirstLayerReflectionGI_90_15AE45EA4FCF7F58C60B6AADFDE32A20; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionGIScreenPercentage_91_6D73D812481B9F101686D4B851464B32; // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionGIDenoise_92_FF607B21446BC09B37CA2DB5BA7F9A57; // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionRestirGI_93_D90D98F1484676B39E3C068DEC4A72B1; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReorientedSpriteHalfRes_96_DFF9952549341953BDE6A9BDC3F8B585; // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SingleLayerReflection_99_7B571B924077A4A8A84D1EAC70479D99; // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsMinClearCoatLevel_105_E3A93CCC477313F443E19FB712CD6A95; // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsGIHybrid_108_D1A709494CE1F49396006B9C15C8C05C; // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionGIEnableVisibilityTest_111_7248A13B4F3503AC86D25487F012EC10; // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SingleLayerReflectionScreenPercentage_114_DDEDC786484AA3D6622014AA2DBEEB6F; // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SingleLayerReflectionGIScreenPercentage_116_0DCB1EAE4C151FB308EA3BAF31305B6F; // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SingleLayerReflectionGIEnable_118_966F518F429C3DFBA244978F31AAFB77; // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SLWEnableReflection_121_F14683E74EB8E592874C84A814697B1D; // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsOpaqueSurfaces_123_3F349BDD4439D93850D70DA6DA4E03B5; // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReflectionsForceDisableSkyLight_126_B34D41C44F19CBED85C1D994AD0E6B76; // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FReflection_Parameters) == 0x000008, "Wrong alignment on FReflection_Parameters");
static_assert(sizeof(FReflection_Parameters) == 0x000260, "Wrong size on FReflection_Parameters");
static_assert(offsetof(FReflection_Parameters, EnableReflection_13_F507403D4F7A1CD01010E9A6F04587D1) == 0x000000, "Member 'FReflection_Parameters::EnableReflection_13_F507403D4F7A1CD01010E9A6F04587D1' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableHeightFoginReflection_14_55A2CFFF4743A2FC0CC28AA5CADADFE3) == 0x000010, "Member 'FReflection_Parameters::EnableHeightFoginReflection_14_55A2CFFF4743A2FC0CC28AA5CADADFE3' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionSortMaterials_15_F69BD15C43B20A76600613BAD71A11DA) == 0x000020, "Member 'FReflection_Parameters::ReflectionSortMaterials_15_F69BD15C43B20A76600613BAD71A11DA' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableReflectionShadow_16_5CE4011344B44695A51F5DBB57926695) == 0x000030, "Member 'FReflection_Parameters::EnableReflectionShadow_16_5CE4011344B44695A51F5DBB57926695' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionMaxRoughness_17_094F87434A4CA2EF78446385751DA11D) == 0x000040, "Member 'FReflection_Parameters::ReflectionMaxRoughness_17_094F87434A4CA2EF78446385751DA11D' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionScreenPercentage_18_872B98A040695DB673733C87B039D4B0) == 0x000050, "Member 'FReflection_Parameters::ReflectionScreenPercentage_18_872B98A040695DB673733C87B039D4B0' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionMaxRayDistance_19_A0E3D15745EF03C12C73608BB897FCE5) == 0x000060, "Member 'FReflection_Parameters::ReflectionMaxRayDistance_19_A0E3D15745EF03C12C73608BB897FCE5' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionMinRayDistance_20_6D12EE6E48A718B502DB929484EDBBD6) == 0x000070, "Member 'FReflection_Parameters::ReflectionMinRayDistance_20_6D12EE6E48A718B502DB929484EDBBD6' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionMaxBounces_21_81B8DA514D86E8694A43E79814041786) == 0x000080, "Member 'FReflection_Parameters::ReflectionMaxBounces_21_81B8DA514D86E8694A43E79814041786' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, RTEnableReflectionCapture_23_8F28E19F49F2BCB9FBAA08B7A899CAB2) == 0x000090, "Member 'FReflection_Parameters::RTEnableReflectionCapture_23_8F28E19F49F2BCB9FBAA08B7A899CAB2' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableReflectionTestRoughness_24_0883B4184EE12DA29A43128E2D24FB4F) == 0x0000A0, "Member 'FReflection_Parameters::EnableReflectionTestRoughness_24_0883B4184EE12DA29A43128E2D24FB4F' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionSkyLightContribution_38_63342FE64D2759F0A072E992588DDE8D) == 0x0000B0, "Member 'FReflection_Parameters::ReflectionSkyLightContribution_38_63342FE64D2759F0A072E992588DDE8D' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsRoughnessMultiplier_28_2DEC260341D957BF835DF89E8D4C715D) == 0x0000C0, "Member 'FReflection_Parameters::ReflectionsRoughnessMultiplier_28_2DEC260341D957BF835DF89E8D4C715D' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, HybridReflection_29_A64910B440FDB3B211D60DA855E15843) == 0x0000D0, "Member 'FReflection_Parameters::HybridReflection_29_A64910B440FDB3B211D60DA855E15843' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectedTranslucencyMode_34_E9B43ED24B20AF57BCCD4B82D4074935) == 0x0000E0, "Member 'FReflection_Parameters::ReflectedTranslucencyMode_34_E9B43ED24B20AF57BCCD4B82D4074935' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectedTranslucencyMaxBounces_35_30526005497114ACA32D4CA9E09190A3) == 0x0000F0, "Member 'FReflection_Parameters::ReflectedTranslucencyMaxBounces_35_30526005497114ACA32D4CA9E09190A3' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectedTranslucencyTransmissionThreshold_37_BBC1DF1646E5DD7F79B8F5B29C5CDBB3) == 0x000100, "Member 'FReflection_Parameters::ReflectedTranslucencyTransmissionThreshold_37_BBC1DF1646E5DD7F79B8F5B29C5CDBB3' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsEnableTwoSidedGeometry_41_C7FA80DB463DAB7DB041F09EC67DD112) == 0x000110, "Member 'FReflection_Parameters::ReflectionsEnableTwoSidedGeometry_41_C7FA80DB463DAB7DB041F09EC67DD112' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, MaxUnderCoatBounces_62_688C1C5C4D17318FDDC5ED80073BA4D7) == 0x000120, "Member 'FReflection_Parameters::MaxUnderCoatBounces_62_688C1C5C4D17318FDDC5ED80073BA4D7' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionSPP_44_FED6320D427E492AF4204489AD917995) == 0x000130, "Member 'FReflection_Parameters::ReflectionSPP_44_FED6320D427E492AF4204489AD917995' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableExperimentalDeferredReflection_66_343BD64D4F5BDBC896028185CB7FBFAD) == 0x000140, "Member 'FReflection_Parameters::EnableExperimentalDeferredReflection_66_343BD64D4F5BDBC896028185CB7FBFAD' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, AdaptiveScreenResFactor_56_7728DE014FEF7D04C7DEBEA4CF6B19C2) == 0x000150, "Member 'FReflection_Parameters::AdaptiveScreenResFactor_56_7728DE014FEF7D04C7DEBEA4CF6B19C2' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableAdaptiveReflectionBasedOnPlayerSpeed_57_0A7CA6C542DEEE71FFAC1C983313AD2A) == 0x000158, "Member 'FReflection_Parameters::EnableAdaptiveReflectionBasedOnPlayerSpeed_57_0A7CA6C542DEEE71FFAC1C983313AD2A' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, EnableAdaptiveScreenRes_77_15C3863D4619C6022DE09E86F10B590C) == 0x000159, "Member 'FReflection_Parameters::EnableAdaptiveScreenRes_77_15C3863D4619C6022DE09E86F10B590C' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionSER_89_18733D034E7DBD7A7642C995390A2CD7) == 0x000160, "Member 'FReflection_Parameters::ReflectionSER_89_18733D034E7DBD7A7642C995390A2CD7' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, FirstLayerReflectionGI_90_15AE45EA4FCF7F58C60B6AADFDE32A20) == 0x000170, "Member 'FReflection_Parameters::FirstLayerReflectionGI_90_15AE45EA4FCF7F58C60B6AADFDE32A20' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionGIScreenPercentage_91_6D73D812481B9F101686D4B851464B32) == 0x000180, "Member 'FReflection_Parameters::ReflectionGIScreenPercentage_91_6D73D812481B9F101686D4B851464B32' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionGIDenoise_92_FF607B21446BC09B37CA2DB5BA7F9A57) == 0x000190, "Member 'FReflection_Parameters::ReflectionGIDenoise_92_FF607B21446BC09B37CA2DB5BA7F9A57' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionRestirGI_93_D90D98F1484676B39E3C068DEC4A72B1) == 0x0001A0, "Member 'FReflection_Parameters::ReflectionRestirGI_93_D90D98F1484676B39E3C068DEC4A72B1' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReorientedSpriteHalfRes_96_DFF9952549341953BDE6A9BDC3F8B585) == 0x0001B0, "Member 'FReflection_Parameters::ReorientedSpriteHalfRes_96_DFF9952549341953BDE6A9BDC3F8B585' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, SingleLayerReflection_99_7B571B924077A4A8A84D1EAC70479D99) == 0x0001C0, "Member 'FReflection_Parameters::SingleLayerReflection_99_7B571B924077A4A8A84D1EAC70479D99' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsMinClearCoatLevel_105_E3A93CCC477313F443E19FB712CD6A95) == 0x0001D0, "Member 'FReflection_Parameters::ReflectionsMinClearCoatLevel_105_E3A93CCC477313F443E19FB712CD6A95' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsGIHybrid_108_D1A709494CE1F49396006B9C15C8C05C) == 0x0001E0, "Member 'FReflection_Parameters::ReflectionsGIHybrid_108_D1A709494CE1F49396006B9C15C8C05C' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionGIEnableVisibilityTest_111_7248A13B4F3503AC86D25487F012EC10) == 0x0001F0, "Member 'FReflection_Parameters::ReflectionGIEnableVisibilityTest_111_7248A13B4F3503AC86D25487F012EC10' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, SingleLayerReflectionScreenPercentage_114_DDEDC786484AA3D6622014AA2DBEEB6F) == 0x000200, "Member 'FReflection_Parameters::SingleLayerReflectionScreenPercentage_114_DDEDC786484AA3D6622014AA2DBEEB6F' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, SingleLayerReflectionGIScreenPercentage_116_0DCB1EAE4C151FB308EA3BAF31305B6F) == 0x000210, "Member 'FReflection_Parameters::SingleLayerReflectionGIScreenPercentage_116_0DCB1EAE4C151FB308EA3BAF31305B6F' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, SingleLayerReflectionGIEnable_118_966F518F429C3DFBA244978F31AAFB77) == 0x000220, "Member 'FReflection_Parameters::SingleLayerReflectionGIEnable_118_966F518F429C3DFBA244978F31AAFB77' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, SLWEnableReflection_121_F14683E74EB8E592874C84A814697B1D) == 0x000230, "Member 'FReflection_Parameters::SLWEnableReflection_121_F14683E74EB8E592874C84A814697B1D' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsOpaqueSurfaces_123_3F349BDD4439D93850D70DA6DA4E03B5) == 0x000240, "Member 'FReflection_Parameters::ReflectionsOpaqueSurfaces_123_3F349BDD4439D93850D70DA6DA4E03B5' has a wrong offset!");
static_assert(offsetof(FReflection_Parameters, ReflectionsForceDisableSkyLight_126_B34D41C44F19CBED85C1D994AD0E6B76) == 0x000250, "Member 'FReflection_Parameters::ReflectionsForceDisableSkyLight_126_B34D41C44F19CBED85C1D994AD0E6B76' has a wrong offset!");

}

