#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RTX_PostProcess_Settings

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct RTX_PostProcess_Settings.RTX_PostProcess_Settings
// 0x07C0 (0x07C0 - 0x0000)
struct FRTX_PostProcess_Settings final
{
public:
	struct FPostProcessSettings                   RTXPostProcessSettings_2_F5F7708F4E83FAC705A16388FF06FB09; // 0x0000(0x07B0)(Edit, BlueprintVisible)
	float                                         PostProcessWeight_5_1188286A49AC49349A20F8AA6289C4A3; // 0x07B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RTXPostProcessPriority_11_2871BEF94A8E61F2640AA297CA1481AE; // 0x07B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Unbound_7_7B0858BA4548AD147D2D9083D9CB5FF7;        // 0x07B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRTX_PostProcess_Settings) == 0x000010, "Wrong alignment on FRTX_PostProcess_Settings");
static_assert(sizeof(FRTX_PostProcess_Settings) == 0x0007C0, "Wrong size on FRTX_PostProcess_Settings");
static_assert(offsetof(FRTX_PostProcess_Settings, RTXPostProcessSettings_2_F5F7708F4E83FAC705A16388FF06FB09) == 0x000000, "Member 'FRTX_PostProcess_Settings::RTXPostProcessSettings_2_F5F7708F4E83FAC705A16388FF06FB09' has a wrong offset!");
static_assert(offsetof(FRTX_PostProcess_Settings, PostProcessWeight_5_1188286A49AC49349A20F8AA6289C4A3) == 0x0007B0, "Member 'FRTX_PostProcess_Settings::PostProcessWeight_5_1188286A49AC49349A20F8AA6289C4A3' has a wrong offset!");
static_assert(offsetof(FRTX_PostProcess_Settings, RTXPostProcessPriority_11_2871BEF94A8E61F2640AA297CA1481AE) == 0x0007B4, "Member 'FRTX_PostProcess_Settings::RTXPostProcessPriority_11_2871BEF94A8E61F2640AA297CA1481AE' has a wrong offset!");
static_assert(offsetof(FRTX_PostProcess_Settings, Unbound_7_7B0858BA4548AD147D2D9083D9CB5FF7) == 0x0007B8, "Member 'FRTX_PostProcess_Settings::Unbound_7_7B0858BA4548AD147D2D9083D9CB5FF7' has a wrong offset!");

}

