#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SequencerScripting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "SequencerScripting_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK
{

// Class SequencerScripting.MovieSceneBindingExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneBindingExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneTrack* AddTrack(const struct FSequencerBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType);
	static TArray<class UMovieSceneTrack*> FindTracksByExactType(const struct FSequencerBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType);
	static TArray<class UMovieSceneTrack*> FindTracksByType(const struct FSequencerBindingProxy& InBinding, TSubclassOf<class UMovieSceneTrack> TrackType);
	static TArray<struct FSequencerBindingProxy> GetChildPossessables(const struct FSequencerBindingProxy& InBinding);
	static class FText GetDisplayName(const struct FSequencerBindingProxy& InBinding);
	static struct FGuid GetId(const struct FSequencerBindingProxy& InBinding);
	static class FString GetName(const struct FSequencerBindingProxy& InBinding);
	static class UObject* GetObjectTemplate(const struct FSequencerBindingProxy& InBinding);
	static struct FSequencerBindingProxy GetParent(const struct FSequencerBindingProxy& InBinding);
	static class UClass* GetPossessedObjectClass(const struct FSequencerBindingProxy& InBinding);
	static TArray<class UMovieSceneTrack*> GetTracks(const struct FSequencerBindingProxy& InBinding);
	static bool IsValid(const struct FSequencerBindingProxy& InBinding);
	static void MoveBindingContents(const struct FSequencerBindingProxy& SourceBindingId, const struct FSequencerBindingProxy& DestinationBindingId);
	static void Remove(const struct FSequencerBindingProxy& InBinding);
	static void RemoveTrack(const struct FSequencerBindingProxy& InBinding, class UMovieSceneTrack* TrackToRemove);
	static void SetDisplayName(const struct FSequencerBindingProxy& InBinding, const class FText& InDisplayName);
	static void SetName(const struct FSequencerBindingProxy& InBinding, const class FString& InName);
	static void SetParent(const struct FSequencerBindingProxy& InBinding, const struct FSequencerBindingProxy& InParentBinding);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneBindingExtensions">();
	}
	static class UMovieSceneBindingExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneBindingExtensions>();
	}
};
static_assert(alignof(UMovieSceneBindingExtensions) == 0x000008, "Wrong alignment on UMovieSceneBindingExtensions");
static_assert(sizeof(UMovieSceneBindingExtensions) == 0x000028, "Wrong size on UMovieSceneBindingExtensions");

// Class SequencerScripting.MovieSceneEventTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneEventTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneEventRepeaterSection* AddEventRepeaterSection(class UMovieSceneEventTrack* InTrack);
	static class UMovieSceneEventTriggerSection* AddEventTriggerSection(class UMovieSceneEventTrack* InTrack);
	static class UClass* GetBoundObjectPropertyClass(const struct FMovieSceneEvent& EventKey);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneEventTrackExtensions">();
	}
	static class UMovieSceneEventTrackExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneEventTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneEventTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneEventTrackExtensions");
static_assert(sizeof(UMovieSceneEventTrackExtensions) == 0x000028, "Wrong size on UMovieSceneEventTrackExtensions");

// Class SequencerScripting.MovieSceneFolderExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneFolderExtensions final : public UBlueprintFunctionLibrary
{
public:
	static bool AddChildFolder(class UMovieSceneFolder* TargetFolder, class UMovieSceneFolder* FolderToAdd);
	static bool AddChildMasterTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InMasterTrack);
	static bool AddChildObjectBinding(class UMovieSceneFolder* Folder, const struct FSequencerBindingProxy& InObjectBinding);
	static TArray<class UMovieSceneFolder*> GetChildFolders(class UMovieSceneFolder* Folder);
	static TArray<class UMovieSceneTrack*> GetChildMasterTracks(class UMovieSceneFolder* Folder);
	static TArray<struct FSequencerBindingProxy> GetChildObjectBindings(class UMovieSceneFolder* Folder);
	static struct FColor GetFolderColor(class UMovieSceneFolder* Folder);
	static class FName GetFolderName(class UMovieSceneFolder* Folder);
	static bool RemoveChildFolder(class UMovieSceneFolder* TargetFolder, class UMovieSceneFolder* FolderToRemove);
	static bool RemoveChildMasterTrack(class UMovieSceneFolder* Folder, class UMovieSceneTrack* InMasterTrack);
	static bool RemoveChildObjectBinding(class UMovieSceneFolder* Folder, const struct FSequencerBindingProxy& InObjectBinding);
	static bool SetFolderColor(class UMovieSceneFolder* Folder, const struct FColor& InFolderColor);
	static bool SetFolderName(class UMovieSceneFolder* Folder, class FName InFolderName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFolderExtensions">();
	}
	static class UMovieSceneFolderExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFolderExtensions>();
	}
};
static_assert(alignof(UMovieSceneFolderExtensions) == 0x000008, "Wrong alignment on UMovieSceneFolderExtensions");
static_assert(sizeof(UMovieSceneFolderExtensions) == 0x000028, "Wrong size on UMovieSceneFolderExtensions");

// Class SequencerScripting.MovieScenePropertyTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieScenePropertyTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* GetObjectPropertyClass(class UMovieSceneObjectPropertyTrack* Track);
	static class FName GetPropertyName(class UMovieScenePropertyTrack* Track);
	static class FString GetPropertyPath(class UMovieScenePropertyTrack* Track);
	static class FName GetUniqueTrackName(class UMovieScenePropertyTrack* Track);
	static void SetObjectPropertyClass(class UMovieSceneObjectPropertyTrack* Track, class UClass* PropertyClass);
	static void SetPropertyNameAndPath(class UMovieScenePropertyTrack* Track, const class FName& InPropertyName, const class FString& InPropertyPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieScenePropertyTrackExtensions">();
	}
	static class UMovieScenePropertyTrackExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieScenePropertyTrackExtensions>();
	}
};
static_assert(alignof(UMovieScenePropertyTrackExtensions) == 0x000008, "Wrong alignment on UMovieScenePropertyTrackExtensions");
static_assert(sizeof(UMovieScenePropertyTrackExtensions) == 0x000028, "Wrong size on UMovieScenePropertyTrackExtensions");

// Class SequencerScripting.MovieSceneScriptingKey
// 0x0018 (0x0040 - 0x0028)
class UMovieSceneScriptingKey : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingKey">();
	}
	static class UMovieSceneScriptingKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingKey");
static_assert(sizeof(UMovieSceneScriptingKey) == 0x000040, "Wrong size on UMovieSceneScriptingKey");

// Class SequencerScripting.MovieSceneScriptingActorReferenceKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingActorReferenceKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const struct FMovieSceneObjectBindingID& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	struct FMovieSceneObjectBindingID GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceKey">();
	}
	static class UMovieSceneScriptingActorReferenceKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingActorReferenceKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingActorReferenceKey");
static_assert(sizeof(UMovieSceneScriptingActorReferenceKey) == 0x000060, "Wrong size on UMovieSceneScriptingActorReferenceKey");

// Class SequencerScripting.MovieSceneScriptingChannel
// 0x0008 (0x0030 - 0x0028)
class UMovieSceneScriptingChannel : public UObject
{
public:
	class FName                                   ChannelName;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingChannel">();
	}
	static class UMovieSceneScriptingChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingChannel");
static_assert(sizeof(UMovieSceneScriptingChannel) == 0x000030, "Wrong size on UMovieSceneScriptingChannel");
static_assert(offsetof(UMovieSceneScriptingChannel, ChannelName) == 0x000028, "Member 'UMovieSceneScriptingChannel::ChannelName' has a wrong offset!");

// Class SequencerScripting.MovieSceneScriptingActorReferenceChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingActorReferenceChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingActorReferenceKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneObjectBindingID& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(const struct FMovieSceneObjectBindingID& InDefaultValue);

	struct FMovieSceneObjectBindingID GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActorReferenceChannel">();
	}
	static class UMovieSceneScriptingActorReferenceChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActorReferenceChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingActorReferenceChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingActorReferenceChannel");
static_assert(sizeof(UMovieSceneScriptingActorReferenceChannel) == 0x000060, "Wrong size on UMovieSceneScriptingActorReferenceChannel");

// Class SequencerScripting.MovieSceneScriptingBoolKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingBoolKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(bool InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	bool GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingBoolKey">();
	}
	static class UMovieSceneScriptingBoolKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingBoolKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingBoolKey");
static_assert(sizeof(UMovieSceneScriptingBoolKey) == 0x000060, "Wrong size on UMovieSceneScriptingBoolKey");

// Class SequencerScripting.MovieSceneScriptingBoolChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingBoolChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingBoolKey* AddKey(const struct FFrameNumber& InTime, bool NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(bool InDefaultValue);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<bool> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	bool GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingBoolChannel">();
	}
	static class UMovieSceneScriptingBoolChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingBoolChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingBoolChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingBoolChannel");
static_assert(sizeof(UMovieSceneScriptingBoolChannel) == 0x000060, "Wrong size on UMovieSceneScriptingBoolChannel");

// Class SequencerScripting.MovieSceneScriptingByteKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingByteKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(uint8 InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	uint8 GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingByteKey">();
	}
	static class UMovieSceneScriptingByteKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingByteKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingByteKey");
static_assert(sizeof(UMovieSceneScriptingByteKey) == 0x000060, "Wrong size on UMovieSceneScriptingByteKey");

// Class SequencerScripting.MovieSceneScriptingByteChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingByteChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingByteKey* AddKey(const struct FFrameNumber& InTime, uint8 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(uint8 InDefaultValue);

	uint8 GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingByteChannel">();
	}
	static class UMovieSceneScriptingByteChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingByteChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingByteChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingByteChannel");
static_assert(sizeof(UMovieSceneScriptingByteChannel) == 0x000060, "Wrong size on UMovieSceneScriptingByteChannel");

// Class SequencerScripting.MovieSceneScriptingDoubleKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingDoubleKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetArriveTangent(float InNewValue);
	void SetArriveTangentWeight(float InNewValue);
	void SetInterpolationMode(ERichCurveInterpMode InNewValue);
	void SetLeaveTangent(float InNewValue);
	void SetLeaveTangentWeight(float InNewValue);
	void SetTangentMode(ERichCurveTangentMode InNewValue);
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue);
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(double InNewValue);

	float GetArriveTangent() const;
	float GetArriveTangentWeight() const;
	ERichCurveInterpMode GetInterpolationMode() const;
	float GetLeaveTangent() const;
	float GetLeaveTangentWeight() const;
	ERichCurveTangentMode GetTangentMode() const;
	ERichCurveTangentWeightMode GetTangentWeightMode() const;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	double GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleKey">();
	}
	static class UMovieSceneScriptingDoubleKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleKey");
static_assert(sizeof(UMovieSceneScriptingDoubleKey) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleKey");

// Class SequencerScripting.MovieSceneScriptingDoubleChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingDoubleChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingDoubleKey* AddKey(const struct FFrameNumber& InTime, double NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(double InDefaultValue);
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<double> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	double GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleChannel">();
	}
	static class UMovieSceneScriptingDoubleChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleChannel");
static_assert(sizeof(UMovieSceneScriptingDoubleChannel) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleChannel");

// Class SequencerScripting.MovieSceneScriptingEventKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingEventKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const struct FMovieSceneEvent& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	struct FMovieSceneEvent GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingEventKey">();
	}
	static class UMovieSceneScriptingEventKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingEventKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingEventKey");
static_assert(sizeof(UMovieSceneScriptingEventKey) == 0x000060, "Wrong size on UMovieSceneScriptingEventKey");

// Class SequencerScripting.MovieSceneScriptingEventChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingEventChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingEventKey* AddKey(const struct FFrameNumber& InTime, const struct FMovieSceneEvent& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveKey(class UMovieSceneScriptingKey* Key);

	TArray<class UMovieSceneScriptingKey*> GetKeys() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingEventChannel">();
	}
	static class UMovieSceneScriptingEventChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingEventChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingEventChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingEventChannel");
static_assert(sizeof(UMovieSceneScriptingEventChannel) == 0x000060, "Wrong size on UMovieSceneScriptingEventChannel");

// Class SequencerScripting.MovieSceneScriptingFloatKey
// 0x0000 (0x0040 - 0x0040)
class UMovieSceneScriptingFloatKey : public UMovieSceneScriptingKey
{
public:
	void SetArriveTangent(float InNewValue);
	void SetArriveTangentWeight(float InNewValue);
	void SetInterpolationMode(ERichCurveInterpMode InNewValue);
	void SetLeaveTangent(float InNewValue);
	void SetLeaveTangentWeight(float InNewValue);
	void SetTangentMode(ERichCurveTangentMode InNewValue);
	void SetTangentWeightMode(ERichCurveTangentWeightMode InNewValue);
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(float InNewValue);

	float GetArriveTangent() const;
	float GetArriveTangentWeight() const;
	ERichCurveInterpMode GetInterpolationMode() const;
	float GetLeaveTangent() const;
	float GetLeaveTangentWeight() const;
	ERichCurveTangentMode GetTangentMode() const;
	ERichCurveTangentWeightMode GetTangentWeightMode() const;
	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	float GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingFloatKey">();
	}
	static class UMovieSceneScriptingFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingFloatKey");
static_assert(sizeof(UMovieSceneScriptingFloatKey) == 0x000040, "Wrong size on UMovieSceneScriptingFloatKey");

// Class SequencerScripting.MovieSceneScriptingActualFloatKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingActualFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingActualFloatKey">();
	}
	static class UMovieSceneScriptingActualFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingActualFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingActualFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingActualFloatKey");
static_assert(sizeof(UMovieSceneScriptingActualFloatKey) == 0x000060, "Wrong size on UMovieSceneScriptingActualFloatKey");

// Class SequencerScripting.MovieSceneScriptingDoubleAsFloatKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingDoubleAsFloatKey final : public UMovieSceneScriptingFloatKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingDoubleAsFloatKey">();
	}
	static class UMovieSceneScriptingDoubleAsFloatKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingDoubleAsFloatKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingDoubleAsFloatKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingDoubleAsFloatKey");
static_assert(sizeof(UMovieSceneScriptingDoubleAsFloatKey) == 0x000060, "Wrong size on UMovieSceneScriptingDoubleAsFloatKey");

// Class SequencerScripting.MovieSceneScriptingFloatChannel
// 0x0050 (0x0080 - 0x0030)
class UMovieSceneScriptingFloatChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x50];                                      // 0x0030(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingFloatKey* AddKey(const struct FFrameNumber& InTime, float NewValue, float SubFrame, ESequenceTimeUnit TimeUnit, EMovieSceneKeyInterpolation InInterpolation);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(float InDefaultValue);
	void SetPostInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);
	void SetPreInfinityExtrapolation(ERichCurveExtrapolation InExtrapolation);

	struct FSequencerScriptingRange ComputeEffectiveRange() const;
	TArray<float> EvaluateKeys(const struct FSequencerScriptingRange& Range, const struct FFrameRate& FrameRate) const;
	float GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	int32 GetNumKeys() const;
	ERichCurveExtrapolation GetPostInfinityExtrapolation() const;
	ERichCurveExtrapolation GetPreInfinityExtrapolation() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingFloatChannel">();
	}
	static class UMovieSceneScriptingFloatChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingFloatChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingFloatChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingFloatChannel");
static_assert(sizeof(UMovieSceneScriptingFloatChannel) == 0x000080, "Wrong size on UMovieSceneScriptingFloatChannel");

// Class SequencerScripting.MovieSceneScriptingIntegerKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingIntegerKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(int32 InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	int32 GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerKey">();
	}
	static class UMovieSceneScriptingIntegerKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingIntegerKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingIntegerKey");
static_assert(sizeof(UMovieSceneScriptingIntegerKey) == 0x000060, "Wrong size on UMovieSceneScriptingIntegerKey");

// Class SequencerScripting.MovieSceneScriptingIntegerChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingIntegerChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingIntegerKey* AddKey(const struct FFrameNumber& InTime, int32 NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(int32 InDefaultValue);

	int32 GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingIntegerChannel">();
	}
	static class UMovieSceneScriptingIntegerChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingIntegerChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingIntegerChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingIntegerChannel");
static_assert(sizeof(UMovieSceneScriptingIntegerChannel) == 0x000060, "Wrong size on UMovieSceneScriptingIntegerChannel");

// Class SequencerScripting.MovieSceneScriptingObjectPathKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingObjectPathKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(class UObject* InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	class UObject* GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathKey">();
	}
	static class UMovieSceneScriptingObjectPathKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingObjectPathKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingObjectPathKey");
static_assert(sizeof(UMovieSceneScriptingObjectPathKey) == 0x000060, "Wrong size on UMovieSceneScriptingObjectPathKey");

// Class SequencerScripting.MovieSceneScriptingObjectPathChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingObjectPathChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingObjectPathKey* AddKey(const struct FFrameNumber& InTime, class UObject* NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(class UObject* InDefaultValue);

	class UObject* GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingObjectPathChannel">();
	}
	static class UMovieSceneScriptingObjectPathChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingObjectPathChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingObjectPathChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingObjectPathChannel");
static_assert(sizeof(UMovieSceneScriptingObjectPathChannel) == 0x000060, "Wrong size on UMovieSceneScriptingObjectPathChannel");

// Class SequencerScripting.MovieSceneScriptingStringKey
// 0x0020 (0x0060 - 0x0040)
class UMovieSceneScriptingStringKey final : public UMovieSceneScriptingKey
{
public:
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetTime(const struct FFrameNumber& NewFrameNumber, float SubFrame, ESequenceTimeUnit TimeUnit);
	void SetValue(const class FString& InNewValue);

	struct FFrameTime GetTime(ESequenceTimeUnit TimeUnit) const;
	class FString GetValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingStringKey">();
	}
	static class UMovieSceneScriptingStringKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringKey>();
	}
};
static_assert(alignof(UMovieSceneScriptingStringKey) == 0x000008, "Wrong alignment on UMovieSceneScriptingStringKey");
static_assert(sizeof(UMovieSceneScriptingStringKey) == 0x000060, "Wrong size on UMovieSceneScriptingStringKey");

// Class SequencerScripting.MovieSceneScriptingStringChannel
// 0x0030 (0x0060 - 0x0030)
class UMovieSceneScriptingStringChannel final : public UMovieSceneScriptingChannel
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMovieSceneScriptingStringKey* AddKey(const struct FFrameNumber& InTime, const class FString& NewValue, float SubFrame, ESequenceTimeUnit TimeUnit);
	void RemoveDefault();
	void RemoveKey(class UMovieSceneScriptingKey* Key);
	void SetDefault(const class FString& InDefaultValue);

	class FString GetDefault() const;
	TArray<class UMovieSceneScriptingKey*> GetKeys() const;
	bool HasDefault() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneScriptingStringChannel">();
	}
	static class UMovieSceneScriptingStringChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneScriptingStringChannel>();
	}
};
static_assert(alignof(UMovieSceneScriptingStringChannel) == 0x000008, "Wrong alignment on UMovieSceneScriptingStringChannel");
static_assert(sizeof(UMovieSceneScriptingStringChannel) == 0x000060, "Wrong size on UMovieSceneScriptingStringChannel");

// Class SequencerScripting.MovieSceneSectionExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneSectionExtensions final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UMovieSceneScriptingChannel*> FindChannelsByType(class UMovieSceneSection* Section, TSubclassOf<class UMovieSceneScriptingChannel> ChannelType);
	static TArray<class UMovieSceneScriptingChannel*> GetAllChannels(class UMovieSceneSection* Section);
	static TArray<class UMovieSceneScriptingChannel*> GetChannels(class UMovieSceneSection* Section);
	static TArray<class UMovieSceneScriptingChannel*> GetChannelsByType(class UMovieSceneSection* Section, TSubclassOf<class UMovieSceneScriptingChannel> ChannelType);
	static int32 GetEndFrame(class UMovieSceneSection* Section);
	static float GetEndFrameSeconds(class UMovieSceneSection* Section);
	static int32 GetParentSequenceFrame(class UMovieSceneSubSection* Section, int32 InFrame, class UMovieSceneSequence* ParentSequence);
	static int32 GetStartFrame(class UMovieSceneSection* Section);
	static float GetStartFrameSeconds(class UMovieSceneSection* Section);
	static bool HasEndFrame(class UMovieSceneSection* Section);
	static bool HasStartFrame(class UMovieSceneSection* Section);
	static void SetEndFrame(class UMovieSceneSection* Section, int32 EndFrame);
	static void SetEndFrameBounded(class UMovieSceneSection* Section, bool bIsBounded);
	static void SetEndFrameSeconds(class UMovieSceneSection* Section, float EndTime);
	static void SetRange(class UMovieSceneSection* Section, int32 StartFrame, int32 EndFrame);
	static void SetRangeSeconds(class UMovieSceneSection* Section, float StartTime, float EndTime);
	static void SetStartFrame(class UMovieSceneSection* Section, int32 StartFrame);
	static void SetStartFrameBounded(class UMovieSceneSection* Section, bool bIsBounded);
	static void SetStartFrameSeconds(class UMovieSceneSection* Section, float StartTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSectionExtensions">();
	}
	static class UMovieSceneSectionExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSectionExtensions>();
	}
};
static_assert(alignof(UMovieSceneSectionExtensions) == 0x000008, "Wrong alignment on UMovieSceneSectionExtensions");
static_assert(sizeof(UMovieSceneSectionExtensions) == 0x000028, "Wrong size on UMovieSceneSectionExtensions");

// Class SequencerScripting.MovieSceneSequenceExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneSequenceExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 AddMarkedFrame(class UMovieSceneSequence* Sequence, const struct FMovieSceneMarkedFrame& InMarkedFrame);
	static class UMovieSceneTrack* AddMasterTrack(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType);
	static struct FSequencerBindingProxy AddPossessable(class UMovieSceneSequence* Sequence, class UObject* ObjectToPossess);
	static class UMovieSceneFolder* AddRootFolderToSequence(class UMovieSceneSequence* Sequence, const class FString& NewFolderName);
	static struct FSequencerBindingProxy AddSpawnableFromClass(class UMovieSceneSequence* Sequence, class UClass* ClassToSpawn);
	static struct FSequencerBindingProxy AddSpawnableFromInstance(class UMovieSceneSequence* Sequence, class UObject* ObjectToSpawn);
	static void DeleteMarkedFrame(class UMovieSceneSequence* Sequence, int32 DeleteIndex);
	static void DeleteMarkedFrames(class UMovieSceneSequence* Sequence);
	static struct FSequencerBindingProxy FindBindingById(class UMovieSceneSequence* Sequence, const struct FGuid& BindingID);
	static struct FSequencerBindingProxy FindBindingByName(class UMovieSceneSequence* Sequence, const class FString& Name_0);
	static int32 FindMarkedFrameByFrameNumber(class UMovieSceneSequence* Sequence, const struct FFrameNumber& InFrameNumber);
	static int32 FindMarkedFrameByLabel(class UMovieSceneSequence* Sequence, const class FString& InLabel);
	static TArray<class UMovieSceneTrack*> FindMasterTracksByExactType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType);
	static TArray<class UMovieSceneTrack*> FindMasterTracksByType(class UMovieSceneSequence* Sequence, TSubclassOf<class UMovieSceneTrack> TrackType);
	static int32 FindNextMarkedFrame(class UMovieSceneSequence* Sequence, const struct FFrameNumber& InFrameNumber, bool bForward);
	static struct FMovieSceneObjectBindingID GetBindingID(const struct FSequencerBindingProxy& InBinding);
	static TArray<struct FSequencerBindingProxy> GetBindings(class UMovieSceneSequence* Sequence);
	static EUpdateClockSource GetClockSource(class UMovieSceneSequence* InSequence);
	static struct FFrameRate GetDisplayRate(class UMovieSceneSequence* Sequence);
	static EMovieSceneEvaluationType GetEvaluationType(class UMovieSceneSequence* InSequence);
	static TArray<struct FMovieSceneMarkedFrame> GetMarkedFrames(class UMovieSceneSequence* Sequence);
	static TArray<class UMovieSceneTrack*> GetMasterTracks(class UMovieSceneSequence* Sequence);
	static class UMovieScene* GetMovieScene(class UMovieSceneSequence* Sequence);
	static int32 GetPlaybackEnd(class UMovieSceneSequence* Sequence);
	static float GetPlaybackEndSeconds(class UMovieSceneSequence* Sequence);
	static struct FSequencerScriptingRange GetPlaybackRange(class UMovieSceneSequence* Sequence);
	static int32 GetPlaybackStart(class UMovieSceneSequence* Sequence);
	static float GetPlaybackStartSeconds(class UMovieSceneSequence* Sequence);
	static struct FMovieSceneObjectBindingID GetPortableBindingID(class UMovieSceneSequence* MasterSequence, class UMovieSceneSequence* DestinationSequence, const struct FSequencerBindingProxy& InBinding);
	static TArray<struct FSequencerBindingProxy> GetPossessables(class UMovieSceneSequence* Sequence);
	static TArray<class UMovieSceneFolder*> GetRootFoldersInSequence(class UMovieSceneSequence* Sequence);
	static TArray<struct FSequencerBindingProxy> GetSpawnables(class UMovieSceneSequence* Sequence);
	static struct FFrameRate GetTickResolution(class UMovieSceneSequence* Sequence);
	static struct FTimecode GetTimecodeSource(class UMovieSceneSequence* Sequence);
	static float GetViewRangeEnd(class UMovieSceneSequence* InSequence);
	static float GetViewRangeStart(class UMovieSceneSequence* InSequence);
	static float GetWorkRangeEnd(class UMovieSceneSequence* InSequence);
	static float GetWorkRangeStart(class UMovieSceneSequence* InSequence);
	static bool IsReadOnly(class UMovieSceneSequence* Sequence);
	static TArray<class UObject*> LocateBoundObjects(class UMovieSceneSequence* Sequence, const struct FSequencerBindingProxy& InBinding, class UObject* Context);
	static struct FMovieSceneObjectBindingID MakeBindingID(class UMovieSceneSequence* MasterSequence, const struct FSequencerBindingProxy& InBinding, EMovieSceneObjectBindingSpace Space);
	static struct FSequencerScriptingRange MakeRange(class UMovieSceneSequence* Sequence, int32 StartFrame, int32 Duration);
	static struct FSequencerScriptingRange MakeRangeSeconds(class UMovieSceneSequence* Sequence, float StartTime, float Duration);
	static bool RemoveMasterTrack(class UMovieSceneSequence* Sequence, class UMovieSceneTrack* MasterTrack);
	static struct FSequencerBindingProxy ResolveBindingID(class UMovieSceneSequence* MasterSequence, const struct FMovieSceneObjectBindingID& InObjectBindingID);
	static void SetClockSource(class UMovieSceneSequence* InSequence, EUpdateClockSource InClockSource);
	static void SetDisplayRate(class UMovieSceneSequence* Sequence, const struct FFrameRate& DisplayRate);
	static void SetEvaluationType(class UMovieSceneSequence* InSequence, EMovieSceneEvaluationType InEvaluationType);
	static void SetMarkedFrame(class UMovieSceneSequence* Sequence, int32 InMarkIndex, const struct FFrameNumber& InFrameNumber);
	static void SetPlaybackEnd(class UMovieSceneSequence* Sequence, int32 EndFrame);
	static void SetPlaybackEndSeconds(class UMovieSceneSequence* Sequence, float EndTime);
	static void SetPlaybackStart(class UMovieSceneSequence* Sequence, int32 StartFrame);
	static void SetPlaybackStartSeconds(class UMovieSceneSequence* Sequence, float StartTime);
	static void SetReadOnly(class UMovieSceneSequence* Sequence, bool bInReadOnly);
	static void SetTickResolution(class UMovieSceneSequence* Sequence, const struct FFrameRate& TickResolution);
	static void SetTickResolutionDirectly(class UMovieSceneSequence* Sequence, const struct FFrameRate& TickResolution);
	static void SetViewRangeEnd(class UMovieSceneSequence* InSequence, float EndTimeInSeconds);
	static void SetViewRangeStart(class UMovieSceneSequence* InSequence, float StartTimeInSeconds);
	static void SetWorkRangeEnd(class UMovieSceneSequence* InSequence, float EndTimeInSeconds);
	static void SetWorkRangeStart(class UMovieSceneSequence* InSequence, float StartTimeInSeconds);
	static void SortMarkedFrames(class UMovieSceneSequence* Sequence);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneSequenceExtensions">();
	}
	static class UMovieSceneSequenceExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneSequenceExtensions>();
	}
};
static_assert(alignof(UMovieSceneSequenceExtensions) == 0x000008, "Wrong alignment on UMovieSceneSequenceExtensions");
static_assert(sizeof(UMovieSceneSequenceExtensions) == 0x000028, "Wrong size on UMovieSceneSequenceExtensions");

// Class SequencerScripting.MovieSceneTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static class UMovieSceneSection* AddSection(class UMovieSceneTrack* Track);
	static struct FColor GetColorTint(class UMovieSceneTrack* Track);
	static class FText GetDisplayName(class UMovieSceneTrack* Track);
	static TArray<class UMovieSceneSection*> GetSections(class UMovieSceneTrack* Track);
	static class UMovieSceneSection* GetSectionToKey(class UMovieSceneTrack* Track);
	static int32 GetSortingOrder(class UMovieSceneTrack* Track);
	static class FText GetTrackRowDisplayName(class UMovieSceneTrack* Track, int32 RowIndex);
	static void RemoveSection(class UMovieSceneTrack* Track, class UMovieSceneSection* Section);
	static void SetColorTint(class UMovieSceneTrack* Track, const struct FColor& ColorTint);
	static void SetDisplayName(class UMovieSceneTrack* Track, const class FText& InName);
	static void SetSectionToKey(class UMovieSceneTrack* Track, class UMovieSceneSection* Section);
	static void SetSortingOrder(class UMovieSceneTrack* Track, int32 SortingOrder);
	static void SetTrackRowDisplayName(class UMovieSceneTrack* Track, const class FText& InName, int32 RowIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneTrackExtensions">();
	}
	static class UMovieSceneTrackExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneTrackExtensions");
static_assert(sizeof(UMovieSceneTrackExtensions) == 0x000028, "Wrong size on UMovieSceneTrackExtensions");

// Class SequencerScripting.MovieSceneFloatVectorTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneFloatVectorTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetNumChannelsUsed(class UMovieSceneFloatVectorTrack* Track);
	static void SetNumChannelsUsed(class UMovieSceneFloatVectorTrack* Track, int32 InNumChannelsUsed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneFloatVectorTrackExtensions">();
	}
	static class UMovieSceneFloatVectorTrackExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneFloatVectorTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneFloatVectorTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneFloatVectorTrackExtensions");
static_assert(sizeof(UMovieSceneFloatVectorTrackExtensions) == 0x000028, "Wrong size on UMovieSceneFloatVectorTrackExtensions");

// Class SequencerScripting.MovieSceneDoubleVectorTrackExtensions
// 0x0000 (0x0028 - 0x0028)
class UMovieSceneDoubleVectorTrackExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetNumChannelsUsed(class UMovieSceneDoubleVectorTrack* Track);
	static void SetNumChannelsUsed(class UMovieSceneDoubleVectorTrack* Track, int32 InNumChannelsUsed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneDoubleVectorTrackExtensions">();
	}
	static class UMovieSceneDoubleVectorTrackExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneDoubleVectorTrackExtensions>();
	}
};
static_assert(alignof(UMovieSceneDoubleVectorTrackExtensions) == 0x000008, "Wrong alignment on UMovieSceneDoubleVectorTrackExtensions");
static_assert(sizeof(UMovieSceneDoubleVectorTrackExtensions) == 0x000028, "Wrong size on UMovieSceneDoubleVectorTrackExtensions");

// Class SequencerScripting.SequencerScriptingRangeExtensions
// 0x0000 (0x0028 - 0x0028)
class USequencerScriptingRangeExtensions final : public UBlueprintFunctionLibrary
{
public:
	static int32 GetEndFrame(const struct FSequencerScriptingRange& Range);
	static float GetEndSeconds(const struct FSequencerScriptingRange& Range);
	static int32 GetStartFrame(const struct FSequencerScriptingRange& Range);
	static float GetStartSeconds(const struct FSequencerScriptingRange& Range);
	static bool HasEnd(const struct FSequencerScriptingRange& Range);
	static bool HasStart(const struct FSequencerScriptingRange& Range);
	static void RemoveEnd(struct FSequencerScriptingRange& Range);
	static void RemoveStart(struct FSequencerScriptingRange& Range);
	static void SetEndFrame(struct FSequencerScriptingRange& Range, int32 End);
	static void SetEndSeconds(struct FSequencerScriptingRange& Range, float End);
	static void SetStartFrame(struct FSequencerScriptingRange& Range, int32 Start);
	static void SetStartSeconds(struct FSequencerScriptingRange& Range, float Start);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SequencerScriptingRangeExtensions">();
	}
	static class USequencerScriptingRangeExtensions* GetDefaultObj()
	{
		return GetDefaultObjImpl<USequencerScriptingRangeExtensions>();
	}
};
static_assert(alignof(USequencerScriptingRangeExtensions) == 0x000008, "Wrong alignment on USequencerScriptingRangeExtensions");
static_assert(sizeof(USequencerScriptingRangeExtensions) == 0x000028, "Wrong size on USequencerScriptingRangeExtensions");

}

