#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkeletalMerging

#include "Basic.hpp"

#include "SkeletalMerging_structs.hpp"


namespace SDK::Params
{

// Function SkeletalMerging.SkeletalMergingLibrary.MergeMeshes
// 0x0048 (0x0048 - 0x0000)
struct SkeletalMergingLibrary_MergeMeshes final
{
public:
	struct FSkeletalMeshMergeParams               Params_0;                                          // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkeletalMergingLibrary_MergeMeshes) == 0x000008, "Wrong alignment on SkeletalMergingLibrary_MergeMeshes");
static_assert(sizeof(SkeletalMergingLibrary_MergeMeshes) == 0x000048, "Wrong size on SkeletalMergingLibrary_MergeMeshes");
static_assert(offsetof(SkeletalMergingLibrary_MergeMeshes, Params_0) == 0x000000, "Member 'SkeletalMergingLibrary_MergeMeshes::Params_0' has a wrong offset!");
static_assert(offsetof(SkeletalMergingLibrary_MergeMeshes, ReturnValue) == 0x000040, "Member 'SkeletalMergingLibrary_MergeMeshes::ReturnValue' has a wrong offset!");

// Function SkeletalMerging.SkeletalMergingLibrary.MergeSkeletons
// 0x0020 (0x0020 - 0x0000)
struct SkeletalMergingLibrary_MergeSkeletons final
{
public:
	struct FSkeletonMergeParams                   Params_0;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USkeleton*                              ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SkeletalMergingLibrary_MergeSkeletons) == 0x000008, "Wrong alignment on SkeletalMergingLibrary_MergeSkeletons");
static_assert(sizeof(SkeletalMergingLibrary_MergeSkeletons) == 0x000020, "Wrong size on SkeletalMergingLibrary_MergeSkeletons");
static_assert(offsetof(SkeletalMergingLibrary_MergeSkeletons, Params_0) == 0x000000, "Member 'SkeletalMergingLibrary_MergeSkeletons::Params_0' has a wrong offset!");
static_assert(offsetof(SkeletalMergingLibrary_MergeSkeletons, ReturnValue) == 0x000018, "Member 'SkeletalMergingLibrary_MergeSkeletons::ReturnValue' has a wrong offset!");

}

