#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkyLight_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct SkyLight_Parameters.SkyLight_Parameters
// 0x00A0 (0x00A0 - 0x0000)
struct FSkyLight_Parameters final
{
public:
	class FString                                 GIEvalSkyLight_8_88EC9CBF40393B83BEDA22BB48A2B4CD; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableRTSkyLight_9_EEE1CC6A47D2E47508784A94A05AA80F; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 EnableSkyLightDenoiser_10_640DC6C94DF5030E3BDF69AA07720EEF; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightEnableTwoSidedGeomtry_11_E5C3B38F423C10ECE9207C8B9031AEB7; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightMaxRayDistance_12_5399303843881FD92F8337BF45C730CF; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightSPP_13_2D3640B64C7D0103C812CB8533C87237;   // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightEnableMaterials_14_302F08D048720E799343BDB5D30E9479; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherSkyLightIntensity_18_E1A9004942D802B91427469CF88EB838; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 FinalGatherSkyLightIndirectMultiplier_19_C397D4FF42305F4582CEEF8263868ABF; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SkyLightScreenPercentage_23_59F3CFEA490786A67F0AB6B16115C3E4; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(FSkyLight_Parameters) == 0x000008, "Wrong alignment on FSkyLight_Parameters");
static_assert(sizeof(FSkyLight_Parameters) == 0x0000A0, "Wrong size on FSkyLight_Parameters");
static_assert(offsetof(FSkyLight_Parameters, GIEvalSkyLight_8_88EC9CBF40393B83BEDA22BB48A2B4CD) == 0x000000, "Member 'FSkyLight_Parameters::GIEvalSkyLight_8_88EC9CBF40393B83BEDA22BB48A2B4CD' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, EnableRTSkyLight_9_EEE1CC6A47D2E47508784A94A05AA80F) == 0x000010, "Member 'FSkyLight_Parameters::EnableRTSkyLight_9_EEE1CC6A47D2E47508784A94A05AA80F' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, EnableSkyLightDenoiser_10_640DC6C94DF5030E3BDF69AA07720EEF) == 0x000020, "Member 'FSkyLight_Parameters::EnableSkyLightDenoiser_10_640DC6C94DF5030E3BDF69AA07720EEF' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, SkyLightEnableTwoSidedGeomtry_11_E5C3B38F423C10ECE9207C8B9031AEB7) == 0x000030, "Member 'FSkyLight_Parameters::SkyLightEnableTwoSidedGeomtry_11_E5C3B38F423C10ECE9207C8B9031AEB7' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, SkyLightMaxRayDistance_12_5399303843881FD92F8337BF45C730CF) == 0x000040, "Member 'FSkyLight_Parameters::SkyLightMaxRayDistance_12_5399303843881FD92F8337BF45C730CF' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, SkyLightSPP_13_2D3640B64C7D0103C812CB8533C87237) == 0x000050, "Member 'FSkyLight_Parameters::SkyLightSPP_13_2D3640B64C7D0103C812CB8533C87237' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, SkyLightEnableMaterials_14_302F08D048720E799343BDB5D30E9479) == 0x000060, "Member 'FSkyLight_Parameters::SkyLightEnableMaterials_14_302F08D048720E799343BDB5D30E9479' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, FinalGatherSkyLightIntensity_18_E1A9004942D802B91427469CF88EB838) == 0x000070, "Member 'FSkyLight_Parameters::FinalGatherSkyLightIntensity_18_E1A9004942D802B91427469CF88EB838' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, FinalGatherSkyLightIndirectMultiplier_19_C397D4FF42305F4582CEEF8263868ABF) == 0x000080, "Member 'FSkyLight_Parameters::FinalGatherSkyLightIndirectMultiplier_19_C397D4FF42305F4582CEEF8263868ABF' has a wrong offset!");
static_assert(offsetof(FSkyLight_Parameters, SkyLightScreenPercentage_23_59F3CFEA490786A67F0AB6B16115C3E4) == 0x000090, "Member 'FSkyLight_Parameters::SkyLightScreenPercentage_23_59F3CFEA490786A67F0AB6B16115C3E4' has a wrong offset!");

}

