#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SlateCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SlateCore.ECheckBoxState
// NumValues: 0x0004
enum class ECheckBoxState : uint8
{
	Unchecked                                = 0,
	Checked                                  = 1,
	Undetermined                             = 2,
	ECheckBoxState_MAX                       = 3,
};

// Enum SlateCore.EWidgetClipping
// NumValues: 0x0006
enum class EWidgetClipping : uint8
{
	Inherit                                  = 0,
	ClipToBounds                             = 1,
	ClipToBoundsWithoutIntersecting          = 2,
	ClipToBoundsAlways                       = 3,
	OnDemand                                 = 4,
	EWidgetClipping_MAX                      = 5,
};

// Enum SlateCore.EPixelSnappingMethod
// NumValues: 0x0004
enum class EPixelSnappingMethod : uint8
{
	Inherit                                  = 0,
	Disabled                                 = 1,
	SnapToPixel                              = 2,
	EPixelSnappingMethod_MAX                 = 3,
};

// Enum SlateCore.ESlateBrushImageType
// NumValues: 0x0005
enum class ESlateBrushImageType : uint8
{
	NoImage                                  = 0,
	FullColor                                = 1,
	Linear                                   = 2,
	Vector                                   = 3,
	ESlateBrushImageType_MAX                 = 4,
};

// Enum SlateCore.ESlateBrushMirrorType
// NumValues: 0x0005
enum class ESlateBrushMirrorType : uint8
{
	NoMirror                                 = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushMirrorType_MAX                = 4,
};

// Enum SlateCore.ESlateBrushTileType
// NumValues: 0x0005
enum class ESlateBrushTileType : uint8
{
	NoTile                                   = 0,
	Horizontal                               = 1,
	Vertical                                 = 2,
	Both                                     = 3,
	ESlateBrushTileType_MAX                  = 4,
};

// Enum SlateCore.ESlateBrushDrawType
// NumValues: 0x0006
enum class ESlateBrushDrawType : uint8
{
	NoDrawType                               = 0,
	Box                                      = 1,
	Border                                   = 2,
	Image                                    = 3,
	RoundedBox                               = 4,
	ESlateBrushDrawType_MAX                  = 5,
};

// Enum SlateCore.ESlateBrushRoundingType
// NumValues: 0x0003
enum class ESlateBrushRoundingType : uint8
{
	FixedRadius                              = 0,
	HalfHeightRadius                         = 1,
	ESlateBrushRoundingType_MAX              = 2,
};

// Enum SlateCore.ESlateColorStylingMode
// NumValues: 0x0006
enum class ESlateColorStylingMode : uint8
{
	UseColor_Specified                       = 0,
	UseColor_ColorTable                      = 1,
	UseColor_Foreground                      = 2,
	UseColor_Foreground_Subdued              = 3,
	UseColor_UseStyle                        = 4,
	UseColor_MAX                             = 5,
};

// Enum SlateCore.EUINavigationRule
// NumValues: 0x0008
enum class EUINavigationRule : uint8
{
	Escape                                   = 0,
	Explicit                                 = 1,
	Wrap                                     = 2,
	Stop                                     = 3,
	Custom                                   = 4,
	CustomBoundary                           = 5,
	Invalid                                  = 6,
	EUINavigationRule_MAX                    = 7,
};

// Enum SlateCore.EUINavigation
// NumValues: 0x0009
enum class EUINavigation : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	Next                                     = 4,
	Previous                                 = 5,
	Num                                      = 6,
	Invalid                                  = 7,
	EUINavigation_MAX                        = 8,
};

// Enum SlateCore.EFlowDirectionPreference
// NumValues: 0x0005
enum class EFlowDirectionPreference : uint8
{
	Inherit                                  = 0,
	Culture                                  = 1,
	LeftToRight                              = 2,
	RightToLeft                              = 3,
	EFlowDirectionPreference_MAX             = 4,
};

// Enum SlateCore.ESelectInfo
// NumValues: 0x0005
enum class ESelectInfo : uint8
{
	OnKeyPress                               = 0,
	OnNavigation                             = 1,
	OnMouseClick                             = 2,
	Direct                                   = 3,
	ESelectInfo_MAX                          = 4,
};

// Enum SlateCore.EVerticalAlignment
// NumValues: 0x0005
enum class EVerticalAlignment : uint8
{
	VAlign_Fill                              = 0,
	VAlign_Top                               = 1,
	VAlign_Center                            = 2,
	VAlign_Bottom                            = 3,
	VAlign_MAX                               = 4,
};

// Enum SlateCore.EGSSoftShadowType
// NumValues: 0x0007
enum class EGSSoftShadowType : uint8
{
	EGSSoftShadowNone                        = 0,
	EGSSoftShadowBlur                        = 1,
	EGSSoftShadowDistanceField               = 2,
	EGSSoftShadowDistanceField_BySum         = 3,
	EGSSoftShadowShader                      = 4,
	EGSSoftShadowHard                        = 5,
	EGSSoftShadowType_MAX                    = 6,
};

// Enum SlateCore.ETextCommit
// NumValues: 0x0005
enum class ETextCommit : uint8
{
	Default                                  = 0,
	OnEnter                                  = 1,
	OnUserMovedFocus                         = 2,
	OnCleared                                = 3,
	ETextCommit_MAX                          = 4,
};

// Enum SlateCore.ETextOverflowPolicy
// NumValues: 0x0003
enum class ETextOverflowPolicy : uint8
{
	Clip                                     = 0,
	Ellipsis                                 = 1,
	ETextOverflowPolicy_MAX                  = 2,
};

// Enum SlateCore.ETextShapingMethod
// NumValues: 0x0004
enum class ETextShapingMethod : uint8
{
	Auto                                     = 0,
	KerningOnly                              = 1,
	FullShaping                              = 2,
	ETextShapingMethod_MAX                   = 3,
};

// Enum SlateCore.ETextTransformPolicy
// NumValues: 0x0004
enum class ETextTransformPolicy : uint8
{
	None                                     = 0,
	ToLower                                  = 1,
	ToUpper                                  = 2,
	ETextTransformPolicy_MAX                 = 3,
};

// Enum SlateCore.EMenuPlacement
// NumValues: 0x000E
enum class EMenuPlacement : uint8
{
	MenuPlacement_BelowAnchor                = 0,
	MenuPlacement_CenteredBelowAnchor        = 1,
	MenuPlacement_BelowRightAnchor           = 2,
	MenuPlacement_ComboBox                   = 3,
	MenuPlacement_ComboBoxRight              = 4,
	MenuPlacement_MenuRight                  = 5,
	MenuPlacement_AboveAnchor                = 6,
	MenuPlacement_CenteredAboveAnchor        = 7,
	MenuPlacement_AboveRightAnchor           = 8,
	MenuPlacement_MenuLeft                   = 9,
	MenuPlacement_Center                     = 10,
	MenuPlacement_RightLeftCenter            = 11,
	MenuPlacement_MatchBottomLeft            = 12,
	MenuPlacement_MAX                        = 13,
};

// Enum SlateCore.EColorVisionDeficiency
// NumValues: 0x0005
enum class EColorVisionDeficiency : uint8
{
	NormalVision                             = 0,
	Deuteranope                              = 1,
	Protanope                                = 2,
	Tritanope                                = 3,
	EColorVisionDeficiency_MAX               = 4,
};

// Enum SlateCore.EHorizontalAlignment
// NumValues: 0x0005
enum class EHorizontalAlignment : uint8
{
	HAlign_Fill                              = 0,
	HAlign_Left                              = 1,
	HAlign_Center                            = 2,
	HAlign_Right                             = 3,
	HAlign_MAX                               = 4,
};

// Enum SlateCore.EFontHinting
// NumValues: 0x0006
enum class EFontHinting : uint8
{
	Default                                  = 0,
	Auto                                     = 1,
	AutoLight                                = 2,
	Monochrome                               = 3,
	None                                     = 4,
	EFontHinting_MAX                         = 5,
};

// Enum SlateCore.EFontLoadingPolicy
// NumValues: 0x0004
enum class EFontLoadingPolicy : uint8
{
	LazyLoad                                 = 0,
	Stream                                   = 1,
	Inline                                   = 2,
	EFontLoadingPolicy_MAX                   = 3,
};

// Enum SlateCore.EFontLayoutMethod
// NumValues: 0x0003
enum class EFontLayoutMethod : uint8
{
	Metrics                                  = 0,
	BoundingBox                              = 1,
	EFontLayoutMethod_MAX                    = 2,
};

// Enum SlateCore.EFocusCause
// NumValues: 0x0007
enum class EFocusCause : uint8
{
	Mouse                                    = 0,
	Navigation                               = 1,
	SetDirectly                              = 2,
	Cleared                                  = 3,
	OtherWidgetLostFocus                     = 4,
	WindowActivate                           = 5,
	EFocusCause_MAX                          = 6,
};

// Enum SlateCore.ESlateDebuggingInputEvent
// NumValues: 0x001B
enum class ESlateDebuggingInputEvent : uint8
{
	MouseMove                                = 0,
	MouseEnter                               = 1,
	MouseLeave                               = 2,
	PreviewMouseButtonDown                   = 3,
	MouseButtonDown                          = 4,
	MouseButtonUp                            = 5,
	MouseButtonDoubleClick                   = 6,
	MouseWheel                               = 7,
	TouchStart                               = 8,
	TouchEnd                                 = 9,
	TouchForceChanged                        = 10,
	TouchFirstMove                           = 11,
	TouchMoved                               = 12,
	DragDetected                             = 13,
	DragEnter                                = 14,
	DragLeave                                = 15,
	DragOver                                 = 16,
	DragDrop                                 = 17,
	DropMessage                              = 18,
	PreviewKeyDown                           = 19,
	KeyDown                                  = 20,
	KeyUp                                    = 21,
	KeyChar                                  = 22,
	AnalogInput                              = 23,
	TouchGesture                             = 24,
	MotionDetected                           = 25,
	MAX                                      = 26,
};

// Enum SlateCore.ESlateDebuggingStateChangeEvent
// NumValues: 0x0003
enum class ESlateDebuggingStateChangeEvent : uint8
{
	MouseCaptureGained                       = 0,
	MouseCaptureLost                         = 1,
	ESlateDebuggingStateChangeEvent_MAX      = 2,
};

// Enum SlateCore.ESlateDebuggingNavigationMethod
// NumValues: 0x0007
enum class ESlateDebuggingNavigationMethod : uint8
{
	Unknown                                  = 0,
	Explicit                                 = 1,
	CustomDelegateBound                      = 2,
	CustomDelegateUnbound                    = 3,
	NextOrPrevious                           = 4,
	HitTestGrid                              = 5,
	ESlateDebuggingNavigationMethod_MAX      = 6,
};

// Enum SlateCore.ESlateDebuggingFocusEvent
// NumValues: 0x0004
enum class ESlateDebuggingFocusEvent : uint8
{
	FocusChanging                            = 0,
	FocusLost                                = 1,
	FocusReceived                            = 2,
	MAX                                      = 3,
};

// Enum SlateCore.EButtonClickMethod
// NumValues: 0x0005
enum class EButtonClickMethod : uint8
{
	DownAndUp                                = 0,
	MouseDown                                = 1,
	MouseUp                                  = 2,
	PreciseClick                             = 3,
	EButtonClickMethod_MAX                   = 4,
};

// Enum SlateCore.EButtonTouchMethod
// NumValues: 0x0004
enum class EButtonTouchMethod : uint8
{
	DownAndUp                                = 0,
	Down                                     = 1,
	PreciseTap                               = 2,
	EButtonTouchMethod_MAX                   = 3,
};

// Enum SlateCore.EButtonPressMethod
// NumValues: 0x0004
enum class EButtonPressMethod : uint8
{
	DownAndUp                                = 0,
	ButtonPress                              = 1,
	ButtonRelease                            = 2,
	EButtonPressMethod_MAX                   = 3,
};

// Enum SlateCore.EUINavigationAction
// NumValues: 0x0005
enum class EUINavigationAction : uint8
{
	Accept                                   = 0,
	Back                                     = 1,
	Num                                      = 2,
	Invalid                                  = 3,
	EUINavigationAction_MAX                  = 4,
};

// Enum SlateCore.ENavigationSource
// NumValues: 0x0003
enum class ENavigationSource : uint8
{
	FocusedWidget                            = 0,
	WidgetUnderCursor                        = 1,
	ENavigationSource_MAX                    = 2,
};

// Enum SlateCore.ENavigationGenesis
// NumValues: 0x0004
enum class ENavigationGenesis : uint8
{
	Keyboard                                 = 0,
	Controller                               = 1,
	User                                     = 2,
	ENavigationGenesis_MAX                   = 3,
};

// Enum SlateCore.EOrientation
// NumValues: 0x0003
enum class EOrientation : uint8
{
	Orient_Horizontal                        = 0,
	Orient_Vertical                          = 1,
	Orient_MAX                               = 2,
};

// Enum SlateCore.EScrollDirection
// NumValues: 0x0003
enum class EScrollDirection : uint8
{
	Scroll_Down                              = 0,
	Scroll_Up                                = 1,
	Scroll_MAX                               = 2,
};

// Enum SlateCore.EConsumeMouseWheel
// NumValues: 0x0004
enum class EConsumeMouseWheel : uint8
{
	WhenScrollingPossible                    = 0,
	Always                                   = 1,
	Never                                    = 2,
	EConsumeMouseWheel_MAX                   = 3,
};

// Enum SlateCore.ESlateParentWindowSearchMethod
// NumValues: 0x0003
enum class ESlateParentWindowSearchMethod : uint8
{
	ActiveWindow                             = 0,
	MainWindow                               = 1,
	ESlateParentWindowSearchMethod_MAX       = 2,
};

// Enum SlateCore.ESlateCheckBoxType
// NumValues: 0x0003
enum class ESlateCheckBoxType : uint8
{
	CheckBox                                 = 0,
	ToggleButton                             = 1,
	ESlateCheckBoxType_MAX                   = 2,
};

// Enum SlateCore.EStyleColor
// NumValues: 0x003E
enum class EStyleColor : uint8
{
	Black                                    = 0,
	Background                               = 1,
	Title                                    = 2,
	WindowBorder                             = 3,
	Foldout                                  = 4,
	Input                                    = 5,
	InputOutline                             = 6,
	Recessed                                 = 7,
	Panel                                    = 8,
	Header                                   = 9,
	Dropdown                                 = 10,
	DropdownOutline                          = 11,
	Hover                                    = 12,
	Hover2                                   = 13,
	White                                    = 14,
	White25                                  = 15,
	Highlight                                = 16,
	Primary                                  = 17,
	PrimaryHover                             = 18,
	PrimaryPress                             = 19,
	Secondary                                = 20,
	Foreground                               = 21,
	ForegroundHover                          = 22,
	ForegroundInverted                       = 23,
	ForegroundHeader                         = 24,
	Select                                   = 25,
	SelectInactive                           = 26,
	SelectParent                             = 27,
	SelectHover                              = 28,
	Notifications                            = 29,
	AccentBlue                               = 30,
	AccentPurple                             = 31,
	AccentPink                               = 32,
	AccentRed                                = 33,
	AccentOrange                             = 34,
	AccentYellow                             = 35,
	AccentGreen                              = 36,
	AccentBrown                              = 37,
	AccentBlack                              = 38,
	AccentGray                               = 39,
	AccentWhite                              = 40,
	AccentFolder                             = 41,
	Warning                                  = 42,
	Error                                    = 43,
	Success                                  = 44,
	User1                                    = 45,
	User2                                    = 46,
	User3                                    = 47,
	User4                                    = 48,
	User5                                    = 49,
	User6                                    = 50,
	User7                                    = 51,
	User8                                    = 52,
	User9                                    = 53,
	User10                                   = 54,
	User11                                   = 55,
	User12                                   = 56,
	User13                                   = 57,
	User14                                   = 58,
	User15                                   = 59,
	User16                                   = 60,
	MAX                                      = 61,
};

// ScriptStruct SlateCore.Geometry
// 0x0040 (0x0040 - 0x0000)
struct alignas(0x08) FGeometry final
{
public:
	uint8                                         Pad_0[0x40];                                       // 0x0000(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FGeometry) == 0x000008, "Wrong alignment on FGeometry");
static_assert(sizeof(FGeometry) == 0x000040, "Wrong size on FGeometry");

// ScriptStruct SlateCore.SlateColor
// 0x0014 (0x0014 - 0x0000)
struct FSlateColor final
{
public:
	struct FLinearColor                           SpecifiedColor;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ESlateColorStylingMode                        ColorUseRule;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateColor) == 0x000004, "Wrong alignment on FSlateColor");
static_assert(sizeof(FSlateColor) == 0x000014, "Wrong size on FSlateColor");
static_assert(offsetof(FSlateColor, SpecifiedColor) == 0x000000, "Member 'FSlateColor::SpecifiedColor' has a wrong offset!");
static_assert(offsetof(FSlateColor, ColorUseRule) == 0x000010, "Member 'FSlateColor::ColorUseRule' has a wrong offset!");

// ScriptStruct SlateCore.Margin
// 0x0010 (0x0010 - 0x0000)
struct FMargin final
{
public:
	float                                         Left;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Top;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Bottom;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMargin) == 0x000004, "Wrong alignment on FMargin");
static_assert(sizeof(FMargin) == 0x000010, "Wrong size on FMargin");
static_assert(offsetof(FMargin, Left) == 0x000000, "Member 'FMargin::Left' has a wrong offset!");
static_assert(offsetof(FMargin, Top) == 0x000004, "Member 'FMargin::Top' has a wrong offset!");
static_assert(offsetof(FMargin, Right) == 0x000008, "Member 'FMargin::Right' has a wrong offset!");
static_assert(offsetof(FMargin, Bottom) == 0x00000C, "Member 'FMargin::Bottom' has a wrong offset!");

// ScriptStruct SlateCore.SlateBrushOutlineSettings
// 0x0040 (0x0040 - 0x0000)
struct FSlateBrushOutlineSettings final
{
public:
	struct FVector4                               CornerRadii;                                       // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            Color;                                             // 0x0020(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Width;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushRoundingType                       RoundingType;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseBrushTransparency;                             // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateBrushOutlineSettings) == 0x000010, "Wrong alignment on FSlateBrushOutlineSettings");
static_assert(sizeof(FSlateBrushOutlineSettings) == 0x000040, "Wrong size on FSlateBrushOutlineSettings");
static_assert(offsetof(FSlateBrushOutlineSettings, CornerRadii) == 0x000000, "Member 'FSlateBrushOutlineSettings::CornerRadii' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, Color) == 0x000020, "Member 'FSlateBrushOutlineSettings::Color' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, Width) == 0x000034, "Member 'FSlateBrushOutlineSettings::Width' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, RoundingType) == 0x000038, "Member 'FSlateBrushOutlineSettings::RoundingType' has a wrong offset!");
static_assert(offsetof(FSlateBrushOutlineSettings, bUseBrushTransparency) == 0x000039, "Member 'FSlateBrushOutlineSettings::bUseBrushTransparency' has a wrong offset!");

// ScriptStruct SlateCore.SlateBrush
// 0x00D0 (0x00D0 - 0x0000)
struct FSlateBrush final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ImageSize;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                Margin;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateColor                            TintColor;                                         // 0x0030(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrushOutlineSettings             OutlineSettings;                                   // 0x0050(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UObject*                                ResourceObject;                                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ResourceName;                                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FBox2f                                 UVRegion;                                          // 0x00A0(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ESlateBrushDrawType                           DrawAs;                                            // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushTileType                           Tiling;                                            // 0x00B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushMirrorType                         Mirroring;                                         // 0x00B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateBrushImageType                          ImageType;                                         // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x10];                                      // 0x00B8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bIsDynamicallyLoaded : 1;                          // 0x00C8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bHasUObject : 1;                                   // 0x00C8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateBrush) == 0x000010, "Wrong alignment on FSlateBrush");
static_assert(sizeof(FSlateBrush) == 0x0000D0, "Wrong size on FSlateBrush");
static_assert(offsetof(FSlateBrush, ImageSize) == 0x000010, "Member 'FSlateBrush::ImageSize' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Margin) == 0x000020, "Member 'FSlateBrush::Margin' has a wrong offset!");
static_assert(offsetof(FSlateBrush, TintColor) == 0x000030, "Member 'FSlateBrush::TintColor' has a wrong offset!");
static_assert(offsetof(FSlateBrush, OutlineSettings) == 0x000050, "Member 'FSlateBrush::OutlineSettings' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ResourceObject) == 0x000090, "Member 'FSlateBrush::ResourceObject' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ResourceName) == 0x000098, "Member 'FSlateBrush::ResourceName' has a wrong offset!");
static_assert(offsetof(FSlateBrush, UVRegion) == 0x0000A0, "Member 'FSlateBrush::UVRegion' has a wrong offset!");
static_assert(offsetof(FSlateBrush, DrawAs) == 0x0000B4, "Member 'FSlateBrush::DrawAs' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Tiling) == 0x0000B5, "Member 'FSlateBrush::Tiling' has a wrong offset!");
static_assert(offsetof(FSlateBrush, Mirroring) == 0x0000B6, "Member 'FSlateBrush::Mirroring' has a wrong offset!");
static_assert(offsetof(FSlateBrush, ImageType) == 0x0000B7, "Member 'FSlateBrush::ImageType' has a wrong offset!");

// ScriptStruct SlateCore.SlateWidgetStyle
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FSlateWidgetStyle
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateWidgetStyle) == 0x000008, "Wrong alignment on FSlateWidgetStyle");
static_assert(sizeof(FSlateWidgetStyle) == 0x000008, "Wrong size on FSlateWidgetStyle");

// ScriptStruct SlateCore.ExpandableAreaStyle
// 0x01B8 (0x01C0 - 0x0008)
struct FExpandableAreaStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CollapsedImage;                                    // 0x0010(0x00D0)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ExpandedImage;                                     // 0x00E0(0x00D0)(Edit, NativeAccessSpecifierPublic)
	float                                         RolloutAnimationSeconds;                           // 0x01B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1B4[0xC];                                      // 0x01B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FExpandableAreaStyle) == 0x000010, "Wrong alignment on FExpandableAreaStyle");
static_assert(sizeof(FExpandableAreaStyle) == 0x0001C0, "Wrong size on FExpandableAreaStyle");
static_assert(offsetof(FExpandableAreaStyle, CollapsedImage) == 0x000010, "Member 'FExpandableAreaStyle::CollapsedImage' has a wrong offset!");
static_assert(offsetof(FExpandableAreaStyle, ExpandedImage) == 0x0000E0, "Member 'FExpandableAreaStyle::ExpandedImage' has a wrong offset!");
static_assert(offsetof(FExpandableAreaStyle, RolloutAnimationSeconds) == 0x0001B0, "Member 'FExpandableAreaStyle::RolloutAnimationSeconds' has a wrong offset!");

// ScriptStruct SlateCore.SlateSound
// 0x0018 (0x0018 - 0x0000)
struct FSlateSound final
{
public:
	class UObject*                                ResourceObject;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8[0x10];                                       // 0x0008(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateSound) == 0x000008, "Wrong alignment on FSlateSound");
static_assert(sizeof(FSlateSound) == 0x000018, "Wrong size on FSlateSound");
static_assert(offsetof(FSlateSound, ResourceObject) == 0x000000, "Member 'FSlateSound::ResourceObject' has a wrong offset!");

// ScriptStruct SlateCore.ButtonStyle
// 0x03E8 (0x03F0 - 0x0008)
struct FButtonStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Normal;                                            // 0x0010(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Hovered;                                           // 0x00E0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Pressed;                                           // 0x01B0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            Disabled;                                          // 0x0280(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            NormalForeground;                                  // 0x0350(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            HoveredForeground;                                 // 0x0364(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            PressedForeground;                                 // 0x0378(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateColor                            DisabledForeground;                                // 0x038C(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FMargin                                NormalPadding;                                     // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                PressedPadding;                                    // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PressedSlateSound;                                 // 0x03C0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            HoveredSlateSound;                                 // 0x03D8(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FButtonStyle) == 0x000010, "Wrong alignment on FButtonStyle");
static_assert(sizeof(FButtonStyle) == 0x0003F0, "Wrong size on FButtonStyle");
static_assert(offsetof(FButtonStyle, Normal) == 0x000010, "Member 'FButtonStyle::Normal' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Hovered) == 0x0000E0, "Member 'FButtonStyle::Hovered' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Pressed) == 0x0001B0, "Member 'FButtonStyle::Pressed' has a wrong offset!");
static_assert(offsetof(FButtonStyle, Disabled) == 0x000280, "Member 'FButtonStyle::Disabled' has a wrong offset!");
static_assert(offsetof(FButtonStyle, NormalForeground) == 0x000350, "Member 'FButtonStyle::NormalForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, HoveredForeground) == 0x000364, "Member 'FButtonStyle::HoveredForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedForeground) == 0x000378, "Member 'FButtonStyle::PressedForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, DisabledForeground) == 0x00038C, "Member 'FButtonStyle::DisabledForeground' has a wrong offset!");
static_assert(offsetof(FButtonStyle, NormalPadding) == 0x0003A0, "Member 'FButtonStyle::NormalPadding' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedPadding) == 0x0003B0, "Member 'FButtonStyle::PressedPadding' has a wrong offset!");
static_assert(offsetof(FButtonStyle, PressedSlateSound) == 0x0003C0, "Member 'FButtonStyle::PressedSlateSound' has a wrong offset!");
static_assert(offsetof(FButtonStyle, HoveredSlateSound) == 0x0003D8, "Member 'FButtonStyle::HoveredSlateSound' has a wrong offset!");

// ScriptStruct SlateCore.FontGSSoftShadowCfg
// 0x0024 (0x0024 - 0x0000)
struct FFontGSSoftShadowCfg final
{
public:
	bool                                          GSSoftShadowV2Layout;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGSSoftShadowType                             GSSoftShadowType;                                  // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GSSoftShadowSize;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              GSSoftShadowOffset;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GSSoftShadowFactor;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GSSoftShadowColor;                                 // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FFontGSSoftShadowCfg) == 0x000004, "Wrong alignment on FFontGSSoftShadowCfg");
static_assert(sizeof(FFontGSSoftShadowCfg) == 0x000024, "Wrong size on FFontGSSoftShadowCfg");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowV2Layout) == 0x000000, "Member 'FFontGSSoftShadowCfg::GSSoftShadowV2Layout' has a wrong offset!");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowType) == 0x000001, "Member 'FFontGSSoftShadowCfg::GSSoftShadowType' has a wrong offset!");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowSize) == 0x000004, "Member 'FFontGSSoftShadowCfg::GSSoftShadowSize' has a wrong offset!");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowOffset) == 0x000008, "Member 'FFontGSSoftShadowCfg::GSSoftShadowOffset' has a wrong offset!");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowFactor) == 0x000010, "Member 'FFontGSSoftShadowCfg::GSSoftShadowFactor' has a wrong offset!");
static_assert(offsetof(FFontGSSoftShadowCfg, GSSoftShadowColor) == 0x000014, "Member 'FFontGSSoftShadowCfg::GSSoftShadowColor' has a wrong offset!");

// ScriptStruct SlateCore.FontOutlineSettings
// 0x0048 (0x0048 - 0x0000)
struct FFontOutlineSettings final
{
public:
	int32                                         OutlineSize;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSeparateFillAlpha;                                // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyOutlineToDropShadows;                        // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                OutlineMaterial;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OutlineColor;                                      // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFontGSSoftShadowCfg                   GSSoftShadowCfg;                                   // 0x0020(0x0024)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFontOutlineSettings) == 0x000008, "Wrong alignment on FFontOutlineSettings");
static_assert(sizeof(FFontOutlineSettings) == 0x000048, "Wrong size on FFontOutlineSettings");
static_assert(offsetof(FFontOutlineSettings, OutlineSize) == 0x000000, "Member 'FFontOutlineSettings::OutlineSize' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, bSeparateFillAlpha) == 0x000004, "Member 'FFontOutlineSettings::bSeparateFillAlpha' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, bApplyOutlineToDropShadows) == 0x000005, "Member 'FFontOutlineSettings::bApplyOutlineToDropShadows' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, OutlineMaterial) == 0x000008, "Member 'FFontOutlineSettings::OutlineMaterial' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, OutlineColor) == 0x000010, "Member 'FFontOutlineSettings::OutlineColor' has a wrong offset!");
static_assert(offsetof(FFontOutlineSettings, GSSoftShadowCfg) == 0x000020, "Member 'FFontOutlineSettings::GSSoftShadowCfg' has a wrong offset!");

// ScriptStruct SlateCore.SlateFontInfo
// 0x0088 (0x0088 - 0x0000)
struct FSlateFontInfo final
{
public:
	class UObject*                                FontObject;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                FontMaterial;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGSIsWithFontUVExtend;                             // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFontOutlineSettings                   OutlineSettings;                                   // 0x0018(0x0048)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TypefaceFontName;                                  // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Size;                                              // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LetterSpacing;                                     // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FSlateFontInfo) == 0x000008, "Wrong alignment on FSlateFontInfo");
static_assert(sizeof(FSlateFontInfo) == 0x000088, "Wrong size on FSlateFontInfo");
static_assert(offsetof(FSlateFontInfo, FontObject) == 0x000000, "Member 'FSlateFontInfo::FontObject' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, FontMaterial) == 0x000008, "Member 'FSlateFontInfo::FontMaterial' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, bGSIsWithFontUVExtend) == 0x000010, "Member 'FSlateFontInfo::bGSIsWithFontUVExtend' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, OutlineSettings) == 0x000018, "Member 'FSlateFontInfo::OutlineSettings' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, TypefaceFontName) == 0x000070, "Member 'FSlateFontInfo::TypefaceFontName' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, Size) == 0x000078, "Member 'FSlateFontInfo::Size' has a wrong offset!");
static_assert(offsetof(FSlateFontInfo, LetterSpacing) == 0x00007C, "Member 'FSlateFontInfo::LetterSpacing' has a wrong offset!");

// ScriptStruct SlateCore.TextBlockStyle
// 0x0368 (0x0370 - 0x0008)
struct FTextBlockStyle final : public FSlateWidgetStyle
{
public:
	struct FSlateFontInfo                         Font;                                              // 0x0008(0x0088)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ColorAndOpacity;                                   // 0x0090(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              ShadowOffset;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ShadowColorAndOpacity;                             // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            SelectedBackgroundColor;                           // 0x00C8(0x0014)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            HighlightColor;                                    // 0x00DC(0x0014)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HighlightShape;                                    // 0x00F0(0x00D0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StrikeBrush;                                       // 0x01C0(0x00D0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FSlateBrush                            UnderlineBrush;                                    // 0x0290(0x00D0)(Edit, BlueprintVisible, AdvancedDisplay, NativeAccessSpecifierPublic)
	ETextTransformPolicy                          TransformPolicy;                                   // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextOverflowPolicy                           OverflowPolicy;                                    // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_362[0xE];                                      // 0x0362(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FTextBlockStyle) == 0x000010, "Wrong alignment on FTextBlockStyle");
static_assert(sizeof(FTextBlockStyle) == 0x000370, "Wrong size on FTextBlockStyle");
static_assert(offsetof(FTextBlockStyle, Font) == 0x000008, "Member 'FTextBlockStyle::Font' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ColorAndOpacity) == 0x000090, "Member 'FTextBlockStyle::ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ShadowOffset) == 0x0000A8, "Member 'FTextBlockStyle::ShadowOffset' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, ShadowColorAndOpacity) == 0x0000B8, "Member 'FTextBlockStyle::ShadowColorAndOpacity' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, SelectedBackgroundColor) == 0x0000C8, "Member 'FTextBlockStyle::SelectedBackgroundColor' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, HighlightColor) == 0x0000DC, "Member 'FTextBlockStyle::HighlightColor' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, HighlightShape) == 0x0000F0, "Member 'FTextBlockStyle::HighlightShape' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, StrikeBrush) == 0x0001C0, "Member 'FTextBlockStyle::StrikeBrush' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, UnderlineBrush) == 0x000290, "Member 'FTextBlockStyle::UnderlineBrush' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, TransformPolicy) == 0x000360, "Member 'FTextBlockStyle::TransformPolicy' has a wrong offset!");
static_assert(offsetof(FTextBlockStyle, OverflowPolicy) == 0x000361, "Member 'FTextBlockStyle::OverflowPolicy' has a wrong offset!");

// ScriptStruct SlateCore.HyperlinkStyle
// 0x0778 (0x0780 - 0x0008)
struct FHyperlinkStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           UnderlineStyle;                                    // 0x0010(0x03F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        TextStyle;                                         // 0x0400(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHyperlinkStyle) == 0x000010, "Wrong alignment on FHyperlinkStyle");
static_assert(sizeof(FHyperlinkStyle) == 0x000780, "Wrong size on FHyperlinkStyle");
static_assert(offsetof(FHyperlinkStyle, UnderlineStyle) == 0x000010, "Member 'FHyperlinkStyle::UnderlineStyle' has a wrong offset!");
static_assert(offsetof(FHyperlinkStyle, TextStyle) == 0x000400, "Member 'FHyperlinkStyle::TextStyle' has a wrong offset!");
static_assert(offsetof(FHyperlinkStyle, Padding) == 0x000770, "Member 'FHyperlinkStyle::Padding' has a wrong offset!");

// ScriptStruct SlateCore.InputEvent
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FInputEvent
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FInputEvent) == 0x000008, "Wrong alignment on FInputEvent");
static_assert(sizeof(FInputEvent) == 0x000018, "Wrong size on FInputEvent");

// ScriptStruct SlateCore.KeyEvent
// 0x0020 (0x0038 - 0x0018)
struct FKeyEvent : public FInputEvent
{
public:
	uint8                                         Pad_18[0x20];                                      // 0x0018(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FKeyEvent) == 0x000008, "Wrong alignment on FKeyEvent");
static_assert(sizeof(FKeyEvent) == 0x000038, "Wrong size on FKeyEvent");

// ScriptStruct SlateCore.ScrollBarStyle
// 0x0768 (0x0770 - 0x0008)
struct FScrollBarStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            HorizontalBackgroundImage;                         // 0x0010(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBackgroundImage;                           // 0x00E0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalTopSlotImage;                              // 0x01B0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalTopSlotImage;                            // 0x0280(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            VerticalBottomSlotImage;                           // 0x0350(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HorizontalBottomSlotImage;                         // 0x0420(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            NormalThumbImage;                                  // 0x04F0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            HoveredThumbImage;                                 // 0x05C0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            DraggedThumbImage;                                 // 0x0690(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         Thickness;                                         // 0x0760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_764[0xC];                                      // 0x0764(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FScrollBarStyle) == 0x000010, "Wrong alignment on FScrollBarStyle");
static_assert(sizeof(FScrollBarStyle) == 0x000770, "Wrong size on FScrollBarStyle");
static_assert(offsetof(FScrollBarStyle, HorizontalBackgroundImage) == 0x000010, "Member 'FScrollBarStyle::HorizontalBackgroundImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalBackgroundImage) == 0x0000E0, "Member 'FScrollBarStyle::VerticalBackgroundImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalTopSlotImage) == 0x0001B0, "Member 'FScrollBarStyle::VerticalTopSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HorizontalTopSlotImage) == 0x000280, "Member 'FScrollBarStyle::HorizontalTopSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, VerticalBottomSlotImage) == 0x000350, "Member 'FScrollBarStyle::VerticalBottomSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HorizontalBottomSlotImage) == 0x000420, "Member 'FScrollBarStyle::HorizontalBottomSlotImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, NormalThumbImage) == 0x0004F0, "Member 'FScrollBarStyle::NormalThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, HoveredThumbImage) == 0x0005C0, "Member 'FScrollBarStyle::HoveredThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, DraggedThumbImage) == 0x000690, "Member 'FScrollBarStyle::DraggedThumbImage' has a wrong offset!");
static_assert(offsetof(FScrollBarStyle, Thickness) == 0x000760, "Member 'FScrollBarStyle::Thickness' has a wrong offset!");

// ScriptStruct SlateCore.EditableTextBoxStyle
// 0x0BC8 (0x0BD0 - 0x0008)
struct FEditableTextBoxStyle final : public FSlateWidgetStyle
{
public:
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            BackgroundImageNormal;                             // 0x0010(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageHovered;                            // 0x00E0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageFocused;                            // 0x01B0(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackgroundImageReadOnly;                           // 0x0280(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                Padding;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         Font;                                              // 0x0360(0x0088)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x03E8(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            BackgroundColor;                                   // 0x03FC(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            ReadOnlyForegroundColor;                           // 0x0410(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateColor                            FocusedForegroundColor;                            // 0x0424(0x0014)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                                HScrollBarPadding;                                 // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                VScrollBarPadding;                                 // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0460(0x0770)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FEditableTextBoxStyle) == 0x000010, "Wrong alignment on FEditableTextBoxStyle");
static_assert(sizeof(FEditableTextBoxStyle) == 0x000BD0, "Wrong size on FEditableTextBoxStyle");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageNormal) == 0x000010, "Member 'FEditableTextBoxStyle::BackgroundImageNormal' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageHovered) == 0x0000E0, "Member 'FEditableTextBoxStyle::BackgroundImageHovered' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageFocused) == 0x0001B0, "Member 'FEditableTextBoxStyle::BackgroundImageFocused' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundImageReadOnly) == 0x000280, "Member 'FEditableTextBoxStyle::BackgroundImageReadOnly' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, Padding) == 0x000350, "Member 'FEditableTextBoxStyle::Padding' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, Font) == 0x000360, "Member 'FEditableTextBoxStyle::Font' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, ForegroundColor) == 0x0003E8, "Member 'FEditableTextBoxStyle::ForegroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, BackgroundColor) == 0x0003FC, "Member 'FEditableTextBoxStyle::BackgroundColor' has a wrong offset!");
static_assert(offsetof(FEditableTextBoxStyle, ReadOnlyForegroundColor) == 0x000410, "Member 'FEditableTextBoxStyle::ReadOnlyForegroundColor' has a wrong offset!");
