#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SocketSubsystemEOS

#include "Basic.hpp"

#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class SocketSubsystemEOS.NetDriverEOSBase
// 0x0008 (0x07F8 - 0x07F0)
class UNetDriverEOSBase : public UIpNetDriver
{
public:
	bool                                          bIsPassthrough;                                    // 0x07F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUsingP2PSockets;                                // 0x07F1(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F2[0x6];                                      // 0x07F2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetDriverEOSBase">();
	}
	static class UNetDriverEOSBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetDriverEOSBase>();
	}
};
static_assert(alignof(UNetDriverEOSBase) == 0x000008, "Wrong alignment on UNetDriverEOSBase");
static_assert(sizeof(UNetDriverEOSBase) == 0x0007F8, "Wrong size on UNetDriverEOSBase");
static_assert(offsetof(UNetDriverEOSBase, bIsPassthrough) == 0x0007F0, "Member 'UNetDriverEOSBase::bIsPassthrough' has a wrong offset!");
static_assert(offsetof(UNetDriverEOSBase, bIsUsingP2PSockets) == 0x0007F1, "Member 'UNetDriverEOSBase::bIsUsingP2PSockets' has a wrong offset!");

// Class SocketSubsystemEOS.NetConnectionEOS
// 0x0010 (0x32F0 - 0x32E0)
class UNetConnectionEOS final : public UIpConnection
{
public:
	uint8                                         Pad_32E0[0x10];                                    // 0x32E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NetConnectionEOS">();
	}
	static class UNetConnectionEOS* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNetConnectionEOS>();
	}
};
static_assert(alignof(UNetConnectionEOS) == 0x000010, "Wrong alignment on UNetConnectionEOS");
static_assert(sizeof(UNetConnectionEOS) == 0x0032F0, "Wrong size on UNetConnectionEOS");

}

