#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StreamlineBlueprint

#include "Basic.hpp"

#include "StreamlineBlueprint_structs.hpp"


namespace SDK::Params
{

// Function StreamlineBlueprint.StreamlineLibrary.BreakStreamlineFeatureRequirements
// 0x0006 (0x0006 - 0x0000)
struct StreamlineLibrary_BreakStreamlineFeatureRequirements final
{
public:
	EUStreamlineFeatureRequirementsFlags          Requirements;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          D3D11Supported;                                    // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          D3D12Supported;                                    // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VulkanSupported;                                   // 0x0003(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          VSyncOffRequired;                                  // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HardwareSchedulingRequired;                        // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibrary_BreakStreamlineFeatureRequirements) == 0x000001, "Wrong alignment on StreamlineLibrary_BreakStreamlineFeatureRequirements");
static_assert(sizeof(StreamlineLibrary_BreakStreamlineFeatureRequirements) == 0x000006, "Wrong size on StreamlineLibrary_BreakStreamlineFeatureRequirements");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, Requirements) == 0x000000, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::Requirements' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, D3D11Supported) == 0x000001, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::D3D11Supported' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, D3D12Supported) == 0x000002, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::D3D12Supported' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, VulkanSupported) == 0x000003, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::VulkanSupported' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, VSyncOffRequired) == 0x000004, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::VSyncOffRequired' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_BreakStreamlineFeatureRequirements, HardwareSchedulingRequired) == 0x000005, "Member 'StreamlineLibrary_BreakStreamlineFeatureRequirements::HardwareSchedulingRequired' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibrary.GetStreamlineFeatureInformation
// 0x0038 (0x0038 - 0x0000)
struct StreamlineLibrary_GetStreamlineFeatureInformation final
{
public:
	EUStreamlineFeature                           Feature;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStreamlineFeatureRequirements         ReturnValue;                                       // 0x0004(0x0034)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibrary_GetStreamlineFeatureInformation) == 0x000004, "Wrong alignment on StreamlineLibrary_GetStreamlineFeatureInformation");
static_assert(sizeof(StreamlineLibrary_GetStreamlineFeatureInformation) == 0x000038, "Wrong size on StreamlineLibrary_GetStreamlineFeatureInformation");
static_assert(offsetof(StreamlineLibrary_GetStreamlineFeatureInformation, Feature) == 0x000000, "Member 'StreamlineLibrary_GetStreamlineFeatureInformation::Feature' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_GetStreamlineFeatureInformation, ReturnValue) == 0x000004, "Member 'StreamlineLibrary_GetStreamlineFeatureInformation::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibrary.IsStreamlineFeatureSupported
// 0x0002 (0x0002 - 0x0000)
struct StreamlineLibrary_IsStreamlineFeatureSupported final
{
public:
	EUStreamlineFeature                           Feature;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibrary_IsStreamlineFeatureSupported) == 0x000001, "Wrong alignment on StreamlineLibrary_IsStreamlineFeatureSupported");
static_assert(sizeof(StreamlineLibrary_IsStreamlineFeatureSupported) == 0x000002, "Wrong size on StreamlineLibrary_IsStreamlineFeatureSupported");
static_assert(offsetof(StreamlineLibrary_IsStreamlineFeatureSupported, Feature) == 0x000000, "Member 'StreamlineLibrary_IsStreamlineFeatureSupported::Feature' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_IsStreamlineFeatureSupported, ReturnValue) == 0x000001, "Member 'StreamlineLibrary_IsStreamlineFeatureSupported::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibrary.QueryStreamlineFeatureSupport
// 0x0002 (0x0002 - 0x0000)
struct StreamlineLibrary_QueryStreamlineFeatureSupport final
{
public:
	EUStreamlineFeature                           Feature;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUStreamlineFeatureSupport                    ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibrary_QueryStreamlineFeatureSupport) == 0x000001, "Wrong alignment on StreamlineLibrary_QueryStreamlineFeatureSupport");
static_assert(sizeof(StreamlineLibrary_QueryStreamlineFeatureSupport) == 0x000002, "Wrong size on StreamlineLibrary_QueryStreamlineFeatureSupport");
static_assert(offsetof(StreamlineLibrary_QueryStreamlineFeatureSupport, Feature) == 0x000000, "Member 'StreamlineLibrary_QueryStreamlineFeatureSupport::Feature' has a wrong offset!");
static_assert(offsetof(StreamlineLibrary_QueryStreamlineFeatureSupport, ReturnValue) == 0x000001, "Member 'StreamlineLibrary_QueryStreamlineFeatureSupport::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDefaultDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_GetDefaultDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_GetDefaultDLSSGMode) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_GetDefaultDLSSGMode");
static_assert(sizeof(StreamlineLibraryDLSSG_GetDefaultDLSSGMode) == 0x000001, "Wrong size on StreamlineLibraryDLSSG_GetDefaultDLSSGMode");
static_assert(offsetof(StreamlineLibraryDLSSG_GetDefaultDLSSGMode, ReturnValue) == 0x000000, "Member 'StreamlineLibraryDLSSG_GetDefaultDLSSGMode::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDLSSGFrameTiming
// 0x0008 (0x0008 - 0x0000)
struct StreamlineLibraryDLSSG_GetDLSSGFrameTiming final
{
public:
	float                                         FrameRateInHertz;                                  // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FramesPresented;                                   // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_GetDLSSGFrameTiming) == 0x000004, "Wrong alignment on StreamlineLibraryDLSSG_GetDLSSGFrameTiming");
static_assert(sizeof(StreamlineLibraryDLSSG_GetDLSSGFrameTiming) == 0x000008, "Wrong size on StreamlineLibraryDLSSG_GetDLSSGFrameTiming");
static_assert(offsetof(StreamlineLibraryDLSSG_GetDLSSGFrameTiming, FrameRateInHertz) == 0x000000, "Member 'StreamlineLibraryDLSSG_GetDLSSGFrameTiming::FrameRateInHertz' has a wrong offset!");
static_assert(offsetof(StreamlineLibraryDLSSG_GetDLSSGFrameTiming, FramesPresented) == 0x000004, "Member 'StreamlineLibraryDLSSG_GetDLSSGFrameTiming::FramesPresented' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_GetDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_GetDLSSGMode) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_GetDLSSGMode");
static_assert(sizeof(StreamlineLibraryDLSSG_GetDLSSGMode) == 0x000001, "Wrong size on StreamlineLibraryDLSSG_GetDLSSGMode");
static_assert(offsetof(StreamlineLibraryDLSSG_GetDLSSGMode, ReturnValue) == 0x000000, "Member 'StreamlineLibraryDLSSG_GetDLSSGMode::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.GetSupportedDLSSGModes
// 0x0010 (0x0010 - 0x0000)
struct StreamlineLibraryDLSSG_GetSupportedDLSSGModes final
{
public:
	TArray<EUStreamlineDLSSGMode>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_GetSupportedDLSSGModes) == 0x000008, "Wrong alignment on StreamlineLibraryDLSSG_GetSupportedDLSSGModes");
static_assert(sizeof(StreamlineLibraryDLSSG_GetSupportedDLSSGModes) == 0x000010, "Wrong size on StreamlineLibraryDLSSG_GetSupportedDLSSGModes");
static_assert(offsetof(StreamlineLibraryDLSSG_GetSupportedDLSSGModes, ReturnValue) == 0x000000, "Member 'StreamlineLibraryDLSSG_GetSupportedDLSSGModes::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.IsDLSSGModeSupported
// 0x0002 (0x0002 - 0x0000)
struct StreamlineLibraryDLSSG_IsDLSSGModeSupported final
{
public:
	EUStreamlineDLSSGMode                         DLSSGMode;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_IsDLSSGModeSupported) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_IsDLSSGModeSupported");
static_assert(sizeof(StreamlineLibraryDLSSG_IsDLSSGModeSupported) == 0x000002, "Wrong size on StreamlineLibraryDLSSG_IsDLSSGModeSupported");
static_assert(offsetof(StreamlineLibraryDLSSG_IsDLSSGModeSupported, DLSSGMode) == 0x000000, "Member 'StreamlineLibraryDLSSG_IsDLSSGModeSupported::DLSSGMode' has a wrong offset!");
static_assert(offsetof(StreamlineLibraryDLSSG_IsDLSSGModeSupported, ReturnValue) == 0x000001, "Member 'StreamlineLibraryDLSSG_IsDLSSGModeSupported::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.IsDLSSGSupported
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_IsDLSSGSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_IsDLSSGSupported) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_IsDLSSGSupported");
static_assert(sizeof(StreamlineLibraryDLSSG_IsDLSSGSupported) == 0x000001, "Wrong size on StreamlineLibraryDLSSG_IsDLSSGSupported");
static_assert(offsetof(StreamlineLibraryDLSSG_IsDLSSGSupported, ReturnValue) == 0x000000, "Member 'StreamlineLibraryDLSSG_IsDLSSGSupported::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.QueryDLSSGSupport
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_QueryDLSSGSupport final
{
public:
	EUStreamlineFeatureSupport                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_QueryDLSSGSupport) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_QueryDLSSGSupport");
static_assert(sizeof(StreamlineLibraryDLSSG_QueryDLSSGSupport) == 0x000001, "Wrong size on StreamlineLibraryDLSSG_QueryDLSSGSupport");
static_assert(offsetof(StreamlineLibraryDLSSG_QueryDLSSGSupport, ReturnValue) == 0x000000, "Member 'StreamlineLibraryDLSSG_QueryDLSSGSupport::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryDLSSG.SetDLSSGMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryDLSSG_SetDLSSGMode final
{
public:
	EUStreamlineDLSSGMode                         DLSSGMode;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryDLSSG_SetDLSSGMode) == 0x000001, "Wrong alignment on StreamlineLibraryDLSSG_SetDLSSGMode");
static_assert(sizeof(StreamlineLibraryDLSSG_SetDLSSGMode) == 0x000001, "Wrong size on StreamlineLibraryDLSSG_SetDLSSGMode");
static_assert(offsetof(StreamlineLibraryDLSSG_SetDLSSGMode, DLSSGMode) == 0x000000, "Member 'StreamlineLibraryDLSSG_SetDLSSGMode::DLSSGMode' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetDefaultReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_GetDefaultReflexMode final
{
public:
	EUStreamlineReflexMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_GetDefaultReflexMode) == 0x000001, "Wrong alignment on StreamlineLibraryReflex_GetDefaultReflexMode");
static_assert(sizeof(StreamlineLibraryReflex_GetDefaultReflexMode) == 0x000001, "Wrong size on StreamlineLibraryReflex_GetDefaultReflexMode");
static_assert(offsetof(StreamlineLibraryReflex_GetDefaultReflexMode, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_GetDefaultReflexMode::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetGameLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetGameLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_GetGameLatencyInMs) == 0x000004, "Wrong alignment on StreamlineLibraryReflex_GetGameLatencyInMs");
static_assert(sizeof(StreamlineLibraryReflex_GetGameLatencyInMs) == 0x000004, "Wrong size on StreamlineLibraryReflex_GetGameLatencyInMs");
static_assert(offsetof(StreamlineLibraryReflex_GetGameLatencyInMs, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_GetGameLatencyInMs::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetGameToRenderLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetGameToRenderLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_GetGameToRenderLatencyInMs) == 0x000004, "Wrong alignment on StreamlineLibraryReflex_GetGameToRenderLatencyInMs");
static_assert(sizeof(StreamlineLibraryReflex_GetGameToRenderLatencyInMs) == 0x000004, "Wrong size on StreamlineLibraryReflex_GetGameToRenderLatencyInMs");
static_assert(offsetof(StreamlineLibraryReflex_GetGameToRenderLatencyInMs, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_GetGameToRenderLatencyInMs::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_GetReflexMode final
{
public:
	EUStreamlineReflexMode                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_GetReflexMode) == 0x000001, "Wrong alignment on StreamlineLibraryReflex_GetReflexMode");
static_assert(sizeof(StreamlineLibraryReflex_GetReflexMode) == 0x000001, "Wrong size on StreamlineLibraryReflex_GetReflexMode");
static_assert(offsetof(StreamlineLibraryReflex_GetReflexMode, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_GetReflexMode::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.GetRenderLatencyInMs
// 0x0004 (0x0004 - 0x0000)
struct StreamlineLibraryReflex_GetRenderLatencyInMs final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_GetRenderLatencyInMs) == 0x000004, "Wrong alignment on StreamlineLibraryReflex_GetRenderLatencyInMs");
static_assert(sizeof(StreamlineLibraryReflex_GetRenderLatencyInMs) == 0x000004, "Wrong size on StreamlineLibraryReflex_GetRenderLatencyInMs");
static_assert(offsetof(StreamlineLibraryReflex_GetRenderLatencyInMs, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_GetRenderLatencyInMs::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.IsReflexSupported
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_IsReflexSupported final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_IsReflexSupported) == 0x000001, "Wrong alignment on StreamlineLibraryReflex_IsReflexSupported");
static_assert(sizeof(StreamlineLibraryReflex_IsReflexSupported) == 0x000001, "Wrong size on StreamlineLibraryReflex_IsReflexSupported");
static_assert(offsetof(StreamlineLibraryReflex_IsReflexSupported, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_IsReflexSupported::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.QueryReflexSupport
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_QueryReflexSupport final
{
public:
	EUStreamlineFeatureSupport                    ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_QueryReflexSupport) == 0x000001, "Wrong alignment on StreamlineLibraryReflex_QueryReflexSupport");
static_assert(sizeof(StreamlineLibraryReflex_QueryReflexSupport) == 0x000001, "Wrong size on StreamlineLibraryReflex_QueryReflexSupport");
static_assert(offsetof(StreamlineLibraryReflex_QueryReflexSupport, ReturnValue) == 0x000000, "Member 'StreamlineLibraryReflex_QueryReflexSupport::ReturnValue' has a wrong offset!");

// Function StreamlineBlueprint.StreamlineLibraryReflex.SetReflexMode
// 0x0001 (0x0001 - 0x0000)
struct StreamlineLibraryReflex_SetReflexMode final
{
public:
	EUStreamlineReflexMode                        Mode;                                              // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(StreamlineLibraryReflex_SetReflexMode) == 0x000001, "Wrong alignment on StreamlineLibraryReflex_SetReflexMode");
static_assert(sizeof(StreamlineLibraryReflex_SetReflexMode) == 0x000001, "Wrong size on StreamlineLibraryReflex_SetReflexMode");
static_assert(offsetof(StreamlineLibraryReflex_SetReflexMode, Mode) == 0x000000, "Member 'StreamlineLibraryReflex_SetReflexMode::Mode' has a wrong offset!");

}

