#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubstanceCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SubstanceCore_structs.hpp"


namespace SDK::Params
{

// Function SubstanceCore.SubstanceGraphInstance.GetFloatInputDesc
// 0x0058 (0x0058 - 0x0000)
struct SubstanceGraphInstance_GetFloatInputDesc final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubstanceFloatInputDesc               ReturnValue;                                       // 0x0010(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetFloatInputDesc) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetFloatInputDesc");
static_assert(sizeof(SubstanceGraphInstance_GetFloatInputDesc) == 0x000058, "Wrong size on SubstanceGraphInstance_GetFloatInputDesc");
static_assert(offsetof(SubstanceGraphInstance_GetFloatInputDesc, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetFloatInputDesc::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetFloatInputDesc, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetFloatInputDesc::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputBool
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_GetInputBool final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SubstanceGraphInstance_GetInputBool) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputBool");
static_assert(sizeof(SubstanceGraphInstance_GetInputBool) == 0x000018, "Wrong size on SubstanceGraphInstance_GetInputBool");
static_assert(offsetof(SubstanceGraphInstance_GetInputBool, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetInputBool::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputBool, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputBool::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputColor
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputColor final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInputColor) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputColor");
static_assert(sizeof(SubstanceGraphInstance_GetInputColor) == 0x000020, "Wrong size on SubstanceGraphInstance_GetInputColor");
static_assert(offsetof(SubstanceGraphInstance_GetInputColor, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetInputColor::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputColor, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputColor::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputFloat
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputFloat final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInputFloat) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputFloat");
static_assert(sizeof(SubstanceGraphInstance_GetInputFloat) == 0x000020, "Wrong size on SubstanceGraphInstance_GetInputFloat");
static_assert(offsetof(SubstanceGraphInstance_GetInputFloat, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetInputFloat::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputFloat, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputFloat::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputInt
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputInt final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInputInt) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputInt");
static_assert(sizeof(SubstanceGraphInstance_GetInputInt) == 0x000020, "Wrong size on SubstanceGraphInstance_GetInputInt");
static_assert(offsetof(SubstanceGraphInstance_GetInputInt, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetInputInt::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputInt, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputInt::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputNames
// 0x0010 (0x0010 - 0x0000)
struct SubstanceGraphInstance_GetInputNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInputNames) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputNames");
static_assert(sizeof(SubstanceGraphInstance_GetInputNames) == 0x000010, "Wrong size on SubstanceGraphInstance_GetInputNames");
static_assert(offsetof(SubstanceGraphInstance_GetInputNames, ReturnValue) == 0x000000, "Member 'SubstanceGraphInstance_GetInputNames::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputString
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInputString final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInputString) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputString");
static_assert(sizeof(SubstanceGraphInstance_GetInputString) == 0x000020, "Wrong size on SubstanceGraphInstance_GetInputString");
static_assert(offsetof(SubstanceGraphInstance_GetInputString, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetInputString::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputString, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputString::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInputType
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_GetInputType final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceInputType                           ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SubstanceGraphInstance_GetInputType) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInputType");
static_assert(sizeof(SubstanceGraphInstance_GetInputType) == 0x000018, "Wrong size on SubstanceGraphInstance_GetInputType");
static_assert(offsetof(SubstanceGraphInstance_GetInputType, InputName) == 0x000000, "Member 'SubstanceGraphInstance_GetInputType::InputName' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetInputType, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetInputType::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetInstanceDesc
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_GetInstanceDesc final
{
public:
	struct FSubstanceInstanceDesc                 ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetInstanceDesc) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetInstanceDesc");
static_assert(sizeof(SubstanceGraphInstance_GetInstanceDesc) == 0x000020, "Wrong size on SubstanceGraphInstance_GetInstanceDesc");
static_assert(offsetof(SubstanceGraphInstance_GetInstanceDesc, ReturnValue) == 0x000000, "Member 'SubstanceGraphInstance_GetInstanceDesc::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.GetIntInputDesc
// 0x0058 (0x0058 - 0x0000)
struct SubstanceGraphInstance_GetIntInputDesc final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubstanceIntInputDesc                 ReturnValue;                                       // 0x0010(0x0048)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_GetIntInputDesc) == 0x000008, "Wrong alignment on SubstanceGraphInstance_GetIntInputDesc");
static_assert(sizeof(SubstanceGraphInstance_GetIntInputDesc) == 0x000058, "Wrong size on SubstanceGraphInstance_GetIntInputDesc");
static_assert(offsetof(SubstanceGraphInstance_GetIntInputDesc, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_GetIntInputDesc::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_GetIntInputDesc, ReturnValue) == 0x000010, "Member 'SubstanceGraphInstance_GetIntInputDesc::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputBool
// 0x0018 (0x0018 - 0x0000)
struct SubstanceGraphInstance_SetInputBool final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bool;                                              // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SubstanceGraphInstance_SetInputBool) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputBool");
static_assert(sizeof(SubstanceGraphInstance_SetInputBool) == 0x000018, "Wrong size on SubstanceGraphInstance_SetInputBool");
static_assert(offsetof(SubstanceGraphInstance_SetInputBool, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_SetInputBool::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputBool, Bool) == 0x000010, "Member 'SubstanceGraphInstance_SetInputBool::Bool' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputColor
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputColor final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_SetInputColor) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputColor");
static_assert(sizeof(SubstanceGraphInstance_SetInputColor) == 0x000020, "Wrong size on SubstanceGraphInstance_SetInputColor");
static_assert(offsetof(SubstanceGraphInstance_SetInputColor, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_SetInputColor::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputColor, Color) == 0x000010, "Member 'SubstanceGraphInstance_SetInputColor::Color' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputFloat
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputFloat final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 InputValues;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_SetInputFloat) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputFloat");
static_assert(sizeof(SubstanceGraphInstance_SetInputFloat) == 0x000020, "Wrong size on SubstanceGraphInstance_SetInputFloat");
static_assert(offsetof(SubstanceGraphInstance_SetInputFloat, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_SetInputFloat::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputFloat, InputValues) == 0x000010, "Member 'SubstanceGraphInstance_SetInputFloat::InputValues' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputImg
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputImg final
{
public:
	class FString                                 InputName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Value;                                             // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SubstanceGraphInstance_SetInputImg) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputImg");
static_assert(sizeof(SubstanceGraphInstance_SetInputImg) == 0x000020, "Wrong size on SubstanceGraphInstance_SetInputImg");
static_assert(offsetof(SubstanceGraphInstance_SetInputImg, InputName) == 0x000000, "Member 'SubstanceGraphInstance_SetInputImg::InputName' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputImg, Value) == 0x000010, "Member 'SubstanceGraphInstance_SetInputImg::Value' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputImg, ReturnValue) == 0x000018, "Member 'SubstanceGraphInstance_SetInputImg::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputInt
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputInt final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 InputValues;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_SetInputInt) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputInt");
static_assert(sizeof(SubstanceGraphInstance_SetInputInt) == 0x000020, "Wrong size on SubstanceGraphInstance_SetInputInt");
static_assert(offsetof(SubstanceGraphInstance_SetInputInt, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_SetInputInt::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputInt, InputValues) == 0x000010, "Member 'SubstanceGraphInstance_SetInputInt::InputValues' has a wrong offset!");

// Function SubstanceCore.SubstanceGraphInstance.SetInputString
// 0x0020 (0x0020 - 0x0000)
struct SubstanceGraphInstance_SetInputString final
{
public:
	class FString                                 Identifier;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceGraphInstance_SetInputString) == 0x000008, "Wrong alignment on SubstanceGraphInstance_SetInputString");
static_assert(sizeof(SubstanceGraphInstance_SetInputString) == 0x000020, "Wrong size on SubstanceGraphInstance_SetInputString");
static_assert(offsetof(SubstanceGraphInstance_SetInputString, Identifier) == 0x000000, "Member 'SubstanceGraphInstance_SetInputString::Identifier' has a wrong offset!");
static_assert(offsetof(SubstanceGraphInstance_SetInputString, Value) == 0x000010, "Member 'SubstanceGraphInstance_SetInputString::Value' has a wrong offset!");

// Function SubstanceCore.SubstanceTexture2D.GetChannel
// 0x0001 (0x0001 - 0x0000)
struct SubstanceTexture2D_GetChannel final
{
public:
	ESubChannelType                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceTexture2D_GetChannel) == 0x000001, "Wrong alignment on SubstanceTexture2D_GetChannel");
static_assert(sizeof(SubstanceTexture2D_GetChannel) == 0x000001, "Wrong size on SubstanceTexture2D_GetChannel");
static_assert(offsetof(SubstanceTexture2D_GetChannel, ReturnValue) == 0x000000, "Member 'SubstanceTexture2D_GetChannel::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.AsyncRendering
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_AsyncRendering final
{
public:
	class USubstanceGraphInstance*                InstancesToRender;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_AsyncRendering) == 0x000008, "Wrong alignment on SubstanceUtility_AsyncRendering");
static_assert(sizeof(SubstanceUtility_AsyncRendering) == 0x000008, "Wrong size on SubstanceUtility_AsyncRendering");
static_assert(offsetof(SubstanceUtility_AsyncRendering, InstancesToRender) == 0x000000, "Member 'SubstanceUtility_AsyncRendering::InstancesToRender' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.CopyInputParameters
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_CopyInputParameters final
{
public:
	class USubstanceGraphInstance*                SourceGraphInstance;                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                DestGraphInstance;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_CopyInputParameters) == 0x000008, "Wrong alignment on SubstanceUtility_CopyInputParameters");
static_assert(sizeof(SubstanceUtility_CopyInputParameters) == 0x000010, "Wrong size on SubstanceUtility_CopyInputParameters");
static_assert(offsetof(SubstanceUtility_CopyInputParameters, SourceGraphInstance) == 0x000000, "Member 'SubstanceUtility_CopyInputParameters::SourceGraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CopyInputParameters, DestGraphInstance) == 0x000008, "Member 'SubstanceUtility_CopyInputParameters::DestGraphInstance' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.CreateAggregateSubstanceFactory
// 0x0038 (0x0038 - 0x0000)
struct SubstanceUtility_CreateAggregateSubstanceFactory final
{
public:
	class USubstanceInstanceFactory*              OutputFactory;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutputFactoryGraphIndex;                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USubstanceInstanceFactory*              InputFactory;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InputFactoryGraphIndex;                            // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSubstanceConnection>           Connections;                                       // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_CreateAggregateSubstanceFactory) == 0x000008, "Wrong alignment on SubstanceUtility_CreateAggregateSubstanceFactory");
static_assert(sizeof(SubstanceUtility_CreateAggregateSubstanceFactory) == 0x000038, "Wrong size on SubstanceUtility_CreateAggregateSubstanceFactory");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, OutputFactory) == 0x000000, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::OutputFactory' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, OutputFactoryGraphIndex) == 0x000008, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::OutputFactoryGraphIndex' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, InputFactory) == 0x000010, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::InputFactory' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, InputFactoryGraphIndex) == 0x000018, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::InputFactoryGraphIndex' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, Connections) == 0x000020, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::Connections' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateAggregateSubstanceFactory, ReturnValue) == 0x000030, "Member 'SubstanceUtility_CreateAggregateSubstanceFactory::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.CreateGraphInstance
// 0x0030 (0x0030 - 0x0000)
struct SubstanceUtility_CreateGraphInstance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              Factory;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GraphDescIndex;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InstanceName;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_CreateGraphInstance) == 0x000008, "Wrong alignment on SubstanceUtility_CreateGraphInstance");
static_assert(sizeof(SubstanceUtility_CreateGraphInstance) == 0x000030, "Wrong size on SubstanceUtility_CreateGraphInstance");
static_assert(offsetof(SubstanceUtility_CreateGraphInstance, WorldContextObject) == 0x000000, "Member 'SubstanceUtility_CreateGraphInstance::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateGraphInstance, Factory) == 0x000008, "Member 'SubstanceUtility_CreateGraphInstance::Factory' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateGraphInstance, GraphDescIndex) == 0x000010, "Member 'SubstanceUtility_CreateGraphInstance::GraphDescIndex' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateGraphInstance, InstanceName) == 0x000018, "Member 'SubstanceUtility_CreateGraphInstance::InstanceName' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_CreateGraphInstance, ReturnValue) == 0x000028, "Member 'SubstanceUtility_CreateGraphInstance::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.DisableInstanceOutputs
// 0x0020 (0x0020 - 0x0000)
struct SubstanceUtility_DisableInstanceOutputs final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutputIndices;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_DisableInstanceOutputs) == 0x000008, "Wrong alignment on SubstanceUtility_DisableInstanceOutputs");
static_assert(sizeof(SubstanceUtility_DisableInstanceOutputs) == 0x000020, "Wrong size on SubstanceUtility_DisableInstanceOutputs");
static_assert(offsetof(SubstanceUtility_DisableInstanceOutputs, WorldContextObject) == 0x000000, "Member 'SubstanceUtility_DisableInstanceOutputs::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_DisableInstanceOutputs, GraphInstance) == 0x000008, "Member 'SubstanceUtility_DisableInstanceOutputs::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_DisableInstanceOutputs, OutputIndices) == 0x000010, "Member 'SubstanceUtility_DisableInstanceOutputs::OutputIndices' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.DuplicateGraphInstance
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_DuplicateGraphInstance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_DuplicateGraphInstance) == 0x000008, "Wrong alignment on SubstanceUtility_DuplicateGraphInstance");
static_assert(sizeof(SubstanceUtility_DuplicateGraphInstance) == 0x000018, "Wrong size on SubstanceUtility_DuplicateGraphInstance");
static_assert(offsetof(SubstanceUtility_DuplicateGraphInstance, WorldContextObject) == 0x000000, "Member 'SubstanceUtility_DuplicateGraphInstance::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_DuplicateGraphInstance, GraphInstance) == 0x000008, "Member 'SubstanceUtility_DuplicateGraphInstance::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_DuplicateGraphInstance, ReturnValue) == 0x000010, "Member 'SubstanceUtility_DuplicateGraphInstance::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.EnableInstanceOutputs
// 0x0020 (0x0020 - 0x0000)
struct SubstanceUtility_EnableInstanceOutputs final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 OutputIndices;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_EnableInstanceOutputs) == 0x000008, "Wrong alignment on SubstanceUtility_EnableInstanceOutputs");
static_assert(sizeof(SubstanceUtility_EnableInstanceOutputs) == 0x000020, "Wrong size on SubstanceUtility_EnableInstanceOutputs");
static_assert(offsetof(SubstanceUtility_EnableInstanceOutputs, WorldContextObject) == 0x000000, "Member 'SubstanceUtility_EnableInstanceOutputs::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_EnableInstanceOutputs, GraphInstance) == 0x000008, "Member 'SubstanceUtility_EnableInstanceOutputs::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_EnableInstanceOutputs, OutputIndices) == 0x000010, "Member 'SubstanceUtility_EnableInstanceOutputs::OutputIndices' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.GetFactoryName
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetFactoryName final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_GetFactoryName) == 0x000008, "Wrong alignment on SubstanceUtility_GetFactoryName");
static_assert(sizeof(SubstanceUtility_GetFactoryName) == 0x000018, "Wrong size on SubstanceUtility_GetFactoryName");
static_assert(offsetof(SubstanceUtility_GetFactoryName, GraphInstance) == 0x000000, "Member 'SubstanceUtility_GetFactoryName::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_GetFactoryName, ReturnValue) == 0x000008, "Member 'SubstanceUtility_GetFactoryName::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.GetGraphName
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetGraphName final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_GetGraphName) == 0x000008, "Wrong alignment on SubstanceUtility_GetGraphName");
static_assert(sizeof(SubstanceUtility_GetGraphName) == 0x000018, "Wrong size on SubstanceUtility_GetGraphName");
static_assert(offsetof(SubstanceUtility_GetGraphName, GraphInstance) == 0x000000, "Member 'SubstanceUtility_GetGraphName::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_GetGraphName, ReturnValue) == 0x000008, "Member 'SubstanceUtility_GetGraphName::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.GetSubstanceLoadingProgress
// 0x0004 (0x0004 - 0x0000)
struct SubstanceUtility_GetSubstanceLoadingProgress final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_GetSubstanceLoadingProgress) == 0x000004, "Wrong alignment on SubstanceUtility_GetSubstanceLoadingProgress");
static_assert(sizeof(SubstanceUtility_GetSubstanceLoadingProgress) == 0x000004, "Wrong size on SubstanceUtility_GetSubstanceLoadingProgress");
static_assert(offsetof(SubstanceUtility_GetSubstanceLoadingProgress, ReturnValue) == 0x000000, "Member 'SubstanceUtility_GetSubstanceLoadingProgress::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.GetSubstances
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetSubstances final
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USubstanceGraphInstance*>        ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_GetSubstances) == 0x000008, "Wrong alignment on SubstanceUtility_GetSubstances");
static_assert(sizeof(SubstanceUtility_GetSubstances) == 0x000018, "Wrong size on SubstanceUtility_GetSubstances");
static_assert(offsetof(SubstanceUtility_GetSubstances, Material) == 0x000000, "Member 'SubstanceUtility_GetSubstances::Material' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_GetSubstances, ReturnValue) == 0x000008, "Member 'SubstanceUtility_GetSubstances::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.GetSubstanceTextures
// 0x0018 (0x0018 - 0x0000)
struct SubstanceUtility_GetSubstanceTextures final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USubstanceTexture2D*>            ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_GetSubstanceTextures) == 0x000008, "Wrong alignment on SubstanceUtility_GetSubstanceTextures");
static_assert(sizeof(SubstanceUtility_GetSubstanceTextures) == 0x000018, "Wrong size on SubstanceUtility_GetSubstanceTextures");
static_assert(offsetof(SubstanceUtility_GetSubstanceTextures, GraphInstance) == 0x000000, "Member 'SubstanceUtility_GetSubstanceTextures::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_GetSubstanceTextures, ReturnValue) == 0x000008, "Member 'SubstanceUtility_GetSubstanceTextures::ReturnValue' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.ResetInputParameters
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_ResetInputParameters final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_ResetInputParameters) == 0x000008, "Wrong alignment on SubstanceUtility_ResetInputParameters");
static_assert(sizeof(SubstanceUtility_ResetInputParameters) == 0x000008, "Wrong size on SubstanceUtility_ResetInputParameters");
static_assert(offsetof(SubstanceUtility_ResetInputParameters, GraphInstance) == 0x000000, "Member 'SubstanceUtility_ResetInputParameters::GraphInstance' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.SetGraphInstanceOutputSize
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_SetGraphInstanceOutputSize final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceTextureSize                         Width;                                             // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceTextureSize                         Height;                                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SubstanceUtility_SetGraphInstanceOutputSize) == 0x000008, "Wrong alignment on SubstanceUtility_SetGraphInstanceOutputSize");
static_assert(sizeof(SubstanceUtility_SetGraphInstanceOutputSize) == 0x000010, "Wrong size on SubstanceUtility_SetGraphInstanceOutputSize");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSize, GraphInstance) == 0x000000, "Member 'SubstanceUtility_SetGraphInstanceOutputSize::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSize, Width) == 0x000008, "Member 'SubstanceUtility_SetGraphInstanceOutputSize::Width' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSize, Height) == 0x000009, "Member 'SubstanceUtility_SetGraphInstanceOutputSize::Height' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.SetGraphInstanceOutputSizeInt
// 0x0010 (0x0010 - 0x0000)
struct SubstanceUtility_SetGraphInstanceOutputSizeInt final
{
public:
	class USubstanceGraphInstance*                GraphInstance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Width;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_SetGraphInstanceOutputSizeInt) == 0x000008, "Wrong alignment on SubstanceUtility_SetGraphInstanceOutputSizeInt");
static_assert(sizeof(SubstanceUtility_SetGraphInstanceOutputSizeInt) == 0x000010, "Wrong size on SubstanceUtility_SetGraphInstanceOutputSizeInt");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSizeInt, GraphInstance) == 0x000000, "Member 'SubstanceUtility_SetGraphInstanceOutputSizeInt::GraphInstance' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSizeInt, Width) == 0x000008, "Member 'SubstanceUtility_SetGraphInstanceOutputSizeInt::Width' has a wrong offset!");
static_assert(offsetof(SubstanceUtility_SetGraphInstanceOutputSizeInt, Height) == 0x00000C, "Member 'SubstanceUtility_SetGraphInstanceOutputSizeInt::Height' has a wrong offset!");

// Function SubstanceCore.SubstanceUtility.SyncRendering
// 0x0008 (0x0008 - 0x0000)
struct SubstanceUtility_SyncRendering final
{
public:
	class USubstanceGraphInstance*                InstancesToRender;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SubstanceUtility_SyncRendering) == 0x000008, "Wrong alignment on SubstanceUtility_SyncRendering");
static_assert(sizeof(SubstanceUtility_SyncRendering) == 0x000008, "Wrong size on SubstanceUtility_SyncRendering");
static_assert(offsetof(SubstanceUtility_SyncRendering, InstancesToRender) == 0x000000, "Member 'SubstanceUtility_SyncRendering::InstancesToRender' has a wrong offset!");

}

