#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TexAlphaDA

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class TexAlphaDA.TexAlphaDataAsset
// 0x0018 (0x0048 - 0x0030)
class UTexAlphaDataAsset final : public UDataAsset
{
public:
	int32                                         SizeX;                                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SizeY;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         ColorData;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TexAlphaDataAsset">();
	}
	static class UTexAlphaDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTexAlphaDataAsset>();
	}
};
static_assert(alignof(UTexAlphaDataAsset) == 0x000008, "Wrong alignment on UTexAlphaDataAsset");
static_assert(sizeof(UTexAlphaDataAsset) == 0x000048, "Wrong size on UTexAlphaDataAsset");
static_assert(offsetof(UTexAlphaDataAsset, SizeX) == 0x000030, "Member 'UTexAlphaDataAsset::SizeX' has a wrong offset!");
static_assert(offsetof(UTexAlphaDataAsset, SizeY) == 0x000034, "Member 'UTexAlphaDataAsset::SizeY' has a wrong offset!");
static_assert(offsetof(UTexAlphaDataAsset, ColorData) == 0x000038, "Member 'UTexAlphaDataAsset::ColorData' has a wrong offset!");

}

