#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Slate_structs.hpp"
#include "MovieSceneTracks_classes.hpp"


namespace SDK
{

// Class UMG.Visual
// 0x0000 (0x0028 - 0x0028)
class UVisual : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Visual">();
	}
	static class UVisual* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVisual>();
	}
};
static_assert(alignof(UVisual) == 0x000008, "Wrong alignment on UVisual");
static_assert(sizeof(UVisual) == 0x000028, "Wrong size on UVisual");

// Class UMG.Widget
// 0x0108 (0x0130 - 0x0028)
class UWidget : public UVisual
{
public:
	class UPanelSlot*                             Slot;                                              // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, TextExportTransient, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             bIsEnabledDelegate;                                // 0x0030(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class FText                                   ToolTipText;                                       // 0x0040(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipTextDelegate;                               // 0x0058(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	class UWidget*                                ToolTipWidget;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ToolTipWidgetDelegate;                             // 0x0070(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void()>                             VisibilityDelegate;                                // 0x0080(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       RenderTransform;                                   // 0x0090(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              RenderTransformPivot;                              // 0x00C8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIsVariable : 1;                                   // 0x00D8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bCreatedByConstructionScript : 1;                  // 0x00D8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsEnabled : 1;                                    // 0x00D8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_Cursor : 1;                              // 0x00D8(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EFlowDirectionPreference                      FlowDirectionPreference;                           // 0x00D9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USlateAccessibleWidgetData*             AccessibleWidgetData;                              // 0x00E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsVolatile : 1;                                   // 0x00E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	EMouseCursor                                  Cursor;                                            // 0x00E9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWidgetClipping                               Clipping;                                          // 0x00EA(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              Visibility;                                        // 0x00EB(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RenderOpacity;                                     // 0x00EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPixelSnappingMethod                          PixelSnappingMethod;                               // 0x00F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetNavigation*                      Navigation;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_100[0x20];                                     // 0x0100(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyBinding*>               NativeBindings;                                    // 0x0120(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void ForceLayoutPrepass();
	void ForceVolatile(bool bForce);
	class UWidget* GenerateWidgetForObject__DelegateSignature(class UObject* Item);
	class UWidget* GenerateWidgetForString__DelegateSignature(const class FString& Item);
	bool GetBool__DelegateSignature();
	ECheckBoxState GetCheckBoxState__DelegateSignature();
	float GetFloat__DelegateSignature();
	int32 GetInt32__DelegateSignature();
	struct FLinearColor GetLinearColor__DelegateSignature();
	EMouseCursor GetMouseCursor__DelegateSignature();
	struct FSlateBrush GetSlateBrush__DelegateSignature();
	struct FSlateColor GetSlateColor__DelegateSignature();
	ESlateVisibility GetSlateVisibility__DelegateSignature();
	class FText GetText__DelegateSignature();
	class UWidget* GetWidget__DelegateSignature();
	void InvalidateLayoutAndVolatility();
	struct FEventReply OnPointerEvent__DelegateSignature(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnReply__DelegateSignature();
	void RemoveFromParent();
	void ResetCursor();
	void SetAllNavigationRules(EUINavigationRule Rule, class FName WidgetToFocus);
	void SetClipping(EWidgetClipping InClipping);
	void SetCursor(EMouseCursor InCursor);
	void SetFocus();
	void SetIsEnabled(bool bInIsEnabled);
	void SetKeyboardFocus();
	void SetNavigationRule(EUINavigation Direction, EUINavigationRule Rule, class FName WidgetToFocus);
	void SetNavigationRuleBase(EUINavigation Direction, EUINavigationRule Rule);
	void SetNavigationRuleCustom(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate);
	void SetNavigationRuleCustomBoundary(EUINavigation Direction, TDelegate<void(EUINavigation Navigation)> InCustomDelegate);
	void SetNavigationRuleExplicit(EUINavigation Direction, class UWidget* InWidget);
	void SetPixelSnappingMethod(EPixelSnappingMethod InPixelSnappingMethod);
	void SetRenderOpacity(float InOpacity);
	void SetRenderScale(const struct FVector2D& Scale);
	void SetRenderShear(const struct FVector2D& Shear);
	void SetRenderTransform(const struct FWidgetTransform& InTransform);
	void SetRenderTransformAngle(float Angle);
	void SetRenderTransformPivot(const struct FVector2D& Pivot);
	void SetRenderTranslation(const struct FVector2D& Translation);
	void SetToolTip(class UWidget* Widget);
	void SetToolTipText(const class FText& InToolTipText);
	void SetUserFocus(class APlayerController* PlayerController);
	void SetVisibility(ESlateVisibility InVisibility);

	class FText GetAccessibleSummaryText() const;
	class FText GetAccessibleText() const;
	const struct FGeometry GetCachedGeometry() const;
	EWidgetClipping GetClipping() const;
	struct FVector2D GetDesiredSize() const;
	class UGameInstance* GetGameInstance() const;
	bool GetIsEnabled() const;
	class ULocalPlayer* GetOwningLocalPlayer() const;
	class APlayerController* GetOwningPlayer() const;
	const struct FGeometry GetPaintSpaceGeometry() const;
	class UPanelWidget* GetParent() const;
	EPixelSnappingMethod GetPixelSnappingMethod() const;
	float GetRenderOpacity() const;
	float GetRenderTransformAngle() const;
	const struct FGeometry GetTickSpaceGeometry() const;
	ESlateVisibility GetVisibility() const;
	bool HasAnyUserFocus() const;
	bool HasFocusedDescendants() const;
	bool HasKeyboardFocus() const;
	bool HasMouseCapture() const;
	bool HasMouseCaptureByUser(int32 UserIndex, int32 PointerIndex) const;
	bool HasUserFocus(class APlayerController* PlayerController) const;
	bool HasUserFocusedDescendants(class APlayerController* PlayerController) const;
	bool IsHovered() const;
	bool IsVisible() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Widget">();
	}
	static class UWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidget>();
	}
};
static_assert(alignof(UWidget) == 0x000008, "Wrong alignment on UWidget");
static_assert(sizeof(UWidget) == 0x000130, "Wrong size on UWidget");
static_assert(offsetof(UWidget, Slot) == 0x000028, "Member 'UWidget::Slot' has a wrong offset!");
static_assert(offsetof(UWidget, bIsEnabledDelegate) == 0x000030, "Member 'UWidget::bIsEnabledDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipText) == 0x000040, "Member 'UWidget::ToolTipText' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipTextDelegate) == 0x000058, "Member 'UWidget::ToolTipTextDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipWidget) == 0x000068, "Member 'UWidget::ToolTipWidget' has a wrong offset!");
static_assert(offsetof(UWidget, ToolTipWidgetDelegate) == 0x000070, "Member 'UWidget::ToolTipWidgetDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, VisibilityDelegate) == 0x000080, "Member 'UWidget::VisibilityDelegate' has a wrong offset!");
static_assert(offsetof(UWidget, RenderTransform) == 0x000090, "Member 'UWidget::RenderTransform' has a wrong offset!");
static_assert(offsetof(UWidget, RenderTransformPivot) == 0x0000C8, "Member 'UWidget::RenderTransformPivot' has a wrong offset!");
static_assert(offsetof(UWidget, FlowDirectionPreference) == 0x0000D9, "Member 'UWidget::FlowDirectionPreference' has a wrong offset!");
static_assert(offsetof(UWidget, AccessibleWidgetData) == 0x0000E0, "Member 'UWidget::AccessibleWidgetData' has a wrong offset!");
static_assert(offsetof(UWidget, Cursor) == 0x0000E9, "Member 'UWidget::Cursor' has a wrong offset!");
static_assert(offsetof(UWidget, Clipping) == 0x0000EA, "Member 'UWidget::Clipping' has a wrong offset!");
static_assert(offsetof(UWidget, Visibility) == 0x0000EB, "Member 'UWidget::Visibility' has a wrong offset!");
static_assert(offsetof(UWidget, RenderOpacity) == 0x0000EC, "Member 'UWidget::RenderOpacity' has a wrong offset!");
static_assert(offsetof(UWidget, PixelSnappingMethod) == 0x0000F0, "Member 'UWidget::PixelSnappingMethod' has a wrong offset!");
static_assert(offsetof(UWidget, Navigation) == 0x0000F8, "Member 'UWidget::Navigation' has a wrong offset!");
static_assert(offsetof(UWidget, NativeBindings) == 0x000120, "Member 'UWidget::NativeBindings' has a wrong offset!");

// Class UMG.UserWidget
// 0x0168 (0x0298 - 0x0130)
class UUserWidget : public UWidget
{
public:
	uint8                                         Pad_130[0x8];                                      // 0x0130(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ColorAndOpacity;                                   // 0x0138(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ColorAndOpacityDelegate;                           // 0x0148(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateColor                            ForegroundColor;                                   // 0x0158(0x0014)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TDelegate<void()>                             ForegroundColorDelegate;                           // 0x016C(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnVisibilityChanged;                               // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x18];                                     // 0x0190(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                Padding;                                           // 0x01A8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UUMGSequencePlayer*>             ActiveSequencePlayers;                             // 0x01B8(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class UUMGSequenceTickManager*                AnimationTickManager;                              // 0x01C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UUMGSequencePlayer*>             StoppedSequencePlayers;                            // 0x01D0(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FNamedSlotBinding>              NamedSlotBindings;                                 // 0x01E0(0x0010)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UWidgetTree*                            WidgetTree;                                        // 0x01F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, TextExportTransient, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Priority;                                          // 0x01F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bSupportsKeyboardFocus : 1;                        // 0x01FC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Deprecated, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsFocusable : 1;                                  // 0x01FC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bStopAction : 1;                                   // 0x01FC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasScriptImplementedTick : 1;                     // 0x01FC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bHasScriptImplementedPaint : 1;                    // 0x01FC(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1FD[0x13];                                     // 0x01FD(0x0013)(Fixing Size After Last Property [ Dumper-7 ])
	EWidgetTickFrequency                          TickFrequency;                                     // 0x0210(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputComponent*                        InputComponent;                                    // 0x0218(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAnimationEventBinding>         AnimationCallbacks;                                // 0x0220(0x0010)(ZeroConstructor, Transient, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_230[0x68];                                     // 0x0230(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddToPlayerScreen(int32 ZOrder);
	void AddToViewport(int32 ZOrder);
	void BindToAnimationEvent(class UWidgetAnimation* Animation, TDelegate<void()> Delegate, EWidgetAnimationEvent AnimationEvent, class FName UserTag);
	void BindToAnimationFinished(class UWidgetAnimation* Animation, TDelegate<void()> Delegate);
	void BindToAnimationStarted(class UWidgetAnimation* Animation, TDelegate<void()> Delegate);
	void CancelLatentActions();
	void Construct();
	void Destruct();
	void FlushAnimations();
	bool IsAnimationPlayingForward(const class UWidgetAnimation* InAnimation);
	void ListenForInputAction(class FName ActionName, EInputEvent EventType, bool bConsume, TDelegate<void()> Callback);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnAnalogValueChanged(const struct FGeometry& MyGeometry, const struct FAnalogInputEvent& InAnalogInputEvent);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnAnimationStarted(const class UWidgetAnimation* Animation);
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDragOver(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	struct FEventReply OnKeyChar(const struct FGeometry& MyGeometry, const struct FCharacterEvent& InCharacterEvent);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMotionDetected(const struct FGeometry& MyGeometry, const struct FMotionEvent& InMotionEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseCaptureLost();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseMove(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnPreviewKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnTouchEnded(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchForceChanged(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchGesture(const struct FGeometry& MyGeometry, const struct FPointerEvent& GestureEvent);
	struct FEventReply OnTouchMoved(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	struct FEventReply OnTouchStarted(const struct FGeometry& MyGeometry, const struct FPointerEvent& InTouchEvent);
	float PauseAnimation(const class UWidgetAnimation* InAnimation);
	class UUMGSequencePlayer* PlayAnimation(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState);
	class UUMGSequencePlayer* PlayAnimationForward(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);
	class UUMGSequencePlayer* PlayAnimationReverse(class UWidgetAnimation* InAnimation, float PlaybackSpeed, bool bRestoreState);
	class UUMGSequencePlayer* PlayAnimationTimeRange(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState);
	void PlaySound(class USoundBase* SoundToPlay);
	void PreConstruct(bool IsDesignTime);
	void RegisterInputComponent();
	void RemoveFromViewport();
	void ReverseAnimation(const class UWidgetAnimation* InAnimation);
	void SetAlignmentInViewport(const struct FVector2D& Alignment);
	void SetAnchorsInViewport(const struct FAnchors& Anchors);
	void SetAnimationCurrentTime(const class UWidgetAnimation* InAnimation, float InTime);
	void SetColorAndOpacity(const struct FLinearColor& InColorAndOpacity);
	void SetDesiredSizeInViewport(const struct FVector2D& Size);
	void SetForegroundColor(const struct FSlateColor& InForegroundColor);
	void SetInputActionBlocking(bool bShouldBlock);
	void SetInputActionPriority(int32 NewPriority);
	void SetNumLoopsToPlay(const class UWidgetAnimation* InAnimation, int32 NumLoopsToPlay);
	void SetOwningPlayer(class APlayerController* LocalPlayerController);
	void SetPadding(const struct FMargin& InPadding);
	void SetPlaybackSpeed(const class UWidgetAnimation* InAnimation, float PlaybackSpeed);
	void SetPositionInViewport(const struct FVector2D& Position, bool bRemoveDPIScale);
	void StopAllAnimations();
	void StopAnimation(const class UWidgetAnimation* InAnimation);
	void StopAnimationsAndLatentActions();
	void StopListeningForAllInputActions();
	void StopListeningForInputAction(class FName ActionName, EInputEvent EventType);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UnbindAllFromAnimationFinished(class UWidgetAnimation* Animation);
	void UnbindAllFromAnimationStarted(class UWidgetAnimation* Animation);
	void UnbindFromAnimationFinished(class UWidgetAnimation* Animation, TDelegate<void()> Delegate);
	void UnbindFromAnimationStarted(class UWidgetAnimation* Animation, TDelegate<void()> Delegate);
	void UnregisterInputComponent();

	struct FVector2D GetAlignmentInViewport() const;
	struct FAnchors GetAnchorsInViewport() const;
	float GetAnimationCurrentTime(const class UWidgetAnimation* InAnimation) const;
	bool GetIsVisible() const;
	class APlayerCameraManager* GetOwningPlayerCameraManager() const;
	class APawn* GetOwningPlayerPawn() const;
	bool IsAnimationPlaying(const class UWidgetAnimation* InAnimation) const;
	bool IsAnyAnimationPlaying() const;
	bool IsInteractable() const;
	bool IsInViewport() const;
	bool IsListeningForInputAction(class FName ActionName) const;
	bool IsPlayingAnimation() const;
	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UserWidget">();
	}
	static class UUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUserWidget>();
	}
};
static_assert(alignof(UUserWidget) == 0x000008, "Wrong alignment on UUserWidget");
static_assert(sizeof(UUserWidget) == 0x000298, "Wrong size on UUserWidget");
static_assert(offsetof(UUserWidget, ColorAndOpacity) == 0x000138, "Member 'UUserWidget::ColorAndOpacity' has a wrong offset!");
static_assert(offsetof(UUserWidget, ColorAndOpacityDelegate) == 0x000148, "Member 'UUserWidget::ColorAndOpacityDelegate' has a wrong offset!");
static_assert(offsetof(UUserWidget, ForegroundColor) == 0x000158, "Member 'UUserWidget::ForegroundColor' has a wrong offset!");
static_assert(offsetof(UUserWidget, ForegroundColorDelegate) == 0x00016C, "Member 'UUserWidget::ForegroundColorDelegate' has a wrong offset!");
static_assert(offsetof(UUserWidget, OnVisibilityChanged) == 0x000180, "Member 'UUserWidget::OnVisibilityChanged' has a wrong offset!");
static_assert(offsetof(UUserWidget, Padding) == 0x0001A8, "Member 'UUserWidget::Padding' has a wrong offset!");
static_assert(offsetof(UUserWidget, ActiveSequencePlayers) == 0x0001B8, "Member 'UUserWidget::ActiveSequencePlayers' has a wrong offset!");
static_assert(offsetof(UUserWidget, AnimationTickManager) == 0x0001C8, "Member 'UUserWidget::AnimationTickManager' has a wrong offset!");
static_assert(offsetof(UUserWidget, StoppedSequencePlayers) == 0x0001D0, "Member 'UUserWidget::StoppedSequencePlayers' has a wrong offset!");
static_assert(offsetof(UUserWidget, NamedSlotBindings) == 0x0001E0, "Member 'UUserWidget::NamedSlotBindings' has a wrong offset!");
static_assert(offsetof(UUserWidget, WidgetTree) == 0x0001F0, "Member 'UUserWidget::WidgetTree' has a wrong offset!");
static_assert(offsetof(UUserWidget, Priority) == 0x0001F8, "Member 'UUserWidget::Priority' has a wrong offset!");
static_assert(offsetof(UUserWidget, TickFrequency) == 0x000210, "Member 'UUserWidget::TickFrequency' has a wrong offset!");
static_assert(offsetof(UUserWidget, InputComponent) == 0x000218, "Member 'UUserWidget::InputComponent' has a wrong offset!");
static_assert(offsetof(UUserWidget, AnimationCallbacks) == 0x000220, "Member 'UUserWidget::AnimationCallbacks' has a wrong offset!");

// Class UMG.TextLayoutWidget
// 0x0020 (0x0150 - 0x0130)
class UTextLayoutWidget : public UWidget
{
public:
	struct FShapedTextOptions                     ShapedTextOptions;                                 // 0x0130(0x0003)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	ETextJustify                                  Justification;                                     // 0x0133(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextWrappingPolicy                           WrappingPolicy;                                    // 0x0134(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         AutoWrapText : 1;                                  // 0x0135(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WrapTextAt;                                        // 0x0138(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMargin                                Margin;                                            // 0x013C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	float                                         LineHeightPercentage;                              // 0x014C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetJustification(ETextJustify InJustification);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TextLayoutWidget">();
	}
	static class UTextLayoutWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTextLayoutWidget>();
	}
};
static_assert(alignof(UTextLayoutWidget) == 0x000008, "Wrong alignment on UTextLayoutWidget");
static_assert(sizeof(UTextLayoutWidget) == 0x000150, "Wrong size on UTextLayoutWidget");
static_assert(offsetof(UTextLayoutWidget, ShapedTextOptions) == 0x000130, "Member 'UTextLayoutWidget::ShapedTextOptions' has a wrong offset!");
static_assert(offsetof(UTextLayoutWidget, Justification) == 0x000133, "Member 'UTextLayoutWidget::Justification' has a wrong offset!");
static_assert(offsetof(UTextLayoutWidget, WrappingPolicy) == 0x000134, "Member 'UTextLayoutWidget::WrappingPolicy' has a wrong offset!");
static_assert(offsetof(UTextLayoutWidget, WrapTextAt) == 0x000138, "Member 'UTextLayoutWidget::WrapTextAt' has a wrong offset!");
static_assert(offsetof(UTextLayoutWidget, Margin) == 0x00013C, "Member 'UTextLayoutWidget::Margin' has a wrong offset!");
static_assert(offsetof(UTextLayoutWidget, LineHeightPercentage) == 0x00014C, "Member 'UTextLayoutWidget::LineHeightPercentage' has a wrong offset!");

// Class UMG.MultiLineEditableText
// 0x0480 (0x05D0 - 0x0150)
class UMultiLineEditableText final : public UTextLayoutWidget
{
public:
	class FText                                   Text;                                              // 0x0150(0x0018)(Edit, NativeAccessSpecifierPublic)
	class FText                                   HintText;                                          // 0x0168(0x0018)(Edit, NativeAccessSpecifierPublic)
	TDelegate<void()>                             HintTextDelegate;                                  // 0x0180(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        WidgetStyle;                                       // 0x0190(0x0370)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIsReadOnly;                                       // 0x0500(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         Font;                                              // 0x0508(0x0088)(Deprecated, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SelectAllTextWhenFocused;                          // 0x0590(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearTextSelectionOnFocusLoss;                     // 0x0591(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RevertTextOnEscape;                                // 0x0592(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearKeyboardFocusOnCommit;                        // 0x0593(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AllowContextMenu;                                  // 0x0594(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVirtualKeyboardOptions                VirtualKeyboardOptions;                            // 0x0595(0x0001)(Edit, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	EVirtualKeyboardDismissAction                 VirtualKeyboardDismissAction;                      // 0x0596(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_597[0x1];                                      // 0x0597(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTextChanged;                                     // 0x0598(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTextCommitted;                                   // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_5B8[0x18];                                     // 0x05B8(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnMultiLineEditableTextChangedEvent__DelegateSignature(const class FText& Text_0);
	void OnMultiLineEditableTextCommittedEvent__DelegateSignature(const class FText& Text_0, ETextCommit CommitMethod);
	void SetHintText(const class FText& InHintText);
	void SetIsReadOnly(bool bReadOnly);
	void SetText(const class FText& InText);
	void SetWidgetStyle(const struct FTextBlockStyle& InWidgetStyle);

	class FText GetHintText() const;
	class FText GetText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MultiLineEditableText">();
	}
	static class UMultiLineEditableText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiLineEditableText>();
	}
};
static_assert(alignof(UMultiLineEditableText) == 0x000010, "Wrong alignment on UMultiLineEditableText");
static_assert(sizeof(UMultiLineEditableText) == 0x0005D0, "Wrong size on UMultiLineEditableText");
static_assert(offsetof(UMultiLineEditableText, Text) == 0x000150, "Member 'UMultiLineEditableText::Text' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, HintText) == 0x000168, "Member 'UMultiLineEditableText::HintText' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, HintTextDelegate) == 0x000180, "Member 'UMultiLineEditableText::HintTextDelegate' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, WidgetStyle) == 0x000190, "Member 'UMultiLineEditableText::WidgetStyle' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, bIsReadOnly) == 0x000500, "Member 'UMultiLineEditableText::bIsReadOnly' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, Font) == 0x000508, "Member 'UMultiLineEditableText::Font' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, SelectAllTextWhenFocused) == 0x000590, "Member 'UMultiLineEditableText::SelectAllTextWhenFocused' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, ClearTextSelectionOnFocusLoss) == 0x000591, "Member 'UMultiLineEditableText::ClearTextSelectionOnFocusLoss' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, RevertTextOnEscape) == 0x000592, "Member 'UMultiLineEditableText::RevertTextOnEscape' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, ClearKeyboardFocusOnCommit) == 0x000593, "Member 'UMultiLineEditableText::ClearKeyboardFocusOnCommit' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, AllowContextMenu) == 0x000594, "Member 'UMultiLineEditableText::AllowContextMenu' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, VirtualKeyboardOptions) == 0x000595, "Member 'UMultiLineEditableText::VirtualKeyboardOptions' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, VirtualKeyboardDismissAction) == 0x000596, "Member 'UMultiLineEditableText::VirtualKeyboardDismissAction' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, OnTextChanged) == 0x000598, "Member 'UMultiLineEditableText::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UMultiLineEditableText, OnTextCommitted) == 0x0005A8, "Member 'UMultiLineEditableText::OnTextCommitted' has a wrong offset!");

// Class UMG.RichTextBlock
// 0x0770 (0x08C0 - 0x0150)
#pragma pack(push, 0x1)
class alignas(0x10) URichTextBlock : public UTextLayoutWidget
{
public:
	class FText                                   Text;                                              // 0x0150(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                             TextStyleSet;                                      // 0x0168(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class URichTextBlockDecorator>> DecoratorClasses;                                  // 0x0170(0x0010)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bOverrideDefaultStyle;                             // 0x0180(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_181[0xF];                                      // 0x0181(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        DefaultTextStyleOverride;                          // 0x0190(0x0370)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         MinDesiredWidth;                                   // 0x0500(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextTransformPolicy                          TextTransformPolicy;                               // 0x0504(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETextOverflowPolicy                           TextOverflowPolicy;                                // 0x0505(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_506[0xA];                                      // 0x0506(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        DefaultTextStyle;                                  // 0x0510(0x0370)(Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          GSTextWrapping;                                    // 0x0880(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          ForceCache;                                        // 0x0881(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_882[0x6];                                      // 0x0882(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URichTextBlockDecorator*>        InstanceDecorators;                                // 0x0888(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_898[0x20];                                     // 0x0898(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClearAllDefaultStyleOverrides();
	class URichTextBlockDecorator* GetDecoratorByClass(TSubclassOf<class URichTextBlockDecorator> DecoratorClass);
	class UMaterialInstanceDynamic* GetDefaultDynamicMaterial();
	void RefreshTextLayout();
	void SetAutoWrapText(bool InAutoTextWrap);
	void SetDefaultColorAndOpacity(const struct FSlateColor& InColorAndOpacity);
	void SetDefaultFont(const struct FSlateFontInfo& InFontInfo);
	void SetDefaultShadowColorAndOpacity(const struct FLinearColor& InShadowColorAndOpacity);
	void SetDefaultShadowOffset(const struct FVector2D& InShadowOffset);
	void SetDefaultStrikeBrush(struct FSlateBrush* InStrikeBrush);
	void SetDefaultTextStyle(const struct FTextBlockStyle& InDefaultTextStyle);
	void SetForceCache(bool InForceCache);
	void SetGSTextWrapping(bool InGSTextWrapping);
	void SetMinDesiredWidth(float InMinDesiredWidth);
	void SetText(const class FText& InText);
	void SetTextOverflowPolicy(ETextOverflowPolicy InOverflowPolicy);
	void SetTextStyleSet(class UDataTable* NewTextStyleSet);
	void SetTextTransformPolicy(ETextTransformPolicy InTransformPolicy);

	class FText GetText() const;
	int32 GetTextLineCount() const;
	float GetTextOccupiedWidth(const class FString& InTextContent) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RichTextBlock">();
	}
	static class URichTextBlock* GetDefaultObj()
	{
		return GetDefaultObjImpl<URichTextBlock>();
	}
};
#pragma pack(pop)
static_assert(alignof(URichTextBlock) == 0x000010, "Wrong alignment on URichTextBlock");
static_assert(sizeof(URichTextBlock) == 0x0008C0, "Wrong size on URichTextBlock");
static_assert(offsetof(URichTextBlock, Text) == 0x000150, "Member 'URichTextBlock::Text' has a wrong offset!");
static_assert(offsetof(URichTextBlock, TextStyleSet) == 0x000168, "Member 'URichTextBlock::TextStyleSet' has a wrong offset!");
static_assert(offsetof(URichTextBlock, DecoratorClasses) == 0x000170, "Member 'URichTextBlock::DecoratorClasses' has a wrong offset!");
static_assert(offsetof(URichTextBlock, bOverrideDefaultStyle) == 0x000180, "Member 'URichTextBlock::bOverrideDefaultStyle' has a wrong offset!");
static_assert(offsetof(URichTextBlock, DefaultTextStyleOverride) == 0x000190, "Member 'URichTextBlock::DefaultTextStyleOverride' has a wrong offset!");
static_assert(offsetof(URichTextBlock, MinDesiredWidth) == 0x000500, "Member 'URichTextBlock::MinDesiredWidth' has a wrong offset!");
static_assert(offsetof(URichTextBlock, TextTransformPolicy) == 0x000504, "Member 'URichTextBlock::TextTransformPolicy' has a wrong offset!");
static_assert(offsetof(URichTextBlock, TextOverflowPolicy) == 0x000505, "Member 'URichTextBlock::TextOverflowPolicy' has a wrong offset!");
static_assert(offsetof(URichTextBlock, DefaultTextStyle) == 0x000510, "Member 'URichTextBlock::DefaultTextStyle' has a wrong offset!");
static_assert(offsetof(URichTextBlock, GSTextWrapping) == 0x000880, "Member 'URichTextBlock::GSTextWrapping' has a wrong offset!");
static_assert(offsetof(URichTextBlock, ForceCache) == 0x000881, "Member 'URichTextBlock::ForceCache' has a wrong offset!");
static_assert(offsetof(URichTextBlock, InstanceDecorators) == 0x000888, "Member 'URichTextBlock::InstanceDecorators' has a wrong offset!");

// Class UMG.PropertyBinding
// 0x0038 (0x0060 - 0x0028)
class UPropertyBinding : public UObject
{
public:
	TWeakObjectPtr<class UObject>                 SourceObject;                                      // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDynamicPropertyPath                   SourcePath;                                        // 0x0030(0x0028)(NativeAccessSpecifierPublic)
	class FName                                   DestinationProperty;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyBinding">();
	}
	static class UPropertyBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyBinding>();
	}
};
static_assert(alignof(UPropertyBinding) == 0x000008, "Wrong alignment on UPropertyBinding");
static_assert(sizeof(UPropertyBinding) == 0x000060, "Wrong size on UPropertyBinding");
static_assert(offsetof(UPropertyBinding, SourceObject) == 0x000028, "Member 'UPropertyBinding::SourceObject' has a wrong offset!");
static_assert(offsetof(UPropertyBinding, SourcePath) == 0x000030, "Member 'UPropertyBinding::SourcePath' has a wrong offset!");
static_assert(offsetof(UPropertyBinding, DestinationProperty) == 0x000058, "Member 'UPropertyBinding::DestinationProperty' has a wrong offset!");

// Class UMG.ColorBinding
// 0x0008 (0x0068 - 0x0060)
class UColorBinding final : public UPropertyBinding
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FLinearColor GetLinearValue() const;
	struct FSlateColor GetSlateValue() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ColorBinding">();
	}
	static class UColorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorBinding>();
	}
};
static_assert(alignof(UColorBinding) == 0x000008, "Wrong alignment on UColorBinding");
static_assert(sizeof(UColorBinding) == 0x000068, "Wrong size on UColorBinding");

// Class UMG.PanelWidget
// 0x0018 (0x0148 - 0x0130)
class UPanelWidget : public UWidget
{
public:
	TArray<class UPanelSlot*>                     Slots;                                             // 0x0130(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_140[0x8];                                      // 0x0140(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UPanelSlot* AddChild(class UWidget* Content);
	void ClearChildren();
	bool RemoveChild(class UWidget* Content);
	bool RemoveChildAt(int32 Index_0);

	TArray<class UWidget*> GetAllChildren() const;
	class UWidget* GetChildAt(int32 Index_0) const;
	int32 GetChildIndex(const class UWidget* Content) const;
	int32 GetChildrenCount() const;
	bool HasAnyChildren() const;
	bool HasChild(class UWidget* Content) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PanelWidget">();
	}
	static class UPanelWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPanelWidget>();
	}
};
static_assert(alignof(UPanelWidget) == 0x000008, "Wrong alignment on UPanelWidget");
static_assert(sizeof(UPanelWidget) == 0x000148, "Wrong size on UPanelWidget");
static_assert(offsetof(UPanelWidget, Slots) == 0x000130, "Member 'UPanelWidget::Slots' has a wrong offset!");

// Class UMG.CanvasPanel
// 0x0010 (0x0158 - 0x0148)
class UCanvasPanel : public UPanelWidget
{
public:
	uint8                                         Pad_148[0x10];                                     // 0x0148(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UCanvasPanelSlot* AddChildToCanvas(class UWidget* Content);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CanvasPanel">();
	}
	static class UCanvasPanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCanvasPanel>();
	}
};
static_assert(alignof(UCanvasPanel) == 0x000008, "Wrong alignment on UCanvasPanel");
static_assert(sizeof(UCanvasPanel) == 0x000158, "Wrong size on UCanvasPanel");

// Class UMG.MovieSceneMarginSection
// 0x03A8 (0x0490 - 0x00E8)
class UMovieSceneMarginSection final : public UMovieSceneSection
{
public:
	uint8                                         Pad_E8[0x8];                                       // 0x00E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneFloatChannel                TopCurve;                                          // 0x00F0(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                LeftCurve;                                         // 0x01D8(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                RightCurve;                                        // 0x02C0(0x00E8)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                BottomCurve;                                       // 0x03A8(0x00E8)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneMarginSection">();
	}
	static class UMovieSceneMarginSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneMarginSection>();
	}
};
static_assert(alignof(UMovieSceneMarginSection) == 0x000008, "Wrong alignment on UMovieSceneMarginSection");
static_assert(sizeof(UMovieSceneMarginSection) == 0x000490, "Wrong size on UMovieSceneMarginSection");
static_assert(offsetof(UMovieSceneMarginSection, TopCurve) == 0x0000F0, "Member 'UMovieSceneMarginSection::TopCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, LeftCurve) == 0x0001D8, "Member 'UMovieSceneMarginSection::LeftCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, RightCurve) == 0x0002C0, "Member 'UMovieSceneMarginSection::RightCurve' has a wrong offset!");
static_assert(offsetof(UMovieSceneMarginSection, BottomCurve) == 0x0003A8, "Member 'UMovieSceneMarginSection::BottomCurve' has a wrong offset!");

// Class UMG.ContentWidget
// 0x0000 (0x0148 - 0x0148)
class UContentWidget : public UPanelWidget
{
public:
	class UPanelSlot* SetContent(class UWidget* Content);

	class UWidget* GetContent() const;
	class UPanelSlot* GetContentSlot() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentWidget">();
	}
	static class UContentWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentWidget>();
	}
};
static_assert(alignof(UContentWidget) == 0x000008, "Wrong alignment on UContentWidget");
static_assert(sizeof(UContentWidget) == 0x000148, "Wrong size on UContentWidget");

// Class UMG.BackgroundBlur
// 0x01F8 (0x0340 - 0x0148)
class UBackgroundBlur : public UContentWidget
{
public:
	struct FMargin                                Padding;                                           // 0x0148(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0158(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EVerticalAlignment                            VerticalAlignment;                                 // 0x0159(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyAlphaToBlur;                                 // 0x015A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15B[0x1];                                      // 0x015B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlurStrength;                                      // 0x015C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideAutoRadiusCalculation;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BlurRadius;                                        // 0x0164(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CornerRadius;                                      // 0x0170(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateBrush                            LowQualityFallbackBrush;                           // 0x0190(0x00D0)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GSBlurMaskBrush;                                   // 0x0260(0x00D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetApplyAlphaToBlur(bool bInApplyAlphaToBlur);
	void SetBlurRadius(int32 InBlurRadius);
	void SetBlurStrength(float InStrength);
	void SetCornerRadius(const struct FVector4& InCornerRadius);
	void SetGSBlurMaskBrush(const struct FSlateBrush& InBrush);
	void SetHorizontalAlignment(EHorizontalAlignment InHorizontalAlignment);
	void SetLowQualityFallbackBrush(const struct FSlateBrush& InBrush);
	void SetPadding(const struct FMargin& InPadding);
	void SetVerticalAlignment(EVerticalAlignment InVerticalAlignment);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BackgroundBlur">();
	}
	static class UBackgroundBlur* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackgroundBlur>();
	}
};
static_assert(alignof(UBackgroundBlur) == 0x000010, "Wrong alignment on UBackgroundBlur");
static_assert(sizeof(UBackgroundBlur) == 0x000340, "Wrong size on UBackgroundBlur");
static_assert(offsetof(UBackgroundBlur, Padding) == 0x000148, "Member 'UBackgroundBlur::Padding' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, HorizontalAlignment) == 0x000158, "Member 'UBackgroundBlur::HorizontalAlignment' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, VerticalAlignment) == 0x000159, "Member 'UBackgroundBlur::VerticalAlignment' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, bApplyAlphaToBlur) == 0x00015A, "Member 'UBackgroundBlur::bApplyAlphaToBlur' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, BlurStrength) == 0x00015C, "Member 'UBackgroundBlur::BlurStrength' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, bOverrideAutoRadiusCalculation) == 0x000160, "Member 'UBackgroundBlur::bOverrideAutoRadiusCalculation' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, BlurRadius) == 0x000164, "Member 'UBackgroundBlur::BlurRadius' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, CornerRadius) == 0x000170, "Member 'UBackgroundBlur::CornerRadius' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, LowQualityFallbackBrush) == 0x000190, "Member 'UBackgroundBlur::LowQualityFallbackBrush' has a wrong offset!");
static_assert(offsetof(UBackgroundBlur, GSBlurMaskBrush) == 0x000260, "Member 'UBackgroundBlur::GSBlurMaskBrush' has a wrong offset!");

// Class UMG.InvalidationBox
// 0x0018 (0x0160 - 0x0148)
class UInvalidationBox final : public UContentWidget
{
public:
	bool                                          bCanCache;                                         // 0x0148(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CacheRelativeTransforms;                           // 0x0149(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_14A[0x16];                                     // 0x014A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InvalidateCache();
	void SetCanCache(bool CanCache);

	bool GetCanCache() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InvalidationBox">();
	}
	static class UInvalidationBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInvalidationBox>();
	}
};
static_assert(alignof(UInvalidationBox) == 0x000008, "Wrong alignment on UInvalidationBox");
static_assert(sizeof(UInvalidationBox) == 0x000160, "Wrong size on UInvalidationBox");
static_assert(offsetof(UInvalidationBox, bCanCache) == 0x000148, "Member 'UInvalidationBox::bCanCache' has a wrong offset!");
static_assert(offsetof(UInvalidationBox, CacheRelativeTransforms) == 0x000149, "Member 'UInvalidationBox::CacheRelativeTransforms' has a wrong offset!");

// Class UMG.ComboBoxString
// 0x1510 (0x1640 - 0x0130)
class UComboBoxString final : public UWidget
{
public:
	TArray<class FString>                         DefaultOptions;                                    // 0x0130(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FString                                 SelectedOption;                                    // 0x0140(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FComboBoxStyle                         WidgetStyle;                                       // 0x0150(0x0660)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTableRowStyle                         ItemStyle;                                         // 0x07B0(0x0D50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
