#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UMG.Widget.ForceVolatile
// 0x0001 (0x0001 - 0x0000)
struct Widget_ForceVolatile final
{
public:
	bool                                          bForce;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_ForceVolatile) == 0x000001, "Wrong alignment on Widget_ForceVolatile");
static_assert(sizeof(Widget_ForceVolatile) == 0x000001, "Wrong size on Widget_ForceVolatile");
static_assert(offsetof(Widget_ForceVolatile, bForce) == 0x000000, "Member 'Widget_ForceVolatile::bForce' has a wrong offset!");

// DelegateFunction UMG.Widget.GenerateWidgetForObject__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Widget_GenerateWidgetForObject__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GenerateWidgetForObject__DelegateSignature) == 0x000008, "Wrong alignment on Widget_GenerateWidgetForObject__DelegateSignature");
static_assert(sizeof(Widget_GenerateWidgetForObject__DelegateSignature) == 0x000010, "Wrong size on Widget_GenerateWidgetForObject__DelegateSignature");
static_assert(offsetof(Widget_GenerateWidgetForObject__DelegateSignature, Item) == 0x000000, "Member 'Widget_GenerateWidgetForObject__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(Widget_GenerateWidgetForObject__DelegateSignature, ReturnValue) == 0x000008, "Member 'Widget_GenerateWidgetForObject__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GenerateWidgetForString__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Widget_GenerateWidgetForString__DelegateSignature final
{
public:
	class FString                                 Item;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GenerateWidgetForString__DelegateSignature) == 0x000008, "Wrong alignment on Widget_GenerateWidgetForString__DelegateSignature");
static_assert(sizeof(Widget_GenerateWidgetForString__DelegateSignature) == 0x000018, "Wrong size on Widget_GenerateWidgetForString__DelegateSignature");
static_assert(offsetof(Widget_GenerateWidgetForString__DelegateSignature, Item) == 0x000000, "Member 'Widget_GenerateWidgetForString__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(Widget_GenerateWidgetForString__DelegateSignature, ReturnValue) == 0x000010, "Member 'Widget_GenerateWidgetForString__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetBool__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetBool__DelegateSignature final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetBool__DelegateSignature) == 0x000001, "Wrong alignment on Widget_GetBool__DelegateSignature");
static_assert(sizeof(Widget_GetBool__DelegateSignature) == 0x000001, "Wrong size on Widget_GetBool__DelegateSignature");
static_assert(offsetof(Widget_GetBool__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetBool__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetCheckBoxState__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetCheckBoxState__DelegateSignature final
{
public:
	ECheckBoxState                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetCheckBoxState__DelegateSignature) == 0x000001, "Wrong alignment on Widget_GetCheckBoxState__DelegateSignature");
static_assert(sizeof(Widget_GetCheckBoxState__DelegateSignature) == 0x000001, "Wrong size on Widget_GetCheckBoxState__DelegateSignature");
static_assert(offsetof(Widget_GetCheckBoxState__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetCheckBoxState__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetFloat__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Widget_GetFloat__DelegateSignature final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetFloat__DelegateSignature) == 0x000004, "Wrong alignment on Widget_GetFloat__DelegateSignature");
static_assert(sizeof(Widget_GetFloat__DelegateSignature) == 0x000004, "Wrong size on Widget_GetFloat__DelegateSignature");
static_assert(offsetof(Widget_GetFloat__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetFloat__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetInt32__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct Widget_GetInt32__DelegateSignature final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetInt32__DelegateSignature) == 0x000004, "Wrong alignment on Widget_GetInt32__DelegateSignature");
static_assert(sizeof(Widget_GetInt32__DelegateSignature) == 0x000004, "Wrong size on Widget_GetInt32__DelegateSignature");
static_assert(offsetof(Widget_GetInt32__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetInt32__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetLinearColor__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Widget_GetLinearColor__DelegateSignature final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetLinearColor__DelegateSignature) == 0x000004, "Wrong alignment on Widget_GetLinearColor__DelegateSignature");
static_assert(sizeof(Widget_GetLinearColor__DelegateSignature) == 0x000010, "Wrong size on Widget_GetLinearColor__DelegateSignature");
static_assert(offsetof(Widget_GetLinearColor__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetLinearColor__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetMouseCursor__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetMouseCursor__DelegateSignature final
{
public:
	EMouseCursor                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetMouseCursor__DelegateSignature) == 0x000001, "Wrong alignment on Widget_GetMouseCursor__DelegateSignature");
static_assert(sizeof(Widget_GetMouseCursor__DelegateSignature) == 0x000001, "Wrong size on Widget_GetMouseCursor__DelegateSignature");
static_assert(offsetof(Widget_GetMouseCursor__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetMouseCursor__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetSlateBrush__DelegateSignature
// 0x00D0 (0x00D0 - 0x0000)
struct Widget_GetSlateBrush__DelegateSignature final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetSlateBrush__DelegateSignature) == 0x000010, "Wrong alignment on Widget_GetSlateBrush__DelegateSignature");
static_assert(sizeof(Widget_GetSlateBrush__DelegateSignature) == 0x0000D0, "Wrong size on Widget_GetSlateBrush__DelegateSignature");
static_assert(offsetof(Widget_GetSlateBrush__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetSlateBrush__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetSlateColor__DelegateSignature
// 0x0014 (0x0014 - 0x0000)
struct Widget_GetSlateColor__DelegateSignature final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetSlateColor__DelegateSignature) == 0x000004, "Wrong alignment on Widget_GetSlateColor__DelegateSignature");
static_assert(sizeof(Widget_GetSlateColor__DelegateSignature) == 0x000014, "Wrong size on Widget_GetSlateColor__DelegateSignature");
static_assert(offsetof(Widget_GetSlateColor__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetSlateColor__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetSlateVisibility__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetSlateVisibility__DelegateSignature final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetSlateVisibility__DelegateSignature) == 0x000001, "Wrong alignment on Widget_GetSlateVisibility__DelegateSignature");
static_assert(sizeof(Widget_GetSlateVisibility__DelegateSignature) == 0x000001, "Wrong size on Widget_GetSlateVisibility__DelegateSignature");
static_assert(offsetof(Widget_GetSlateVisibility__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetSlateVisibility__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetText__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct Widget_GetText__DelegateSignature final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetText__DelegateSignature) == 0x000008, "Wrong alignment on Widget_GetText__DelegateSignature");
static_assert(sizeof(Widget_GetText__DelegateSignature) == 0x000018, "Wrong size on Widget_GetText__DelegateSignature");
static_assert(offsetof(Widget_GetText__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetText__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.GetWidget__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Widget_GetWidget__DelegateSignature final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetWidget__DelegateSignature) == 0x000008, "Wrong alignment on Widget_GetWidget__DelegateSignature");
static_assert(sizeof(Widget_GetWidget__DelegateSignature) == 0x000008, "Wrong size on Widget_GetWidget__DelegateSignature");
static_assert(offsetof(Widget_GetWidget__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_GetWidget__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.OnPointerEvent__DelegateSignature
// 0x0188 (0x0188 - 0x0000)
struct Widget_OnPointerEvent__DelegateSignature final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0040)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0040(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00D0(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_OnPointerEvent__DelegateSignature) == 0x000008, "Wrong alignment on Widget_OnPointerEvent__DelegateSignature");
static_assert(sizeof(Widget_OnPointerEvent__DelegateSignature) == 0x000188, "Wrong size on Widget_OnPointerEvent__DelegateSignature");
static_assert(offsetof(Widget_OnPointerEvent__DelegateSignature, MyGeometry) == 0x000000, "Member 'Widget_OnPointerEvent__DelegateSignature::MyGeometry' has a wrong offset!");
static_assert(offsetof(Widget_OnPointerEvent__DelegateSignature, MouseEvent) == 0x000040, "Member 'Widget_OnPointerEvent__DelegateSignature::MouseEvent' has a wrong offset!");
static_assert(offsetof(Widget_OnPointerEvent__DelegateSignature, ReturnValue) == 0x0000D0, "Member 'Widget_OnPointerEvent__DelegateSignature::ReturnValue' has a wrong offset!");

// DelegateFunction UMG.Widget.OnReply__DelegateSignature
// 0x00B8 (0x00B8 - 0x0000)
struct Widget_OnReply__DelegateSignature final
{
public:
	struct FEventReply                            ReturnValue;                                       // 0x0000(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_OnReply__DelegateSignature) == 0x000008, "Wrong alignment on Widget_OnReply__DelegateSignature");
static_assert(sizeof(Widget_OnReply__DelegateSignature) == 0x0000B8, "Wrong size on Widget_OnReply__DelegateSignature");
static_assert(offsetof(Widget_OnReply__DelegateSignature, ReturnValue) == 0x000000, "Member 'Widget_OnReply__DelegateSignature::ReturnValue' has a wrong offset!");

// Function UMG.Widget.SetAllNavigationRules
// 0x000C (0x000C - 0x0000)
struct Widget_SetAllNavigationRules final
{
public:
	EUINavigationRule                             Rule;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WidgetToFocus;                                     // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetAllNavigationRules) == 0x000004, "Wrong alignment on Widget_SetAllNavigationRules");
static_assert(sizeof(Widget_SetAllNavigationRules) == 0x00000C, "Wrong size on Widget_SetAllNavigationRules");
static_assert(offsetof(Widget_SetAllNavigationRules, Rule) == 0x000000, "Member 'Widget_SetAllNavigationRules::Rule' has a wrong offset!");
static_assert(offsetof(Widget_SetAllNavigationRules, WidgetToFocus) == 0x000004, "Member 'Widget_SetAllNavigationRules::WidgetToFocus' has a wrong offset!");

// Function UMG.Widget.SetClipping
// 0x0001 (0x0001 - 0x0000)
struct Widget_SetClipping final
{
public:
	EWidgetClipping                               InClipping;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetClipping) == 0x000001, "Wrong alignment on Widget_SetClipping");
static_assert(sizeof(Widget_SetClipping) == 0x000001, "Wrong size on Widget_SetClipping");
static_assert(offsetof(Widget_SetClipping, InClipping) == 0x000000, "Member 'Widget_SetClipping::InClipping' has a wrong offset!");

// Function UMG.Widget.SetCursor
// 0x0001 (0x0001 - 0x0000)
struct Widget_SetCursor final
{
public:
	EMouseCursor                                  InCursor;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetCursor) == 0x000001, "Wrong alignment on Widget_SetCursor");
static_assert(sizeof(Widget_SetCursor) == 0x000001, "Wrong size on Widget_SetCursor");
static_assert(offsetof(Widget_SetCursor, InCursor) == 0x000000, "Member 'Widget_SetCursor::InCursor' has a wrong offset!");

// Function UMG.Widget.SetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct Widget_SetIsEnabled final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetIsEnabled) == 0x000001, "Wrong alignment on Widget_SetIsEnabled");
static_assert(sizeof(Widget_SetIsEnabled) == 0x000001, "Wrong size on Widget_SetIsEnabled");
static_assert(offsetof(Widget_SetIsEnabled, bInIsEnabled) == 0x000000, "Member 'Widget_SetIsEnabled::bInIsEnabled' has a wrong offset!");

// Function UMG.Widget.SetNavigationRule
// 0x000C (0x000C - 0x0000)
struct Widget_SetNavigationRule final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUINavigationRule                             Rule;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WidgetToFocus;                                     // 0x0004(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetNavigationRule) == 0x000004, "Wrong alignment on Widget_SetNavigationRule");
static_assert(sizeof(Widget_SetNavigationRule) == 0x00000C, "Wrong size on Widget_SetNavigationRule");
static_assert(offsetof(Widget_SetNavigationRule, Direction) == 0x000000, "Member 'Widget_SetNavigationRule::Direction' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRule, Rule) == 0x000001, "Member 'Widget_SetNavigationRule::Rule' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRule, WidgetToFocus) == 0x000004, "Member 'Widget_SetNavigationRule::WidgetToFocus' has a wrong offset!");

// Function UMG.Widget.SetNavigationRuleBase
// 0x0002 (0x0002 - 0x0000)
struct Widget_SetNavigationRuleBase final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUINavigationRule                             Rule;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetNavigationRuleBase) == 0x000001, "Wrong alignment on Widget_SetNavigationRuleBase");
static_assert(sizeof(Widget_SetNavigationRuleBase) == 0x000002, "Wrong size on Widget_SetNavigationRuleBase");
static_assert(offsetof(Widget_SetNavigationRuleBase, Direction) == 0x000000, "Member 'Widget_SetNavigationRuleBase::Direction' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRuleBase, Rule) == 0x000001, "Member 'Widget_SetNavigationRuleBase::Rule' has a wrong offset!");

// Function UMG.Widget.SetNavigationRuleCustom
// 0x0014 (0x0014 - 0x0000)
struct Widget_SetNavigationRuleCustom final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUINavigation Navigation)>     InCustomDelegate;                                  // 0x0004(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetNavigationRuleCustom) == 0x000004, "Wrong alignment on Widget_SetNavigationRuleCustom");
static_assert(sizeof(Widget_SetNavigationRuleCustom) == 0x000014, "Wrong size on Widget_SetNavigationRuleCustom");
static_assert(offsetof(Widget_SetNavigationRuleCustom, Direction) == 0x000000, "Member 'Widget_SetNavigationRuleCustom::Direction' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRuleCustom, InCustomDelegate) == 0x000004, "Member 'Widget_SetNavigationRuleCustom::InCustomDelegate' has a wrong offset!");

// Function UMG.Widget.SetNavigationRuleCustomBoundary
// 0x0014 (0x0014 - 0x0000)
struct Widget_SetNavigationRuleCustomBoundary final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EUINavigation Navigation)>     InCustomDelegate;                                  // 0x0004(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetNavigationRuleCustomBoundary) == 0x000004, "Wrong alignment on Widget_SetNavigationRuleCustomBoundary");
static_assert(sizeof(Widget_SetNavigationRuleCustomBoundary) == 0x000014, "Wrong size on Widget_SetNavigationRuleCustomBoundary");
static_assert(offsetof(Widget_SetNavigationRuleCustomBoundary, Direction) == 0x000000, "Member 'Widget_SetNavigationRuleCustomBoundary::Direction' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRuleCustomBoundary, InCustomDelegate) == 0x000004, "Member 'Widget_SetNavigationRuleCustomBoundary::InCustomDelegate' has a wrong offset!");

// Function UMG.Widget.SetNavigationRuleExplicit
// 0x0010 (0x0010 - 0x0000)
struct Widget_SetNavigationRuleExplicit final
{
public:
	EUINavigation                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                InWidget;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetNavigationRuleExplicit) == 0x000008, "Wrong alignment on Widget_SetNavigationRuleExplicit");
static_assert(sizeof(Widget_SetNavigationRuleExplicit) == 0x000010, "Wrong size on Widget_SetNavigationRuleExplicit");
static_assert(offsetof(Widget_SetNavigationRuleExplicit, Direction) == 0x000000, "Member 'Widget_SetNavigationRuleExplicit::Direction' has a wrong offset!");
static_assert(offsetof(Widget_SetNavigationRuleExplicit, InWidget) == 0x000008, "Member 'Widget_SetNavigationRuleExplicit::InWidget' has a wrong offset!");

// Function UMG.Widget.SetPixelSnappingMethod
// 0x0001 (0x0001 - 0x0000)
struct Widget_SetPixelSnappingMethod final
{
public:
	EPixelSnappingMethod                          InPixelSnappingMethod;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetPixelSnappingMethod) == 0x000001, "Wrong alignment on Widget_SetPixelSnappingMethod");
static_assert(sizeof(Widget_SetPixelSnappingMethod) == 0x000001, "Wrong size on Widget_SetPixelSnappingMethod");
static_assert(offsetof(Widget_SetPixelSnappingMethod, InPixelSnappingMethod) == 0x000000, "Member 'Widget_SetPixelSnappingMethod::InPixelSnappingMethod' has a wrong offset!");

// Function UMG.Widget.SetRenderOpacity
// 0x0004 (0x0004 - 0x0000)
struct Widget_SetRenderOpacity final
{
public:
	float                                         InOpacity;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderOpacity) == 0x000004, "Wrong alignment on Widget_SetRenderOpacity");
static_assert(sizeof(Widget_SetRenderOpacity) == 0x000004, "Wrong size on Widget_SetRenderOpacity");
static_assert(offsetof(Widget_SetRenderOpacity, InOpacity) == 0x000000, "Member 'Widget_SetRenderOpacity::InOpacity' has a wrong offset!");

// Function UMG.Widget.SetRenderScale
// 0x0010 (0x0010 - 0x0000)
struct Widget_SetRenderScale final
{
public:
	struct FVector2D                              Scale;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderScale) == 0x000008, "Wrong alignment on Widget_SetRenderScale");
static_assert(sizeof(Widget_SetRenderScale) == 0x000010, "Wrong size on Widget_SetRenderScale");
static_assert(offsetof(Widget_SetRenderScale, Scale) == 0x000000, "Member 'Widget_SetRenderScale::Scale' has a wrong offset!");

// Function UMG.Widget.SetRenderShear
// 0x0010 (0x0010 - 0x0000)
struct Widget_SetRenderShear final
{
public:
	struct FVector2D                              Shear;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderShear) == 0x000008, "Wrong alignment on Widget_SetRenderShear");
static_assert(sizeof(Widget_SetRenderShear) == 0x000010, "Wrong size on Widget_SetRenderShear");
static_assert(offsetof(Widget_SetRenderShear, Shear) == 0x000000, "Member 'Widget_SetRenderShear::Shear' has a wrong offset!");

// Function UMG.Widget.SetRenderTransform
// 0x0038 (0x0038 - 0x0000)
struct Widget_SetRenderTransform final
{
public:
	struct FWidgetTransform                       InTransform;                                       // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderTransform) == 0x000008, "Wrong alignment on Widget_SetRenderTransform");
static_assert(sizeof(Widget_SetRenderTransform) == 0x000038, "Wrong size on Widget_SetRenderTransform");
static_assert(offsetof(Widget_SetRenderTransform, InTransform) == 0x000000, "Member 'Widget_SetRenderTransform::InTransform' has a wrong offset!");

// Function UMG.Widget.SetRenderTransformAngle
// 0x0004 (0x0004 - 0x0000)
struct Widget_SetRenderTransformAngle final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderTransformAngle) == 0x000004, "Wrong alignment on Widget_SetRenderTransformAngle");
static_assert(sizeof(Widget_SetRenderTransformAngle) == 0x000004, "Wrong size on Widget_SetRenderTransformAngle");
static_assert(offsetof(Widget_SetRenderTransformAngle, Angle) == 0x000000, "Member 'Widget_SetRenderTransformAngle::Angle' has a wrong offset!");

// Function UMG.Widget.SetRenderTransformPivot
// 0x0010 (0x0010 - 0x0000)
struct Widget_SetRenderTransformPivot final
{
public:
	struct FVector2D                              Pivot;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderTransformPivot) == 0x000008, "Wrong alignment on Widget_SetRenderTransformPivot");
static_assert(sizeof(Widget_SetRenderTransformPivot) == 0x000010, "Wrong size on Widget_SetRenderTransformPivot");
static_assert(offsetof(Widget_SetRenderTransformPivot, Pivot) == 0x000000, "Member 'Widget_SetRenderTransformPivot::Pivot' has a wrong offset!");

// Function UMG.Widget.SetRenderTranslation
// 0x0010 (0x0010 - 0x0000)
struct Widget_SetRenderTranslation final
{
public:
	struct FVector2D                              Translation;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetRenderTranslation) == 0x000008, "Wrong alignment on Widget_SetRenderTranslation");
static_assert(sizeof(Widget_SetRenderTranslation) == 0x000010, "Wrong size on Widget_SetRenderTranslation");
static_assert(offsetof(Widget_SetRenderTranslation, Translation) == 0x000000, "Member 'Widget_SetRenderTranslation::Translation' has a wrong offset!");

// Function UMG.Widget.SetToolTip
// 0x0008 (0x0008 - 0x0000)
struct Widget_SetToolTip final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetToolTip) == 0x000008, "Wrong alignment on Widget_SetToolTip");
static_assert(sizeof(Widget_SetToolTip) == 0x000008, "Wrong size on Widget_SetToolTip");
static_assert(offsetof(Widget_SetToolTip, Widget) == 0x000000, "Member 'Widget_SetToolTip::Widget' has a wrong offset!");

// Function UMG.Widget.SetToolTipText
// 0x0018 (0x0018 - 0x0000)
struct Widget_SetToolTipText final
{
public:
	class FText                                   InToolTipText;                                     // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetToolTipText) == 0x000008, "Wrong alignment on Widget_SetToolTipText");
static_assert(sizeof(Widget_SetToolTipText) == 0x000018, "Wrong size on Widget_SetToolTipText");
static_assert(offsetof(Widget_SetToolTipText, InToolTipText) == 0x000000, "Member 'Widget_SetToolTipText::InToolTipText' has a wrong offset!");

// Function UMG.Widget.SetUserFocus
// 0x0008 (0x0008 - 0x0000)
struct Widget_SetUserFocus final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetUserFocus) == 0x000008, "Wrong alignment on Widget_SetUserFocus");
static_assert(sizeof(Widget_SetUserFocus) == 0x000008, "Wrong size on Widget_SetUserFocus");
static_assert(offsetof(Widget_SetUserFocus, PlayerController) == 0x000000, "Member 'Widget_SetUserFocus::PlayerController' has a wrong offset!");

// Function UMG.Widget.SetVisibility
// 0x0001 (0x0001 - 0x0000)
struct Widget_SetVisibility final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_SetVisibility) == 0x000001, "Wrong alignment on Widget_SetVisibility");
static_assert(sizeof(Widget_SetVisibility) == 0x000001, "Wrong size on Widget_SetVisibility");
static_assert(offsetof(Widget_SetVisibility, InVisibility) == 0x000000, "Member 'Widget_SetVisibility::InVisibility' has a wrong offset!");

// Function UMG.Widget.GetAccessibleSummaryText
// 0x0018 (0x0018 - 0x0000)
struct Widget_GetAccessibleSummaryText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetAccessibleSummaryText) == 0x000008, "Wrong alignment on Widget_GetAccessibleSummaryText");
static_assert(sizeof(Widget_GetAccessibleSummaryText) == 0x000018, "Wrong size on Widget_GetAccessibleSummaryText");
static_assert(offsetof(Widget_GetAccessibleSummaryText, ReturnValue) == 0x000000, "Member 'Widget_GetAccessibleSummaryText::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetAccessibleText
// 0x0018 (0x0018 - 0x0000)
struct Widget_GetAccessibleText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetAccessibleText) == 0x000008, "Wrong alignment on Widget_GetAccessibleText");
static_assert(sizeof(Widget_GetAccessibleText) == 0x000018, "Wrong size on Widget_GetAccessibleText");
static_assert(offsetof(Widget_GetAccessibleText, ReturnValue) == 0x000000, "Member 'Widget_GetAccessibleText::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetCachedGeometry
// 0x0040 (0x0040 - 0x0000)
struct Widget_GetCachedGeometry final
{
public:
	struct FGeometry                              ReturnValue;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetCachedGeometry) == 0x000008, "Wrong alignment on Widget_GetCachedGeometry");
static_assert(sizeof(Widget_GetCachedGeometry) == 0x000040, "Wrong size on Widget_GetCachedGeometry");
static_assert(offsetof(Widget_GetCachedGeometry, ReturnValue) == 0x000000, "Member 'Widget_GetCachedGeometry::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetClipping
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetClipping final
{
public:
	EWidgetClipping                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetClipping) == 0x000001, "Wrong alignment on Widget_GetClipping");
static_assert(sizeof(Widget_GetClipping) == 0x000001, "Wrong size on Widget_GetClipping");
static_assert(offsetof(Widget_GetClipping, ReturnValue) == 0x000000, "Member 'Widget_GetClipping::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetDesiredSize
// 0x0010 (0x0010 - 0x0000)
struct Widget_GetDesiredSize final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetDesiredSize) == 0x000008, "Wrong alignment on Widget_GetDesiredSize");
static_assert(sizeof(Widget_GetDesiredSize) == 0x000010, "Wrong size on Widget_GetDesiredSize");
static_assert(offsetof(Widget_GetDesiredSize, ReturnValue) == 0x000000, "Member 'Widget_GetDesiredSize::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetGameInstance
// 0x0008 (0x0008 - 0x0000)
struct Widget_GetGameInstance final
{
public:
	class UGameInstance*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetGameInstance) == 0x000008, "Wrong alignment on Widget_GetGameInstance");
static_assert(sizeof(Widget_GetGameInstance) == 0x000008, "Wrong size on Widget_GetGameInstance");
static_assert(offsetof(Widget_GetGameInstance, ReturnValue) == 0x000000, "Member 'Widget_GetGameInstance::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetIsEnabled
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetIsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetIsEnabled) == 0x000001, "Wrong alignment on Widget_GetIsEnabled");
static_assert(sizeof(Widget_GetIsEnabled) == 0x000001, "Wrong size on Widget_GetIsEnabled");
static_assert(offsetof(Widget_GetIsEnabled, ReturnValue) == 0x000000, "Member 'Widget_GetIsEnabled::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetOwningLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct Widget_GetOwningLocalPlayer final
{
public:
	class ULocalPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetOwningLocalPlayer) == 0x000008, "Wrong alignment on Widget_GetOwningLocalPlayer");
static_assert(sizeof(Widget_GetOwningLocalPlayer) == 0x000008, "Wrong size on Widget_GetOwningLocalPlayer");
static_assert(offsetof(Widget_GetOwningLocalPlayer, ReturnValue) == 0x000000, "Member 'Widget_GetOwningLocalPlayer::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetOwningPlayer
// 0x0008 (0x0008 - 0x0000)
struct Widget_GetOwningPlayer final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetOwningPlayer) == 0x000008, "Wrong alignment on Widget_GetOwningPlayer");
static_assert(sizeof(Widget_GetOwningPlayer) == 0x000008, "Wrong size on Widget_GetOwningPlayer");
static_assert(offsetof(Widget_GetOwningPlayer, ReturnValue) == 0x000000, "Member 'Widget_GetOwningPlayer::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetPaintSpaceGeometry
// 0x0040 (0x0040 - 0x0000)
struct Widget_GetPaintSpaceGeometry final
{
public:
	struct FGeometry                              ReturnValue;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetPaintSpaceGeometry) == 0x000008, "Wrong alignment on Widget_GetPaintSpaceGeometry");
static_assert(sizeof(Widget_GetPaintSpaceGeometry) == 0x000040, "Wrong size on Widget_GetPaintSpaceGeometry");
static_assert(offsetof(Widget_GetPaintSpaceGeometry, ReturnValue) == 0x000000, "Member 'Widget_GetPaintSpaceGeometry::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetParent
// 0x0008 (0x0008 - 0x0000)
struct Widget_GetParent final
{
public:
	class UPanelWidget*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetParent) == 0x000008, "Wrong alignment on Widget_GetParent");
static_assert(sizeof(Widget_GetParent) == 0x000008, "Wrong size on Widget_GetParent");
static_assert(offsetof(Widget_GetParent, ReturnValue) == 0x000000, "Member 'Widget_GetParent::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetPixelSnappingMethod
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetPixelSnappingMethod final
{
public:
	EPixelSnappingMethod                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetPixelSnappingMethod) == 0x000001, "Wrong alignment on Widget_GetPixelSnappingMethod");
static_assert(sizeof(Widget_GetPixelSnappingMethod) == 0x000001, "Wrong size on Widget_GetPixelSnappingMethod");
static_assert(offsetof(Widget_GetPixelSnappingMethod, ReturnValue) == 0x000000, "Member 'Widget_GetPixelSnappingMethod::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetRenderOpacity
// 0x0004 (0x0004 - 0x0000)
struct Widget_GetRenderOpacity final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetRenderOpacity) == 0x000004, "Wrong alignment on Widget_GetRenderOpacity");
static_assert(sizeof(Widget_GetRenderOpacity) == 0x000004, "Wrong size on Widget_GetRenderOpacity");
static_assert(offsetof(Widget_GetRenderOpacity, ReturnValue) == 0x000000, "Member 'Widget_GetRenderOpacity::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetRenderTransformAngle
// 0x0004 (0x0004 - 0x0000)
struct Widget_GetRenderTransformAngle final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetRenderTransformAngle) == 0x000004, "Wrong alignment on Widget_GetRenderTransformAngle");
static_assert(sizeof(Widget_GetRenderTransformAngle) == 0x000004, "Wrong size on Widget_GetRenderTransformAngle");
static_assert(offsetof(Widget_GetRenderTransformAngle, ReturnValue) == 0x000000, "Member 'Widget_GetRenderTransformAngle::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetTickSpaceGeometry
// 0x0040 (0x0040 - 0x0000)
struct Widget_GetTickSpaceGeometry final
{
public:
	struct FGeometry                              ReturnValue;                                       // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetTickSpaceGeometry) == 0x000008, "Wrong alignment on Widget_GetTickSpaceGeometry");
static_assert(sizeof(Widget_GetTickSpaceGeometry) == 0x000040, "Wrong size on Widget_GetTickSpaceGeometry");
static_assert(offsetof(Widget_GetTickSpaceGeometry, ReturnValue) == 0x000000, "Member 'Widget_GetTickSpaceGeometry::ReturnValue' has a wrong offset!");

// Function UMG.Widget.GetVisibility
// 0x0001 (0x0001 - 0x0000)
struct Widget_GetVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_GetVisibility) == 0x000001, "Wrong alignment on Widget_GetVisibility");
static_assert(sizeof(Widget_GetVisibility) == 0x000001, "Wrong size on Widget_GetVisibility");
static_assert(offsetof(Widget_GetVisibility, ReturnValue) == 0x000000, "Member 'Widget_GetVisibility::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasAnyUserFocus
// 0x0001 (0x0001 - 0x0000)
struct Widget_HasAnyUserFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_HasAnyUserFocus) == 0x000001, "Wrong alignment on Widget_HasAnyUserFocus");
static_assert(sizeof(Widget_HasAnyUserFocus) == 0x000001, "Wrong size on Widget_HasAnyUserFocus");
static_assert(offsetof(Widget_HasAnyUserFocus, ReturnValue) == 0x000000, "Member 'Widget_HasAnyUserFocus::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasFocusedDescendants
// 0x0001 (0x0001 - 0x0000)
struct Widget_HasFocusedDescendants final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_HasFocusedDescendants) == 0x000001, "Wrong alignment on Widget_HasFocusedDescendants");
static_assert(sizeof(Widget_HasFocusedDescendants) == 0x000001, "Wrong size on Widget_HasFocusedDescendants");
static_assert(offsetof(Widget_HasFocusedDescendants, ReturnValue) == 0x000000, "Member 'Widget_HasFocusedDescendants::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasKeyboardFocus
// 0x0001 (0x0001 - 0x0000)
struct Widget_HasKeyboardFocus final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_HasKeyboardFocus) == 0x000001, "Wrong alignment on Widget_HasKeyboardFocus");
static_assert(sizeof(Widget_HasKeyboardFocus) == 0x000001, "Wrong size on Widget_HasKeyboardFocus");
static_assert(offsetof(Widget_HasKeyboardFocus, ReturnValue) == 0x000000, "Member 'Widget_HasKeyboardFocus::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasMouseCapture
// 0x0001 (0x0001 - 0x0000)
struct Widget_HasMouseCapture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_HasMouseCapture) == 0x000001, "Wrong alignment on Widget_HasMouseCapture");
static_assert(sizeof(Widget_HasMouseCapture) == 0x000001, "Wrong size on Widget_HasMouseCapture");
static_assert(offsetof(Widget_HasMouseCapture, ReturnValue) == 0x000000, "Member 'Widget_HasMouseCapture::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasMouseCaptureByUser
// 0x000C (0x000C - 0x0000)
struct Widget_HasMouseCaptureByUser final
{
public:
	int32                                         UserIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointerIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Widget_HasMouseCaptureByUser) == 0x000004, "Wrong alignment on Widget_HasMouseCaptureByUser");
static_assert(sizeof(Widget_HasMouseCaptureByUser) == 0x00000C, "Wrong size on Widget_HasMouseCaptureByUser");
static_assert(offsetof(Widget_HasMouseCaptureByUser, UserIndex) == 0x000000, "Member 'Widget_HasMouseCaptureByUser::UserIndex' has a wrong offset!");
static_assert(offsetof(Widget_HasMouseCaptureByUser, PointerIndex) == 0x000004, "Member 'Widget_HasMouseCaptureByUser::PointerIndex' has a wrong offset!");
static_assert(offsetof(Widget_HasMouseCaptureByUser, ReturnValue) == 0x000008, "Member 'Widget_HasMouseCaptureByUser::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasUserFocus
// 0x0010 (0x0010 - 0x0000)
struct Widget_HasUserFocus final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Widget_HasUserFocus) == 0x000008, "Wrong alignment on Widget_HasUserFocus");
static_assert(sizeof(Widget_HasUserFocus) == 0x000010, "Wrong size on Widget_HasUserFocus");
static_assert(offsetof(Widget_HasUserFocus, PlayerController) == 0x000000, "Member 'Widget_HasUserFocus::PlayerController' has a wrong offset!");
static_assert(offsetof(Widget_HasUserFocus, ReturnValue) == 0x000008, "Member 'Widget_HasUserFocus::ReturnValue' has a wrong offset!");

// Function UMG.Widget.HasUserFocusedDescendants
// 0x0010 (0x0010 - 0x0000)
struct Widget_HasUserFocusedDescendants final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(Widget_HasUserFocusedDescendants) == 0x000008, "Wrong alignment on Widget_HasUserFocusedDescendants");
static_assert(sizeof(Widget_HasUserFocusedDescendants) == 0x000010, "Wrong size on Widget_HasUserFocusedDescendants");
static_assert(offsetof(Widget_HasUserFocusedDescendants, PlayerController) == 0x000000, "Member 'Widget_HasUserFocusedDescendants::PlayerController' has a wrong offset!");
static_assert(offsetof(Widget_HasUserFocusedDescendants, ReturnValue) == 0x000008, "Member 'Widget_HasUserFocusedDescendants::ReturnValue' has a wrong offset!");

// Function UMG.Widget.IsHovered
// 0x0001 (0x0001 - 0x0000)
struct Widget_IsHovered final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_IsHovered) == 0x000001, "Wrong alignment on Widget_IsHovered");
static_assert(sizeof(Widget_IsHovered) == 0x000001, "Wrong size on Widget_IsHovered");
static_assert(offsetof(Widget_IsHovered, ReturnValue) == 0x000000, "Member 'Widget_IsHovered::ReturnValue' has a wrong offset!");

// Function UMG.Widget.IsVisible
// 0x0001 (0x0001 - 0x0000)
struct Widget_IsVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Widget_IsVisible) == 0x000001, "Wrong alignment on Widget_IsVisible");
static_assert(sizeof(Widget_IsVisible) == 0x000001, "Wrong size on Widget_IsVisible");
static_assert(offsetof(Widget_IsVisible, ReturnValue) == 0x000000, "Member 'Widget_IsVisible::ReturnValue' has a wrong offset!");

// Function UMG.UserWidget.AddToPlayerScreen
// 0x0008 (0x0008 - 0x0000)
struct UserWidget_AddToPlayerScreen final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UserWidget_AddToPlayerScreen) == 0x000004, "Wrong alignment on UserWidget_AddToPlayerScreen");
static_assert(sizeof(UserWidget_AddToPlayerScreen) == 0x000008, "Wrong size on UserWidget_AddToPlayerScreen");
static_assert(offsetof(UserWidget_AddToPlayerScreen, ZOrder) == 0x000000, "Member 'UserWidget_AddToPlayerScreen::ZOrder' has a wrong offset!");
static_assert(offsetof(UserWidget_AddToPlayerScreen, ReturnValue) == 0x000004, "Member 'UserWidget_AddToPlayerScreen::ReturnValue' has a wrong offset!");

// Function UMG.UserWidget.AddToViewport
// 0x0004 (0x0004 - 0x0000)
struct UserWidget_AddToViewport final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UserWidget_AddToViewport) == 0x000004, "Wrong alignment on UserWidget_AddToViewport");
static_assert(sizeof(UserWidget_AddToViewport) == 0x000004, "Wrong size on UserWidget_AddToViewport");
static_assert(offsetof(UserWidget_AddToViewport, ZOrder) == 0x000000, "Member 'UserWidget_AddToViewport::ZOrder' has a wrong offset!");

// Function UMG.UserWidget.BindToAnimationEvent
// 0x0028 (0x0028 - 0x0000)
struct UserWidget_BindToAnimationEvent final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Delegate;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	EWidgetAnimationEvent                         AnimationEvent;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UserTag;                                           // 0x001C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(UserWidget_BindToAnimationEvent) == 0x000008, "Wrong alignment on UserWidget_BindToAnimationEvent");
static_assert(sizeof(UserWidget_BindToAnimationEvent) == 0x000028, "Wrong size on UserWidget_BindToAnimationEvent");
static_assert(offsetof(UserWidget_BindToAnimationEvent, Animation) == 0x000000, "Member 'UserWidget_BindToAnimationEvent::Animation' has a wrong offset!");
static_assert(offsetof(UserWidget_BindToAnimationEvent, Delegate) == 0x000008, "Member 'UserWidget_BindToAnimationEvent::Delegate' has a wrong offset!");
static_assert(offsetof(UserWidget_BindToAnimationEvent, AnimationEvent) == 0x000018, "Member 'UserWidget_BindToAnimationEvent::AnimationEvent' has a wrong offset!");
static_assert(offsetof(UserWidget_BindToAnimationEvent, UserTag) == 0x00001C, "Member 'UserWidget_BindToAnimationEvent::UserTag' has a wrong offset!");

// Function UMG.UserWidget.BindToAnimationFinished
// 0x0018 (0x0018 - 0x0000)
struct UserWidget_BindToAnimationFinished final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Delegate;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UserWidget_BindToAnimationFinished) == 0x000008, "Wrong alignment on UserWidget_BindToAnimationFinished");
static_assert(sizeof(UserWidget_BindToAnimationFinished) == 0x000018, "Wrong size on UserWidget_BindToAnimationFinished");
static_assert(offsetof(UserWidget_BindToAnimationFinished, Animation) == 0x000000, "Member 'UserWidget_BindToAnimationFinished::Animation' has a wrong offset!");
static_assert(offsetof(UserWidget_BindToAnimationFinished, Delegate) == 0x000008, "Member 'UserWidget_BindToAnimationFinished::Delegate' has a wrong offset!");

// Function UMG.UserWidget.BindToAnimationStarted
// 0x0018 (0x0018 - 0x0000)
struct UserWidget_BindToAnimationStarted final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             Delegate;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(UserWidget_BindToAnimationStarted) == 0x000008, "Wrong alignment on UserWidget_BindToAnimationStarted");
static_assert(sizeof(UserWidget_BindToAnimationStarted) == 0x000018, "Wrong size on UserWidget_BindToAnimationStarted");
static_assert(offsetof(UserWidget_BindToAnimationStarted, Animation) == 0x000000, "Member 'UserWidget_BindToAnimationStarted::Animation' has a wrong offset!");
static_assert(offsetof(UserWidget_BindToAnimationStarted, Delegate) == 0x000008, "Member 'UserWidget_BindToAnimationStarted::Delegate' has a wrong offset!");

// Function UMG.UserWidget.IsAnimationPlayingForward
// 0x0010 (0x0010 - 0x0000)
struct UserWidget_IsAnimationPlayingForward final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
