#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealExtent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UnrealExtent_structs.hpp"
#include "MovieSceneTracks_classes.hpp"
#include "Water_classes.hpp"
#include "Niagara_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "NavigationSystem_classes.hpp"
#include "Slate_structs.hpp"
#include "PCG_classes.hpp"


namespace SDK
{

// Class UnrealExtent.GSE_RenderUtilFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_RenderUtilFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static float GetSceneViewPreExposure(class AActor* WorldContext);
	static void MarkRenderStateDirty(class UActorComponent* ActorComponent);
	static void OverrideSystemUserVariableSKMFilteredBones(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, const TArray<class FName>& OverrideFilteredBones);
	static void OverrideSystemUserVariableSKMFilteredSockets(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, const TArray<class FName>& OverrideFilteredSockets);
	static void PlayCameraShake(class UClass* CameraShakeCls, class APlayerCameraManager* Camera);
	static void SetRenderCustomDepth(class AActor* AA, bool bValue);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSE_RenderUtilFuncLib">();
	}
	static class UGSE_RenderUtilFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_RenderUtilFuncLib>();
	}
};
static_assert(alignof(UGSE_RenderUtilFuncLib) == 0x000008, "Wrong alignment on UGSE_RenderUtilFuncLib");
static_assert(sizeof(UGSE_RenderUtilFuncLib) == 0x000028, "Wrong size on UGSE_RenderUtilFuncLib");

// Class UnrealExtent.LandscapeHeightModifierVolume
// 0x0080 (0x0330 - 0x02B0)
class ALandscapeHeightModifierVolume final : public AVolume
{
public:
	class AGenerateLandscapeVolume*               GenerateVolume;                                    // 0x02B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ALandscape*                             LandscapeActor;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C0[0x70];                                     // 0x02C0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LandscapeHeightModifierVolume">();
	}
	static class ALandscapeHeightModifierVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALandscapeHeightModifierVolume>();
	}
};
static_assert(alignof(ALandscapeHeightModifierVolume) == 0x000008, "Wrong alignment on ALandscapeHeightModifierVolume");
static_assert(sizeof(ALandscapeHeightModifierVolume) == 0x000330, "Wrong size on ALandscapeHeightModifierVolume");
static_assert(offsetof(ALandscapeHeightModifierVolume, GenerateVolume) == 0x0002B0, "Member 'ALandscapeHeightModifierVolume::GenerateVolume' has a wrong offset!");
static_assert(offsetof(ALandscapeHeightModifierVolume, LandscapeActor) == 0x0002B8, "Member 'ALandscapeHeightModifierVolume::LandscapeActor' has a wrong offset!");

// Class UnrealExtent.AudioVisualizeBox
// 0x00A8 (0x0340 - 0x0298)
class UAudioVisualizeBox final : public UUserWidget
{
public:
	class UImage*                                 LayoutWidget;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         FreqNum;                                           // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoudnessNum;                                       // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 FreqSpecInfoArray;                                 // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      LoudnessInfoArray;                                 // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         FreqThickness;                                     // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FreqColor;                                         // 0x02CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqHeightFinalScale;                              // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqHeightScale;                                   // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FreqPaintPower;                                    // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoudnessThickness;                                 // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LoudnessColor;                                     // 0x02EC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              LoudnessHeightRange;                               // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoudnessRandomScaleFactor;                         // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              OffsetInWidget;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PaintFreq;                                         // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PaintLoudness;                                     // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FreqDisturbInterval;                               // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_330[0x10];                                     // 0x0330(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PausePainting();
	void ResetVisualizing();
	void SetAudioInfo(const struct FVector2D& InLoudness, const TArray<float>& InConstantInfo);
	void SetFreqInfo(const TArray<float>& InConstantInfo);
	void SetFreqNum(const int32 InFreqNum);
	void SetLoudnessInfo(const struct FVector2D& InLoudness);
	void StartPainting();
	void StopPainting();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioVisualizeBox">();
	}
	static class UAudioVisualizeBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioVisualizeBox>();
	}
};
static_assert(alignof(UAudioVisualizeBox) == 0x000008, "Wrong alignment on UAudioVisualizeBox");
static_assert(sizeof(UAudioVisualizeBox) == 0x000340, "Wrong size on UAudioVisualizeBox");
static_assert(offsetof(UAudioVisualizeBox, LayoutWidget) == 0x000298, "Member 'UAudioVisualizeBox::LayoutWidget' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqNum) == 0x0002A0, "Member 'UAudioVisualizeBox::FreqNum' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessNum) == 0x0002A4, "Member 'UAudioVisualizeBox::LoudnessNum' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqSpecInfoArray) == 0x0002A8, "Member 'UAudioVisualizeBox::FreqSpecInfoArray' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessInfoArray) == 0x0002B8, "Member 'UAudioVisualizeBox::LoudnessInfoArray' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqThickness) == 0x0002C8, "Member 'UAudioVisualizeBox::FreqThickness' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqColor) == 0x0002CC, "Member 'UAudioVisualizeBox::FreqColor' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqHeightFinalScale) == 0x0002DC, "Member 'UAudioVisualizeBox::FreqHeightFinalScale' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqHeightScale) == 0x0002E0, "Member 'UAudioVisualizeBox::FreqHeightScale' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqPaintPower) == 0x0002E4, "Member 'UAudioVisualizeBox::FreqPaintPower' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessThickness) == 0x0002E8, "Member 'UAudioVisualizeBox::LoudnessThickness' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessColor) == 0x0002EC, "Member 'UAudioVisualizeBox::LoudnessColor' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessHeightRange) == 0x000300, "Member 'UAudioVisualizeBox::LoudnessHeightRange' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, LoudnessRandomScaleFactor) == 0x000310, "Member 'UAudioVisualizeBox::LoudnessRandomScaleFactor' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, OffsetInWidget) == 0x000318, "Member 'UAudioVisualizeBox::OffsetInWidget' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, PaintFreq) == 0x000328, "Member 'UAudioVisualizeBox::PaintFreq' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, PaintLoudness) == 0x000329, "Member 'UAudioVisualizeBox::PaintLoudness' has a wrong offset!");
static_assert(offsetof(UAudioVisualizeBox, FreqDisturbInterval) == 0x00032C, "Member 'UAudioVisualizeBox::FreqDisturbInterval' has a wrong offset!");

// Class UnrealExtent.GSCrowdFollowingComponent
// 0x0000 (0x0318 - 0x0318)
class UGSCrowdFollowingComponent : public UCrowdFollowingComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSCrowdFollowingComponent">();
	}
	static class UGSCrowdFollowingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSCrowdFollowingComponent>();
	}
};
static_assert(alignof(UGSCrowdFollowingComponent) == 0x000008, "Wrong alignment on UGSCrowdFollowingComponent");
static_assert(sizeof(UGSCrowdFollowingComponent) == 0x000318, "Wrong size on UGSCrowdFollowingComponent");

// Class UnrealExtent.AlphaScanButton
// 0x0010 (0x05E0 - 0x05D0)
class UAlphaScanButton final : public UButton
{
public:
	class UTexture2D*                             AdvancedHitTexture;                                // 0x05C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AdvancedHitAlpha;                                  // 0x05D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D4[0xC];                                      // 0x05D4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAdvancedHitAlpha(int32 InAlpha);
	void SetAdvancedHitTexture(class UTexture2D* InTexture);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AlphaScanButton">();
	}
	static class UAlphaScanButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlphaScanButton>();
	}
};
static_assert(alignof(UAlphaScanButton) == 0x000010, "Wrong alignment on UAlphaScanButton");
static_assert(sizeof(UAlphaScanButton) == 0x0005E0, "Wrong size on UAlphaScanButton");
static_assert(offsetof(UAlphaScanButton, AdvancedHitTexture) == 0x0005C8, "Member 'UAlphaScanButton::AdvancedHitTexture' has a wrong offset!");
static_assert(offsetof(UAlphaScanButton, AdvancedHitAlpha) == 0x0005D0, "Member 'UAlphaScanButton::AdvancedHitAlpha' has a wrong offset!");

// Class UnrealExtent.ExedreWidgetRenderTarget
// 0x00F8 (0x0390 - 0x0298)
class UExedreWidgetRenderTarget final : public UUserWidget
{
public:
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     RenderingMaterial;                                 // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FSlateBrush                            ImageBrush;                                        // 0x02B0(0x00D0)(NativeAccessSpecifierPrivate)
	class UTexture2D*                             DefaultTexture;                                    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ExedreWidgetRenderTarget">();
	}
	static class UExedreWidgetRenderTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExedreWidgetRenderTarget>();
	}
};
static_assert(alignof(UExedreWidgetRenderTarget) == 0x000010, "Wrong alignment on UExedreWidgetRenderTarget");
static_assert(sizeof(UExedreWidgetRenderTarget) == 0x000390, "Wrong size on UExedreWidgetRenderTarget");
static_assert(offsetof(UExedreWidgetRenderTarget, RenderingMaterial) == 0x0002A8, "Member 'UExedreWidgetRenderTarget::RenderingMaterial' has a wrong offset!");
static_assert(offsetof(UExedreWidgetRenderTarget, ImageBrush) == 0x0002B0, "Member 'UExedreWidgetRenderTarget::ImageBrush' has a wrong offset!");
static_assert(offsetof(UExedreWidgetRenderTarget, DefaultTexture) == 0x000380, "Member 'UExedreWidgetRenderTarget::DefaultTexture' has a wrong offset!");

// Class UnrealExtent.AudioVisualizeUtil
// 0x0030 (0x02A8 - 0x0278)
class AAudioVisualizeUtil final : public AActor
{
public:
	class UAudioComponent*                        Audio;                                             // 0x0278(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULoudnessNRT*                           LoudnessAnalyzer;                                  // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UConstantQNRT*                          ConstantAnalyzer;                                  // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAudioPlaybackPercentCallback(const class USoundWave* SoundWave, const float Percent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AudioVisualizeUtil">();
	}
	static class AAudioVisualizeUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAudioVisualizeUtil>();
	}
};
static_assert(alignof(AAudioVisualizeUtil) == 0x000008, "Wrong alignment on AAudioVisualizeUtil");
static_assert(sizeof(AAudioVisualizeUtil) == 0x0002A8, "Wrong size on AAudioVisualizeUtil");
static_assert(offsetof(AAudioVisualizeUtil, Audio) == 0x000278, "Member 'AAudioVisualizeUtil::Audio' has a wrong offset!");
static_assert(offsetof(AAudioVisualizeUtil, LoudnessAnalyzer) == 0x000280, "Member 'AAudioVisualizeUtil::LoudnessAnalyzer' has a wrong offset!");
static_assert(offsetof(AAudioVisualizeUtil, ConstantAnalyzer) == 0x000288, "Member 'AAudioVisualizeUtil::ConstantAnalyzer' has a wrong offset!");

// Class UnrealExtent.GSE_GridlyFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_GridlyFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class FString> GetSupportCultures();
	static void RequestPage(class UObject* Obj);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSE_GridlyFuncLib">();
	}
	static class UGSE_GridlyFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_GridlyFuncLib>();
	}
};
static_assert(alignof(UGSE_GridlyFuncLib) == 0x000008, "Wrong alignment on UGSE_GridlyFuncLib");
static_assert(sizeof(UGSE_GridlyFuncLib) == 0x000028, "Wrong size on UGSE_GridlyFuncLib");

// Class UnrealExtent.SFadeObjectsComponent
// 0x00C8 (0x0178 - 0x00B0)
class USFadeObjectsComponent final : public UActorComponent
{
public:
	TArray<struct FFadeObjStruct>                 FadeObjects;                                       // 0x00B0(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TimerHandle_ObjectComputeTimer;                    // 0x00C0(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FTimerHandle                           TimerHandle_AddObjectsTimer;                       // 0x00C8(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentFade;                                       // 0x00D0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         FadeNowID;                                         // 0x00D4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UPrimitiveComponent*>            FadeObjectsTemp;                                   // 0x00D8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UPrimitiveComponent*>            FadeObjectsHit;                                    // 0x00E8(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UMaterial*                              FadeMaterial;                                      // 0x00F8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bEnable;                                           // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AddObjectInterval;                                 // 0x0104(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CalcFadeInterval;                                  // 0x0108(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         WorkDistance;                                      // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         NearCameraRadius;                                  // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PlayerClass;                                       // 0x0118(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<ECollisionChannel>                     ObjectTypes;                                       // 0x0120(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	ECollisionChannel                             ChannelType;                                       // 0x0130(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ActorsIgnore;                                      // 0x0138(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	float                                         FadeRate;                                          // 0x0148(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CapsuleHalfHeight;                                 // 0x014C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CapsuleRadius;                                     // 0x0150(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CharacterArray;                                    // 0x0158(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	float                                         NearObjectFade;                                    // 0x0168(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         FarObjectFade;                                     // 0x016C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ImmediatelyFade;                                   // 0x0170(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SFadeObjectsComponent">();
	}
	static class USFadeObjectsComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USFadeObjectsComponent>();
	}
};
static_assert(alignof(USFadeObjectsComponent) == 0x000008, "Wrong alignment on USFadeObjectsComponent");
static_assert(sizeof(USFadeObjectsComponent) == 0x000178, "Wrong size on USFadeObjectsComponent");
static_assert(offsetof(USFadeObjectsComponent, FadeObjects) == 0x0000B0, "Member 'USFadeObjectsComponent::FadeObjects' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, TimerHandle_ObjectComputeTimer) == 0x0000C0, "Member 'USFadeObjectsComponent::TimerHandle_ObjectComputeTimer' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, TimerHandle_AddObjectsTimer) == 0x0000C8, "Member 'USFadeObjectsComponent::TimerHandle_AddObjectsTimer' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, CurrentFade) == 0x0000D0, "Member 'USFadeObjectsComponent::CurrentFade' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FadeNowID) == 0x0000D4, "Member 'USFadeObjectsComponent::FadeNowID' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FadeObjectsTemp) == 0x0000D8, "Member 'USFadeObjectsComponent::FadeObjectsTemp' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FadeObjectsHit) == 0x0000E8, "Member 'USFadeObjectsComponent::FadeObjectsHit' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FadeMaterial) == 0x0000F8, "Member 'USFadeObjectsComponent::FadeMaterial' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, bEnable) == 0x000100, "Member 'USFadeObjectsComponent::bEnable' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, AddObjectInterval) == 0x000104, "Member 'USFadeObjectsComponent::AddObjectInterval' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, CalcFadeInterval) == 0x000108, "Member 'USFadeObjectsComponent::CalcFadeInterval' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, WorkDistance) == 0x00010C, "Member 'USFadeObjectsComponent::WorkDistance' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, NearCameraRadius) == 0x000110, "Member 'USFadeObjectsComponent::NearCameraRadius' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, PlayerClass) == 0x000118, "Member 'USFadeObjectsComponent::PlayerClass' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, ObjectTypes) == 0x000120, "Member 'USFadeObjectsComponent::ObjectTypes' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, ChannelType) == 0x000130, "Member 'USFadeObjectsComponent::ChannelType' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, ActorsIgnore) == 0x000138, "Member 'USFadeObjectsComponent::ActorsIgnore' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FadeRate) == 0x000148, "Member 'USFadeObjectsComponent::FadeRate' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, CapsuleHalfHeight) == 0x00014C, "Member 'USFadeObjectsComponent::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, CapsuleRadius) == 0x000150, "Member 'USFadeObjectsComponent::CapsuleRadius' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, CharacterArray) == 0x000158, "Member 'USFadeObjectsComponent::CharacterArray' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, NearObjectFade) == 0x000168, "Member 'USFadeObjectsComponent::NearObjectFade' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, FarObjectFade) == 0x00016C, "Member 'USFadeObjectsComponent::FarObjectFade' has a wrong offset!");
static_assert(offsetof(USFadeObjectsComponent, ImmediatelyFade) == 0x000170, "Member 'USFadeObjectsComponent::ImmediatelyFade' has a wrong offset!");

// Class UnrealExtent.AutoMovementPattern
// 0x00C8 (0x00F8 - 0x0030)
class UAutoMovementPattern final : public UPrimaryDataAsset
{
public:
	float                                         TickInterval;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAutoMovementViewingPattern            ViewingPattern;                                    // 0x0038(0x0058)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAutoMovementHeatmapConfig             HeatmapConfig;                                     // 0x0090(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoMovementPattern">();
	}
	static class UAutoMovementPattern* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoMovementPattern>();
	}
};
static_assert(alignof(UAutoMovementPattern) == 0x000008, "Wrong alignment on UAutoMovementPattern");
static_assert(sizeof(UAutoMovementPattern) == 0x0000F8, "Wrong size on UAutoMovementPattern");
static_assert(offsetof(UAutoMovementPattern, TickInterval) == 0x000030, "Member 'UAutoMovementPattern::TickInterval' has a wrong offset!");
static_assert(offsetof(UAutoMovementPattern, ViewingPattern) == 0x000038, "Member 'UAutoMovementPattern::ViewingPattern' has a wrong offset!");
static_assert(offsetof(UAutoMovementPattern, HeatmapConfig) == 0x000090, "Member 'UAutoMovementPattern::HeatmapConfig' has a wrong offset!");

// Class UnrealExtent.BGUMovieSceneComponentMaterialTrack
// 0x0010 (0x00B0 - 0x00A0)
class UBGUMovieSceneComponentMaterialTrack final : public UMovieSceneMaterialTrack
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaterialIndex;                                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUMovieSceneComponentMaterialTrack">();
	}
	static class UBGUMovieSceneComponentMaterialTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUMovieSceneComponentMaterialTrack>();
	}
};
static_assert(alignof(UBGUMovieSceneComponentMaterialTrack) == 0x000008, "Wrong alignment on UBGUMovieSceneComponentMaterialTrack");
static_assert(sizeof(UBGUMovieSceneComponentMaterialTrack) == 0x0000B0, "Wrong size on UBGUMovieSceneComponentMaterialTrack");
static_assert(offsetof(UBGUMovieSceneComponentMaterialTrack, MaterialIndex) == 0x0000A8, "Member 'UBGUMovieSceneComponentMaterialTrack::MaterialIndex' has a wrong offset!");

// Class UnrealExtent.AutoMovementMonitor
// 0x00A8 (0x0320 - 0x0278)
class AAutoMovementMonitor : public AActor
{
public:
	class UAutoMovementPattern*                   AutoMovePattern;                                   // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReportFilePath;                                    // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        PathPoints;                                        // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        CachedPathPoints;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	bool                                          bLogProcessingState;                               // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsReadyToProcess;                                 // 0x02B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPitchingPositively;                               // 0x02B2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B3[0x1];                                      // 0x02B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TargetPositionIndex;                               // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetYawIndex;                                    // 0x02B8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TargetPitchIndex;                                  // 0x02BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetPosition;                                    // 0x02C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetRotation;                                    // 0x02D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ViewingPhaseIndex;                                 // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AutoMoveStartTimeSinceAppStarted;                  // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LastPointEndTimestamp;                             // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30C[0x14];                                     // 0x030C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CaptureViewingInfo();
	void CheckHitRotation(const struct FRotator& InRotator);
	void CreatePointInstances(const TArray<struct FVector>& InPoints);
	void DrawStatOnHeatmap(const class FString& InStatName, const int32 InTileCount);
	void EnableAutoMovement();
	void ExitAppOnAutoMoveFinished();
	class FString GetPointExecutionDurationInfo(int64 InStartTimestamp);
	struct FRotator GetRotationIncrement(const struct FVector& InRotatorMask, const struct FAutoMovementViewingPattern& ViewingPattern);
	void IncreaseViewingRotation(ERotateType RotateType, bool bProxyCall);
	void LoadPathPoints();
	void PauseAutoMovement();
	void PostAutoMovement();
	void PreAutoMovement();
	void ProcessAutoMovement(const struct FVector& InLocation, const struct FRotator& InRotator);
	void RegisterAutoMovementConsoleCommands();
	void ResetAutoMovement();
	void ResetPitchRotation();
	void ResetTransportAttemptedCount();
	void ResetYawRotation();
	void ResumeAutoMovement();
	void SetSparseVersionEnabled(bool bEnabled);
	void StopAutoMovement();
	void SwitchRotateDirection();
	void SwitchToVirtualPawn(class UClass* VirtualPlayerBaseClass, const struct FVector& SpawningOffset);
	void TransportViewingPosition(const struct FVector& InLocation, const struct FRotator& InRotator, bool bProxyCall);

	bool CheckAutoMovementCompleted() const;
	bool CheckHitLocation(const struct FVector& InLocation) const;
	bool HasCompletedPitchingObservation() const;
	bool HasCompletedYawingObservation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoMovementMonitor">();
	}
	static class AAutoMovementMonitor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoMovementMonitor>();
	}
};
static_assert(alignof(AAutoMovementMonitor) == 0x000008, "Wrong alignment on AAutoMovementMonitor");
static_assert(sizeof(AAutoMovementMonitor) == 0x000320, "Wrong size on AAutoMovementMonitor");
static_assert(offsetof(AAutoMovementMonitor, AutoMovePattern) == 0x000278, "Member 'AAutoMovementMonitor::AutoMovePattern' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, ReportFilePath) == 0x000280, "Member 'AAutoMovementMonitor::ReportFilePath' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, PathPoints) == 0x000290, "Member 'AAutoMovementMonitor::PathPoints' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, CachedPathPoints) == 0x0002A0, "Member 'AAutoMovementMonitor::CachedPathPoints' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, bLogProcessingState) == 0x0002B0, "Member 'AAutoMovementMonitor::bLogProcessingState' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, bIsReadyToProcess) == 0x0002B1, "Member 'AAutoMovementMonitor::bIsReadyToProcess' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, bPitchingPositively) == 0x0002B2, "Member 'AAutoMovementMonitor::bPitchingPositively' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, TargetPositionIndex) == 0x0002B4, "Member 'AAutoMovementMonitor::TargetPositionIndex' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, TargetYawIndex) == 0x0002B8, "Member 'AAutoMovementMonitor::TargetYawIndex' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, TargetPitchIndex) == 0x0002BC, "Member 'AAutoMovementMonitor::TargetPitchIndex' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, TargetPosition) == 0x0002C0, "Member 'AAutoMovementMonitor::TargetPosition' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, TargetRotation) == 0x0002D8, "Member 'AAutoMovementMonitor::TargetRotation' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, ViewingPhaseIndex) == 0x0002F0, "Member 'AAutoMovementMonitor::ViewingPhaseIndex' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, AutoMoveStartTimeSinceAppStarted) == 0x0002F8, "Member 'AAutoMovementMonitor::AutoMoveStartTimeSinceAppStarted' has a wrong offset!");
static_assert(offsetof(AAutoMovementMonitor, LastPointEndTimestamp) == 0x000308, "Member 'AAutoMovementMonitor::LastPointEndTimestamp' has a wrong offset!");

// Class UnrealExtent.AutoMovementUtil
// 0x0000 (0x0028 - 0x0028)
class UAutoMovementUtil final : public UBlueprintFunctionLibrary
{
public:
	static void AppendGeneralStatisticsToCapturedReport(const class FString& InFilename, int32 MetricsNum, int32 PointNum);
	static void AppendHeaderToCapturedReport(const TArray<class FString>& CapturedInfoNameList, const class FString& InFilename);
	static void AppendOfflinePathPoints(const TArray<struct FVector>& InPoints, const class FString& InFilePathUnderProjFolder);
	static bool ExportCapturedInfoBatch(const int32 BatchSize, const int32 TotalPointNum, const TArray<struct FGSPathPointStatInfo>& InPathPointStatsInfo, const class FString& InFilename, bool bLastBatch, bool bOutputHeader);
	static void ExportStatsCapturedReport(const TArray<struct FGSPathPointStatInfo>& InPathPointStatsInfo, const class FString& InFilename, bool bAppend, bool bOutputHeader);
	static class FString ExtractDateTimeInfo(const class FString& InString);
	static class FString FormatTimeAuto(const double InDuration, const int32 NumDigits);
	static class FString FormatTimeSeconds(const float InDuration);
	static struct FDateTime FromTimestamp(int64 Time);
	static TMap<class FString, float> GetCurPointProcessedMetricsMap(const struct FCapturedInfoArrayPerPoint& InCapturedInfoPerPoint);
	static int64 GetNowTimestamp();
	static TArray<struct FVector> GetOfflinePathPoints(const class FString& InFilePathUnderProjDir, bool bUseSparsePoints);
	static class FString GetVfxAutoPlayerRootFolderPath();
	static struct FCapturedInfoArrayPerPoint InsertIntoCapturedInfoArrayPerPoint(const TArray<struct FGSCapturedStatResult>& RawCapturedData, const struct FCapturedInfoArrayPerPoint& CapturedInfoArrayPerPoint);
	static bool LoadStatsCapturerReport(const class FString& InFileNameUnderProjFolder, TArray<struct FGSPathPointStatInfo>* AllPathPointStatInfo, int32 PointNum);
	static bool MergeMipReportsWithFileNameKeyword(const class FString& InDirectoryUnderProjDir, const class FString& InFileNameKeyword, const class FString& OutputMergedFileName);
	static bool MergeMultiTextureMipReports(const TArray<class FString>& InReportFilePaths, const class FString& OutputMergedFileName);
	static void SaveOfflinePathPoints(const TArray<struct FVector>& InPoints, const class FString& InFilePathUnderProjFolder);
	static void SetVfxAutoPlayerRootFolderPath(const class FString& InRootFolderPath);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoMovementUtil">();
	}
	static class UAutoMovementUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoMovementUtil>();
	}
};
static_assert(alignof(UAutoMovementUtil) == 0x000008, "Wrong alignment on UAutoMovementUtil");
static_assert(sizeof(UAutoMovementUtil) == 0x000028, "Wrong size on UAutoMovementUtil");

// Class UnrealExtent.GSE_SequenceMasterCppBase
// 0x0000 (0x0278 - 0x0278)
class AGSE_SequenceMasterCppBase final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSE_SequenceMasterCppBase">();
	}
	static class AGSE_SequenceMasterCppBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGSE_SequenceMasterCppBase>();
	}
};
static_assert(alignof(AGSE_SequenceMasterCppBase) == 0x000008, "Wrong alignment on AGSE_SequenceMasterCppBase");
static_assert(sizeof(AGSE_SequenceMasterCppBase) == 0x000278, "Wrong size on AGSE_SequenceMasterCppBase");

// Class UnrealExtent.AutoMoveTaskAssembler
// 0x0028 (0x0348 - 0x0320)
class AAutoMoveTaskAssembler final : public AAutoMovementMonitor
{
public:
	TArray<class AAutoMovementMonitor*>           Tasks;                                             // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         TaskID;                                            // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 PointsTaskIdList;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	void IncreaseSubTaskViewingRotation(ERotateType InRotateType);
	void InitAutoMoveAssembler();
	void TransportSubTaskViewingPosition(const struct FVector& InLocation, const struct FRotator& InRotator);
	void UpdateProcessingState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoMoveTaskAssembler">();
	}
	static class AAutoMoveTaskAssembler* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAutoMoveTaskAssembler>();
	}
};
static_assert(alignof(AAutoMoveTaskAssembler) == 0x000008, "Wrong alignment on AAutoMoveTaskAssembler");
static_assert(sizeof(AAutoMoveTaskAssembler) == 0x000348, "Wrong size on AAutoMoveTaskAssembler");
static_assert(offsetof(AAutoMoveTaskAssembler, Tasks) == 0x000320, "Member 'AAutoMoveTaskAssembler::Tasks' has a wrong offset!");
static_assert(offsetof(AAutoMoveTaskAssembler, TaskID) == 0x000330, "Member 'AAutoMoveTaskAssembler::TaskID' has a wrong offset!");
static_assert(offsetof(AAutoMoveTaskAssembler, PointsTaskIdList) == 0x000338, "Member 'AAutoMoveTaskAssembler::PointsTaskIdList' has a wrong offset!");

// Class UnrealExtent.GSE_NetFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_NetFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static void GetAllActiveConnectionInfo(class UObject* WorldContext, TArray<struct FGSConnectionInfo>* ConnectionInfos);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSE_NetFuncLib">();
	}
	static class UGSE_NetFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_NetFuncLib>();
	}
};
static_assert(alignof(UGSE_NetFuncLib) == 0x000008, "Wrong alignment on UGSE_NetFuncLib");
static_assert(sizeof(UGSE_NetFuncLib) == 0x000028, "Wrong size on UGSE_NetFuncLib");

// Class UnrealExtent.TilingImage
// 0x0020 (0x02B0 - 0x0290)
class UTilingImage final : public UImage
{
public:
	uint8                                         Pad_290[0x20];                                     // 0x0290(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TilingImage">();
	}
	static class UTilingImage* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTilingImage>();
	}
};
static_assert(alignof(UTilingImage) == 0x000010, "Wrong alignment on UTilingImage");
static_assert(sizeof(UTilingImage) == 0x0002B0, "Wrong size on UTilingImage");

// Class UnrealExtent.AutoOnlineSubsystemTest
// 0x0000 (0x0028 - 0x0028)
class UAutoOnlineSubsystemTest final : public UObject
{
public:
	static void TestGSSdkAuthToken();
	static void TestLogin();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutoOnlineSubsystemTest">();
	}
	static class UAutoOnlineSubsystemTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutoOnlineSubsystemTest>();
	}
};
static_assert(alignof(UAutoOnlineSubsystemTest) == 0x000008, "Wrong alignment on UAutoOnlineSubsystemTest");
static_assert(sizeof(UAutoOnlineSubsystemTest) == 0x000028, "Wrong size on UAutoOnlineSubsystemTest");

// Class UnrealExtent.AssetDataArray
// 0x0018 (0x0040 - 0x0028)
class UAssetDataArray final : public UObject
{
public:
	TArray<struct FAssetData>                     AssetDataArr;                                      // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         ActiveIdx;                                         // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetAssetDataCount();
	void SetActiveIdx(int32 Idx);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AssetDataArray">();
	}
	static class UAssetDataArray* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAssetDataArray>();
	}
};
static_assert(alignof(UAssetDataArray) == 0x000008, "Wrong alignment on UAssetDataArray");
static_assert(sizeof(UAssetDataArray) == 0x000040, "Wrong size on UAssetDataArray");
static_assert(offsetof(UAssetDataArray, AssetDataArr) == 0x000028, "Member 'UAssetDataArray::AssetDataArr' has a wrong offset!");
static_assert(offsetof(UAssetDataArray, ActiveIdx) == 0x000038, "Member 'UAssetDataArray::ActiveIdx' has a wrong offset!");

// Class UnrealExtent.BattleCloud
// 0x0008 (0x0280 - 0x0278)
class ABattleCloud final : public AActor
{
public:
	bool                                          EnableSim;                                         // 0x0278(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MipmapDistanceScale;                               // 0x027C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BattleCloud">();
	}
	static class ABattleCloud* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleCloud>();
	}
};
static_assert(alignof(ABattleCloud) == 0x000008, "Wrong alignment on ABattleCloud");
static_assert(sizeof(ABattleCloud) == 0x000280, "Wrong size on ABattleCloud");
static_assert(offsetof(ABattleCloud, EnableSim) == 0x000278, "Member 'ABattleCloud::EnableSim' has a wrong offset!");
static_assert(offsetof(ABattleCloud, MipmapDistanceScale) == 0x00027C, "Member 'ABattleCloud::MipmapDistanceScale' has a wrong offset!");

// Class UnrealExtent.GSE_GameIntentFuncLib
// 0x0000 (0x0028 - 0x0028)
class UGSE_GameIntentFuncLib final : public UBlueprintFunctionLibrary
{
public:
	static bool GetCachedActivityIntentReceivedParam(struct FCachedActivityIntentReceivedParamCS* OutParamCS);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSE_GameIntentFuncLib">();
	}
	static class UGSE_GameIntentFuncLib* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSE_GameIntentFuncLib>();
	}
};
static_assert(alignof(UGSE_GameIntentFuncLib) == 0x000008, "Wrong alignment on UGSE_GameIntentFuncLib");
static_assert(sizeof(UGSE_GameIntentFuncLib) == 0x000028, "Wrong size on UGSE_GameIntentFuncLib");

// Class UnrealExtent.GSRTAvatarConfigPreset
// 0x00F0 (0x0120 - 0x0030)
class UGSRTAvatarConfigPreset final : public UPrimaryDataAsset
{
public:
	class FString                                 HeroActorBPPath;                                   // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             HeroTransform;                                     // 0x0040(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             RTCamTransform;                                    // 0x00A0(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         RTCamFOV;                                          // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRTAvatarRectLightConfig>       LightConfigs;                                      // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GSRTAvatarConfigPreset">();
	}
	static class UGSRTAvatarConfigPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGSRTAvatarConfigPreset>();
	}
};
static_assert(alignof(UGSRTAvatarConfigPreset) == 0x000010, "Wrong alignment on UGSRTAvatarConfigPreset");
static_assert(sizeof(UGSRTAvatarConfigPreset) == 0x000120, "Wrong size on UGSRTAvatarConfigPreset");
static_assert(offsetof(UGSRTAvatarConfigPreset, HeroActorBPPath) == 0x000030, "Member 'UGSRTAvatarConfigPreset::HeroActorBPPath' has a wrong offset!");
static_assert(offsetof(UGSRTAvatarConfigPreset, HeroTransform) == 0x000040, "Member 'UGSRTAvatarConfigPreset::HeroTransform' has a wrong offset!");
static_assert(offsetof(UGSRTAvatarConfigPreset, RTCamTransform) == 0x0000A0, "Member 'UGSRTAvatarConfigPreset::RTCamTransform' has a wrong offset!");
static_assert(offsetof(UGSRTAvatarConfigPreset, RTCamFOV) == 0x000100, "Member 'UGSRTAvatarConfigPreset::RTCamFOV' has a wrong offset!");
static_assert(offsetof(UGSRTAvatarConfigPreset, LightConfigs) == 0x000108, "Member 'UGSRTAvatarConfigPreset::LightConfigs' has a wrong offset!");

// Class UnrealExtent.BGUAsyncLineTraceObject
// 0x0030 (0x0058 - 0x0028)
class UBGUAsyncLineTraceObject final : public UObject
{
public:
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x20];                                      // 0x0038(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void RequestAsyncLineTraceByChannelSingleStatic(class UBGUAsyncLineTraceObject* InLineTraceObject, int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	static void RequestAsyncLineTraceByObjectTypeSingleStatic(class UBGUAsyncLineTraceObject* InLineTraceObject, int32 ReqID, const struct FVector& Start, const struct FVector& End, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);

	int32 GetAndCleanLineTraceResults(TArray<struct FAsyncLineTraceSingleResult>* OutAsyncLineTraceResults);
	void RequestAsyncLineTraceByChannelOnlyCheck(int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByChannelSingle(int32 ReqID, const struct FVector& Start, const struct FVector& End, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByChannelSingle_Batch(const TArray<struct FAsyncLineTraceReq>& ReqList, ECollisionChannel TraceChannel, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByObjectTypeSingle(int32 ReqID, const struct FVector& Start, const struct FVector& End, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);
	void RequestAsyncLineTraceByObjectTypeSingle_Batch(const TArray<struct FAsyncLineTraceReq>& ReqList, const TArray<EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, bool bDebug);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUAsyncLineTraceObject">();
	}
	static class UBGUAsyncLineTraceObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUAsyncLineTraceObject>();
	}
};
static_assert(alignof(UBGUAsyncLineTraceObject) == 0x000008, "Wrong alignment on UBGUAsyncLineTraceObject");
static_assert(sizeof(UBGUAsyncLineTraceObject) == 0x000058, "Wrong size on UBGUAsyncLineTraceObject");
static_assert(offsetof(UBGUAsyncLineTraceObject, IgnoreActors) == 0x000028, "Member 'UBGUAsyncLineTraceObject::IgnoreActors' has a wrong offset!");

// Class UnrealExtent.BGUMovieSceneParameterSection
// 0x0038 (0x0120 - 0x00E8)
class UBGUMovieSceneParameterSection final : public UMovieSceneSection
{
public:
	bool                                          bAffectClothMaterial;                              // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectAllMaterial;                                // 0x00E9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBGUScalarParameterInfoAndCurve> ScalarParameterInfosAndCurves;                     // 0x00F0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBGUVectorParameterInfoAndCurves> VectorParameterInfosAndCurves;                     // 0x0100(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FBGUColorParameterInfoAndCurves> ColorParameterInfosAndCurves;                      // 0x0110(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	void AddColorParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, const struct FLinearColor& InValue);
	void AddScalarParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, float InValue);
	void AddVectorParameterKey(const struct FBGUMaterialParameterInfo& InParameterInfo, const struct FFrameNumber& InTime, const struct FVector& InValue);
	bool RemoveColorParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveColorParameterByName(const class FName& InParameterInfoName);
	bool RemoveScalarParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveScalarParameterByName(const class FName& InParameterInfoName);
	bool RemoveVectorParameter(const struct FBGUMaterialParameterInfo& InParameterInfo);
	bool RemoveVectorParameterByName(const class FName& InParameterInfoName);

	void GetParameterInfos(TSet<struct FBGUMaterialParameterInfo>* ParameterInfos) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BGUMovieSceneParameterSection">();
	}
	static class UBGUMovieSceneParameterSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBGUMovieSceneParameterSection>();
	}
};
static_assert(alignof(UBGUMovieSceneParameterSection) == 0x000008, "Wrong alignment on UBGUMovieSceneParameterSection");
static_assert(sizeof(UBGUMovieSceneParameterSection) == 0x000120, "Wrong size on UBGUMovieSceneParameterSection");
static_assert(offsetof(UBGUMovieSceneParameterSection, bAffectClothMaterial) == 0x0000E8, "Member 'UBGUMovieSceneParameterSection::bAffectClothMaterial' has a wrong offset!");
static_assert(offsetof(UBGUMovieSceneParameterSection, bAffectAllMaterial) == 0x0000E9, "Member 'UBGUMovieSceneParameterSection::bAffectAllMaterial' has a wrong offset!");
static_assert(offsetof(UBGUMovieSceneParameterSection, ScalarParameterInfosAndCurves) == 0x0000F0, "Member 'UBGUMovieSceneParameterSection::ScalarParameterInfosAndCurves' has a wrong offset!");
static_assert(offsetof(UBGUMovieSceneParameterSection, VectorParameterInfosAndCurves) == 0x000100, "Member 'UBGUMovieSceneParameterSection::VectorParameterInfosAndCurves' has a wrong offset!");
static_assert(offsetof(UBGUMovieSceneParameterSection, ColorParameterInfosAndCurves) == 0x000110, "Member 'UBGUMovieSceneParameterSection::ColorParameterInfosAndCurves' has a wrong offset!");

// Class UnrealExtent.BGWBlockingVolume
// 0x0010 (0x02C0 - 0x02B0)
class ABGWBlockingVolume final : public AVolume
{
public:
