#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnrealExtent

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UnrealExtent_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Niagara_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function UnrealExtent.GSE_RenderUtilFuncLib.GetSceneViewPreExposure
// 0x0010 (0x0010 - 0x0000)
struct GSE_RenderUtilFuncLib_GetSceneViewPreExposure final
{
public:
	class AActor*                                 WorldContext;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSE_RenderUtilFuncLib_GetSceneViewPreExposure) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_GetSceneViewPreExposure");
static_assert(sizeof(GSE_RenderUtilFuncLib_GetSceneViewPreExposure) == 0x000010, "Wrong size on GSE_RenderUtilFuncLib_GetSceneViewPreExposure");
static_assert(offsetof(GSE_RenderUtilFuncLib_GetSceneViewPreExposure, WorldContext) == 0x000000, "Member 'GSE_RenderUtilFuncLib_GetSceneViewPreExposure::WorldContext' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_GetSceneViewPreExposure, ReturnValue) == 0x000008, "Member 'GSE_RenderUtilFuncLib_GetSceneViewPreExposure::ReturnValue' has a wrong offset!");

// Function UnrealExtent.GSE_RenderUtilFuncLib.MarkRenderStateDirty
// 0x0008 (0x0008 - 0x0000)
struct GSE_RenderUtilFuncLib_MarkRenderStateDirty final
{
public:
	class UActorComponent*                        ActorComponent;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_RenderUtilFuncLib_MarkRenderStateDirty) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_MarkRenderStateDirty");
static_assert(sizeof(GSE_RenderUtilFuncLib_MarkRenderStateDirty) == 0x000008, "Wrong size on GSE_RenderUtilFuncLib_MarkRenderStateDirty");
static_assert(offsetof(GSE_RenderUtilFuncLib_MarkRenderStateDirty, ActorComponent) == 0x000000, "Member 'GSE_RenderUtilFuncLib_MarkRenderStateDirty::ActorComponent' has a wrong offset!");

// Function UnrealExtent.GSE_RenderUtilFuncLib.OverrideSystemUserVariableSKMFilteredBones
// 0x0028 (0x0028 - 0x0000)
struct GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OverrideFilteredBones;                             // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones");
static_assert(sizeof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones) == 0x000028, "Wrong size on GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones, NiagaraSystem) == 0x000000, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones, OverrideName) == 0x000008, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones::OverrideName' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones, OverrideFilteredBones) == 0x000018, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredBones::OverrideFilteredBones' has a wrong offset!");

// Function UnrealExtent.GSE_RenderUtilFuncLib.OverrideSystemUserVariableSKMFilteredSockets
// 0x0028 (0x0028 - 0x0000)
struct GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OverrideFilteredSockets;                           // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets");
static_assert(sizeof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets) == 0x000028, "Wrong size on GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets, NiagaraSystem) == 0x000000, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets, OverrideName) == 0x000008, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets::OverrideName' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets, OverrideFilteredSockets) == 0x000018, "Member 'GSE_RenderUtilFuncLib_OverrideSystemUserVariableSKMFilteredSockets::OverrideFilteredSockets' has a wrong offset!");

// Function UnrealExtent.GSE_RenderUtilFuncLib.PlayCameraShake
// 0x0010 (0x0010 - 0x0000)
struct GSE_RenderUtilFuncLib_PlayCameraShake final
{
public:
	class UClass*                                 CameraShakeCls;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerCameraManager*                   Camera;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_RenderUtilFuncLib_PlayCameraShake) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_PlayCameraShake");
static_assert(sizeof(GSE_RenderUtilFuncLib_PlayCameraShake) == 0x000010, "Wrong size on GSE_RenderUtilFuncLib_PlayCameraShake");
static_assert(offsetof(GSE_RenderUtilFuncLib_PlayCameraShake, CameraShakeCls) == 0x000000, "Member 'GSE_RenderUtilFuncLib_PlayCameraShake::CameraShakeCls' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_PlayCameraShake, Camera) == 0x000008, "Member 'GSE_RenderUtilFuncLib_PlayCameraShake::Camera' has a wrong offset!");

// Function UnrealExtent.GSE_RenderUtilFuncLib.SetRenderCustomDepth
// 0x0010 (0x0010 - 0x0000)
struct GSE_RenderUtilFuncLib_SetRenderCustomDepth final
{
public:
	class AActor*                                 AA;                                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GSE_RenderUtilFuncLib_SetRenderCustomDepth) == 0x000008, "Wrong alignment on GSE_RenderUtilFuncLib_SetRenderCustomDepth");
static_assert(sizeof(GSE_RenderUtilFuncLib_SetRenderCustomDepth) == 0x000010, "Wrong size on GSE_RenderUtilFuncLib_SetRenderCustomDepth");
static_assert(offsetof(GSE_RenderUtilFuncLib_SetRenderCustomDepth, AA) == 0x000000, "Member 'GSE_RenderUtilFuncLib_SetRenderCustomDepth::AA' has a wrong offset!");
static_assert(offsetof(GSE_RenderUtilFuncLib_SetRenderCustomDepth, bValue) == 0x000008, "Member 'GSE_RenderUtilFuncLib_SetRenderCustomDepth::bValue' has a wrong offset!");

// Function UnrealExtent.AudioVisualizeBox.SetAudioInfo
// 0x0020 (0x0020 - 0x0000)
struct AudioVisualizeBox_SetAudioInfo final
{
public:
	struct FVector2D                              InLoudness;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 InConstantInfo;                                    // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioVisualizeBox_SetAudioInfo) == 0x000008, "Wrong alignment on AudioVisualizeBox_SetAudioInfo");
static_assert(sizeof(AudioVisualizeBox_SetAudioInfo) == 0x000020, "Wrong size on AudioVisualizeBox_SetAudioInfo");
static_assert(offsetof(AudioVisualizeBox_SetAudioInfo, InLoudness) == 0x000000, "Member 'AudioVisualizeBox_SetAudioInfo::InLoudness' has a wrong offset!");
static_assert(offsetof(AudioVisualizeBox_SetAudioInfo, InConstantInfo) == 0x000010, "Member 'AudioVisualizeBox_SetAudioInfo::InConstantInfo' has a wrong offset!");

// Function UnrealExtent.AudioVisualizeBox.SetFreqInfo
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeBox_SetFreqInfo final
{
public:
	TArray<float>                                 InConstantInfo;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioVisualizeBox_SetFreqInfo) == 0x000008, "Wrong alignment on AudioVisualizeBox_SetFreqInfo");
static_assert(sizeof(AudioVisualizeBox_SetFreqInfo) == 0x000010, "Wrong size on AudioVisualizeBox_SetFreqInfo");
static_assert(offsetof(AudioVisualizeBox_SetFreqInfo, InConstantInfo) == 0x000000, "Member 'AudioVisualizeBox_SetFreqInfo::InConstantInfo' has a wrong offset!");

// Function UnrealExtent.AudioVisualizeBox.SetFreqNum
// 0x0004 (0x0004 - 0x0000)
struct AudioVisualizeBox_SetFreqNum final
{
public:
	int32                                         InFreqNum;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioVisualizeBox_SetFreqNum) == 0x000004, "Wrong alignment on AudioVisualizeBox_SetFreqNum");
static_assert(sizeof(AudioVisualizeBox_SetFreqNum) == 0x000004, "Wrong size on AudioVisualizeBox_SetFreqNum");
static_assert(offsetof(AudioVisualizeBox_SetFreqNum, InFreqNum) == 0x000000, "Member 'AudioVisualizeBox_SetFreqNum::InFreqNum' has a wrong offset!");

// Function UnrealExtent.AudioVisualizeBox.SetLoudnessInfo
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeBox_SetLoudnessInfo final
{
public:
	struct FVector2D                              InLoudness;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AudioVisualizeBox_SetLoudnessInfo) == 0x000008, "Wrong alignment on AudioVisualizeBox_SetLoudnessInfo");
static_assert(sizeof(AudioVisualizeBox_SetLoudnessInfo) == 0x000010, "Wrong size on AudioVisualizeBox_SetLoudnessInfo");
static_assert(offsetof(AudioVisualizeBox_SetLoudnessInfo, InLoudness) == 0x000000, "Member 'AudioVisualizeBox_SetLoudnessInfo::InLoudness' has a wrong offset!");

// Function UnrealExtent.AlphaScanButton.SetAdvancedHitAlpha
// 0x0004 (0x0004 - 0x0000)
struct AlphaScanButton_SetAdvancedHitAlpha final
{
public:
	int32                                         InAlpha;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlphaScanButton_SetAdvancedHitAlpha) == 0x000004, "Wrong alignment on AlphaScanButton_SetAdvancedHitAlpha");
static_assert(sizeof(AlphaScanButton_SetAdvancedHitAlpha) == 0x000004, "Wrong size on AlphaScanButton_SetAdvancedHitAlpha");
static_assert(offsetof(AlphaScanButton_SetAdvancedHitAlpha, InAlpha) == 0x000000, "Member 'AlphaScanButton_SetAdvancedHitAlpha::InAlpha' has a wrong offset!");

// Function UnrealExtent.AlphaScanButton.SetAdvancedHitTexture
// 0x0008 (0x0008 - 0x0000)
struct AlphaScanButton_SetAdvancedHitTexture final
{
public:
	class UTexture2D*                             InTexture;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlphaScanButton_SetAdvancedHitTexture) == 0x000008, "Wrong alignment on AlphaScanButton_SetAdvancedHitTexture");
static_assert(sizeof(AlphaScanButton_SetAdvancedHitTexture) == 0x000008, "Wrong size on AlphaScanButton_SetAdvancedHitTexture");
static_assert(offsetof(AlphaScanButton_SetAdvancedHitTexture, InTexture) == 0x000000, "Member 'AlphaScanButton_SetAdvancedHitTexture::InTexture' has a wrong offset!");

// Function UnrealExtent.AudioVisualizeUtil.OnAudioPlaybackPercentCallback
// 0x0010 (0x0010 - 0x0000)
struct AudioVisualizeUtil_OnAudioPlaybackPercentCallback final
{
public:
	const class USoundWave*                       SoundWave;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Percent;                                           // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AudioVisualizeUtil_OnAudioPlaybackPercentCallback) == 0x000008, "Wrong alignment on AudioVisualizeUtil_OnAudioPlaybackPercentCallback");
static_assert(sizeof(AudioVisualizeUtil_OnAudioPlaybackPercentCallback) == 0x000010, "Wrong size on AudioVisualizeUtil_OnAudioPlaybackPercentCallback");
static_assert(offsetof(AudioVisualizeUtil_OnAudioPlaybackPercentCallback, SoundWave) == 0x000000, "Member 'AudioVisualizeUtil_OnAudioPlaybackPercentCallback::SoundWave' has a wrong offset!");
static_assert(offsetof(AudioVisualizeUtil_OnAudioPlaybackPercentCallback, Percent) == 0x000008, "Member 'AudioVisualizeUtil_OnAudioPlaybackPercentCallback::Percent' has a wrong offset!");

// Function UnrealExtent.GSE_GridlyFuncLib.GetSupportCultures
// 0x0010 (0x0010 - 0x0000)
struct GSE_GridlyFuncLib_GetSupportCultures final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_GridlyFuncLib_GetSupportCultures) == 0x000008, "Wrong alignment on GSE_GridlyFuncLib_GetSupportCultures");
static_assert(sizeof(GSE_GridlyFuncLib_GetSupportCultures) == 0x000010, "Wrong size on GSE_GridlyFuncLib_GetSupportCultures");
static_assert(offsetof(GSE_GridlyFuncLib_GetSupportCultures, ReturnValue) == 0x000000, "Member 'GSE_GridlyFuncLib_GetSupportCultures::ReturnValue' has a wrong offset!");

// Function UnrealExtent.GSE_GridlyFuncLib.RequestPage
// 0x0008 (0x0008 - 0x0000)
struct GSE_GridlyFuncLib_RequestPage final
{
public:
	class UObject*                                Obj;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GSE_GridlyFuncLib_RequestPage) == 0x000008, "Wrong alignment on GSE_GridlyFuncLib_RequestPage");
static_assert(sizeof(GSE_GridlyFuncLib_RequestPage) == 0x000008, "Wrong size on GSE_GridlyFuncLib_RequestPage");
static_assert(offsetof(GSE_GridlyFuncLib_RequestPage, Obj) == 0x000000, "Member 'GSE_GridlyFuncLib_RequestPage::Obj' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.CheckHitRotation
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_CheckHitRotation final
{
public:
	struct FRotator                               InRotator;                                         // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_CheckHitRotation) == 0x000008, "Wrong alignment on AutoMovementMonitor_CheckHitRotation");
static_assert(sizeof(AutoMovementMonitor_CheckHitRotation) == 0x000018, "Wrong size on AutoMovementMonitor_CheckHitRotation");
static_assert(offsetof(AutoMovementMonitor_CheckHitRotation, InRotator) == 0x000000, "Member 'AutoMovementMonitor_CheckHitRotation::InRotator' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.CreatePointInstances
// 0x0010 (0x0010 - 0x0000)
struct AutoMovementMonitor_CreatePointInstances final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_CreatePointInstances) == 0x000008, "Wrong alignment on AutoMovementMonitor_CreatePointInstances");
static_assert(sizeof(AutoMovementMonitor_CreatePointInstances) == 0x000010, "Wrong size on AutoMovementMonitor_CreatePointInstances");
static_assert(offsetof(AutoMovementMonitor_CreatePointInstances, InPoints) == 0x000000, "Member 'AutoMovementMonitor_CreatePointInstances::InPoints' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.DrawStatOnHeatmap
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_DrawStatOnHeatmap final
{
public:
	class FString                                 InStatName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTileCount;                                       // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementMonitor_DrawStatOnHeatmap) == 0x000008, "Wrong alignment on AutoMovementMonitor_DrawStatOnHeatmap");
static_assert(sizeof(AutoMovementMonitor_DrawStatOnHeatmap) == 0x000018, "Wrong size on AutoMovementMonitor_DrawStatOnHeatmap");
static_assert(offsetof(AutoMovementMonitor_DrawStatOnHeatmap, InStatName) == 0x000000, "Member 'AutoMovementMonitor_DrawStatOnHeatmap::InStatName' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_DrawStatOnHeatmap, InTileCount) == 0x000010, "Member 'AutoMovementMonitor_DrawStatOnHeatmap::InTileCount' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.GetPointExecutionDurationInfo
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementMonitor_GetPointExecutionDurationInfo final
{
public:
	int64                                         InStartTimestamp;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_GetPointExecutionDurationInfo) == 0x000008, "Wrong alignment on AutoMovementMonitor_GetPointExecutionDurationInfo");
static_assert(sizeof(AutoMovementMonitor_GetPointExecutionDurationInfo) == 0x000018, "Wrong size on AutoMovementMonitor_GetPointExecutionDurationInfo");
static_assert(offsetof(AutoMovementMonitor_GetPointExecutionDurationInfo, InStartTimestamp) == 0x000000, "Member 'AutoMovementMonitor_GetPointExecutionDurationInfo::InStartTimestamp' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_GetPointExecutionDurationInfo, ReturnValue) == 0x000008, "Member 'AutoMovementMonitor_GetPointExecutionDurationInfo::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.GetRotationIncrement
// 0x0088 (0x0088 - 0x0000)
struct AutoMovementMonitor_GetRotationIncrement final
{
public:
	struct FVector                                InRotatorMask;                                     // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAutoMovementViewingPattern            ViewingPattern;                                    // 0x0018(0x0058)(Parm, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_GetRotationIncrement) == 0x000008, "Wrong alignment on AutoMovementMonitor_GetRotationIncrement");
static_assert(sizeof(AutoMovementMonitor_GetRotationIncrement) == 0x000088, "Wrong size on AutoMovementMonitor_GetRotationIncrement");
static_assert(offsetof(AutoMovementMonitor_GetRotationIncrement, InRotatorMask) == 0x000000, "Member 'AutoMovementMonitor_GetRotationIncrement::InRotatorMask' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_GetRotationIncrement, ViewingPattern) == 0x000018, "Member 'AutoMovementMonitor_GetRotationIncrement::ViewingPattern' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_GetRotationIncrement, ReturnValue) == 0x000070, "Member 'AutoMovementMonitor_GetRotationIncrement::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.IncreaseViewingRotation
// 0x0002 (0x0002 - 0x0000)
struct AutoMovementMonitor_IncreaseViewingRotation final
{
public:
	ERotateType                                   RotateType;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProxyCall;                                        // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_IncreaseViewingRotation) == 0x000001, "Wrong alignment on AutoMovementMonitor_IncreaseViewingRotation");
static_assert(sizeof(AutoMovementMonitor_IncreaseViewingRotation) == 0x000002, "Wrong size on AutoMovementMonitor_IncreaseViewingRotation");
static_assert(offsetof(AutoMovementMonitor_IncreaseViewingRotation, RotateType) == 0x000000, "Member 'AutoMovementMonitor_IncreaseViewingRotation::RotateType' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_IncreaseViewingRotation, bProxyCall) == 0x000001, "Member 'AutoMovementMonitor_IncreaseViewingRotation::bProxyCall' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.ProcessAutoMovement
// 0x0030 (0x0030 - 0x0000)
struct AutoMovementMonitor_ProcessAutoMovement final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotator;                                         // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_ProcessAutoMovement) == 0x000008, "Wrong alignment on AutoMovementMonitor_ProcessAutoMovement");
static_assert(sizeof(AutoMovementMonitor_ProcessAutoMovement) == 0x000030, "Wrong size on AutoMovementMonitor_ProcessAutoMovement");
static_assert(offsetof(AutoMovementMonitor_ProcessAutoMovement, InLocation) == 0x000000, "Member 'AutoMovementMonitor_ProcessAutoMovement::InLocation' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_ProcessAutoMovement, InRotator) == 0x000018, "Member 'AutoMovementMonitor_ProcessAutoMovement::InRotator' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.SetSparseVersionEnabled
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_SetSparseVersionEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_SetSparseVersionEnabled) == 0x000001, "Wrong alignment on AutoMovementMonitor_SetSparseVersionEnabled");
static_assert(sizeof(AutoMovementMonitor_SetSparseVersionEnabled) == 0x000001, "Wrong size on AutoMovementMonitor_SetSparseVersionEnabled");
static_assert(offsetof(AutoMovementMonitor_SetSparseVersionEnabled, bEnabled) == 0x000000, "Member 'AutoMovementMonitor_SetSparseVersionEnabled::bEnabled' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.SwitchToVirtualPawn
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementMonitor_SwitchToVirtualPawn final
{
public:
	class UClass*                                 VirtualPlayerBaseClass;                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SpawningOffset;                                    // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_SwitchToVirtualPawn) == 0x000008, "Wrong alignment on AutoMovementMonitor_SwitchToVirtualPawn");
static_assert(sizeof(AutoMovementMonitor_SwitchToVirtualPawn) == 0x000020, "Wrong size on AutoMovementMonitor_SwitchToVirtualPawn");
static_assert(offsetof(AutoMovementMonitor_SwitchToVirtualPawn, VirtualPlayerBaseClass) == 0x000000, "Member 'AutoMovementMonitor_SwitchToVirtualPawn::VirtualPlayerBaseClass' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_SwitchToVirtualPawn, SpawningOffset) == 0x000008, "Member 'AutoMovementMonitor_SwitchToVirtualPawn::SpawningOffset' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.TransportViewingPosition
// 0x0038 (0x0038 - 0x0000)
struct AutoMovementMonitor_TransportViewingPosition final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotator;                                         // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bProxyCall;                                        // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementMonitor_TransportViewingPosition) == 0x000008, "Wrong alignment on AutoMovementMonitor_TransportViewingPosition");
static_assert(sizeof(AutoMovementMonitor_TransportViewingPosition) == 0x000038, "Wrong size on AutoMovementMonitor_TransportViewingPosition");
static_assert(offsetof(AutoMovementMonitor_TransportViewingPosition, InLocation) == 0x000000, "Member 'AutoMovementMonitor_TransportViewingPosition::InLocation' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_TransportViewingPosition, InRotator) == 0x000018, "Member 'AutoMovementMonitor_TransportViewingPosition::InRotator' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_TransportViewingPosition, bProxyCall) == 0x000030, "Member 'AutoMovementMonitor_TransportViewingPosition::bProxyCall' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.CheckAutoMovementCompleted
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_CheckAutoMovementCompleted final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_CheckAutoMovementCompleted) == 0x000001, "Wrong alignment on AutoMovementMonitor_CheckAutoMovementCompleted");
static_assert(sizeof(AutoMovementMonitor_CheckAutoMovementCompleted) == 0x000001, "Wrong size on AutoMovementMonitor_CheckAutoMovementCompleted");
static_assert(offsetof(AutoMovementMonitor_CheckAutoMovementCompleted, ReturnValue) == 0x000000, "Member 'AutoMovementMonitor_CheckAutoMovementCompleted::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.CheckHitLocation
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementMonitor_CheckHitLocation final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementMonitor_CheckHitLocation) == 0x000008, "Wrong alignment on AutoMovementMonitor_CheckHitLocation");
static_assert(sizeof(AutoMovementMonitor_CheckHitLocation) == 0x000020, "Wrong size on AutoMovementMonitor_CheckHitLocation");
static_assert(offsetof(AutoMovementMonitor_CheckHitLocation, InLocation) == 0x000000, "Member 'AutoMovementMonitor_CheckHitLocation::InLocation' has a wrong offset!");
static_assert(offsetof(AutoMovementMonitor_CheckHitLocation, ReturnValue) == 0x000018, "Member 'AutoMovementMonitor_CheckHitLocation::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.HasCompletedPitchingObservation
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_HasCompletedPitchingObservation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_HasCompletedPitchingObservation) == 0x000001, "Wrong alignment on AutoMovementMonitor_HasCompletedPitchingObservation");
static_assert(sizeof(AutoMovementMonitor_HasCompletedPitchingObservation) == 0x000001, "Wrong size on AutoMovementMonitor_HasCompletedPitchingObservation");
static_assert(offsetof(AutoMovementMonitor_HasCompletedPitchingObservation, ReturnValue) == 0x000000, "Member 'AutoMovementMonitor_HasCompletedPitchingObservation::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementMonitor.HasCompletedYawingObservation
// 0x0001 (0x0001 - 0x0000)
struct AutoMovementMonitor_HasCompletedYawingObservation final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementMonitor_HasCompletedYawingObservation) == 0x000001, "Wrong alignment on AutoMovementMonitor_HasCompletedYawingObservation");
static_assert(sizeof(AutoMovementMonitor_HasCompletedYawingObservation) == 0x000001, "Wrong size on AutoMovementMonitor_HasCompletedYawingObservation");
static_assert(offsetof(AutoMovementMonitor_HasCompletedYawingObservation, ReturnValue) == 0x000000, "Member 'AutoMovementMonitor_HasCompletedYawingObservation::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.AppendGeneralStatisticsToCapturedReport
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementUtil_AppendGeneralStatisticsToCapturedReport final
{
public:
	class FString                                 InFilename;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MetricsNum;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PointNum;                                          // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_AppendGeneralStatisticsToCapturedReport) == 0x000008, "Wrong alignment on AutoMovementUtil_AppendGeneralStatisticsToCapturedReport");
static_assert(sizeof(AutoMovementUtil_AppendGeneralStatisticsToCapturedReport) == 0x000018, "Wrong size on AutoMovementUtil_AppendGeneralStatisticsToCapturedReport");
static_assert(offsetof(AutoMovementUtil_AppendGeneralStatisticsToCapturedReport, InFilename) == 0x000000, "Member 'AutoMovementUtil_AppendGeneralStatisticsToCapturedReport::InFilename' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_AppendGeneralStatisticsToCapturedReport, MetricsNum) == 0x000010, "Member 'AutoMovementUtil_AppendGeneralStatisticsToCapturedReport::MetricsNum' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_AppendGeneralStatisticsToCapturedReport, PointNum) == 0x000014, "Member 'AutoMovementUtil_AppendGeneralStatisticsToCapturedReport::PointNum' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.AppendHeaderToCapturedReport
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_AppendHeaderToCapturedReport final
{
public:
	TArray<class FString>                         CapturedInfoNameList;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_AppendHeaderToCapturedReport) == 0x000008, "Wrong alignment on AutoMovementUtil_AppendHeaderToCapturedReport");
static_assert(sizeof(AutoMovementUtil_AppendHeaderToCapturedReport) == 0x000020, "Wrong size on AutoMovementUtil_AppendHeaderToCapturedReport");
static_assert(offsetof(AutoMovementUtil_AppendHeaderToCapturedReport, CapturedInfoNameList) == 0x000000, "Member 'AutoMovementUtil_AppendHeaderToCapturedReport::CapturedInfoNameList' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_AppendHeaderToCapturedReport, InFilename) == 0x000010, "Member 'AutoMovementUtil_AppendHeaderToCapturedReport::InFilename' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.AppendOfflinePathPoints
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_AppendOfflinePathPoints final
{
public:
	TArray<struct FVector>                        InPoints;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilePathUnderProjFolder;                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_AppendOfflinePathPoints) == 0x000008, "Wrong alignment on AutoMovementUtil_AppendOfflinePathPoints");
static_assert(sizeof(AutoMovementUtil_AppendOfflinePathPoints) == 0x000020, "Wrong size on AutoMovementUtil_AppendOfflinePathPoints");
static_assert(offsetof(AutoMovementUtil_AppendOfflinePathPoints, InPoints) == 0x000000, "Member 'AutoMovementUtil_AppendOfflinePathPoints::InPoints' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_AppendOfflinePathPoints, InFilePathUnderProjFolder) == 0x000010, "Member 'AutoMovementUtil_AppendOfflinePathPoints::InFilePathUnderProjFolder' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.ExportCapturedInfoBatch
// 0x0030 (0x0030 - 0x0000)
struct AutoMovementUtil_ExportCapturedInfoBatch final
{
public:
	int32                                         BatchSize;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalPointNum;                                     // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSPathPointStatInfo>           InPathPointStatsInfo;                              // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLastBatch;                                        // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputHeader;                                     // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementUtil_ExportCapturedInfoBatch) == 0x000008, "Wrong alignment on AutoMovementUtil_ExportCapturedInfoBatch");
static_assert(sizeof(AutoMovementUtil_ExportCapturedInfoBatch) == 0x000030, "Wrong size on AutoMovementUtil_ExportCapturedInfoBatch");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, BatchSize) == 0x000000, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::BatchSize' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, TotalPointNum) == 0x000004, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::TotalPointNum' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, InPathPointStatsInfo) == 0x000008, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::InPathPointStatsInfo' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, InFilename) == 0x000018, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::InFilename' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, bLastBatch) == 0x000028, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::bLastBatch' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, bOutputHeader) == 0x000029, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::bOutputHeader' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportCapturedInfoBatch, ReturnValue) == 0x00002A, "Member 'AutoMovementUtil_ExportCapturedInfoBatch::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.ExportStatsCapturedReport
// 0x0028 (0x0028 - 0x0000)
struct AutoMovementUtil_ExportStatsCapturedReport final
{
public:
	TArray<struct FGSPathPointStatInfo>           InPathPointStatsInfo;                              // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 InFilename;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAppend;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputHeader;                                     // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementUtil_ExportStatsCapturedReport) == 0x000008, "Wrong alignment on AutoMovementUtil_ExportStatsCapturedReport");
static_assert(sizeof(AutoMovementUtil_ExportStatsCapturedReport) == 0x000028, "Wrong size on AutoMovementUtil_ExportStatsCapturedReport");
static_assert(offsetof(AutoMovementUtil_ExportStatsCapturedReport, InPathPointStatsInfo) == 0x000000, "Member 'AutoMovementUtil_ExportStatsCapturedReport::InPathPointStatsInfo' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportStatsCapturedReport, InFilename) == 0x000010, "Member 'AutoMovementUtil_ExportStatsCapturedReport::InFilename' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportStatsCapturedReport, bAppend) == 0x000020, "Member 'AutoMovementUtil_ExportStatsCapturedReport::bAppend' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExportStatsCapturedReport, bOutputHeader) == 0x000021, "Member 'AutoMovementUtil_ExportStatsCapturedReport::bOutputHeader' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.ExtractDateTimeInfo
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_ExtractDateTimeInfo final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_ExtractDateTimeInfo) == 0x000008, "Wrong alignment on AutoMovementUtil_ExtractDateTimeInfo");
static_assert(sizeof(AutoMovementUtil_ExtractDateTimeInfo) == 0x000020, "Wrong size on AutoMovementUtil_ExtractDateTimeInfo");
static_assert(offsetof(AutoMovementUtil_ExtractDateTimeInfo, InString) == 0x000000, "Member 'AutoMovementUtil_ExtractDateTimeInfo::InString' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_ExtractDateTimeInfo, ReturnValue) == 0x000010, "Member 'AutoMovementUtil_ExtractDateTimeInfo::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.FormatTimeAuto
// 0x0020 (0x0020 - 0x0000)
struct AutoMovementUtil_FormatTimeAuto final
{
public:
	double                                        InDuration;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumDigits;                                         // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_FormatTimeAuto) == 0x000008, "Wrong alignment on AutoMovementUtil_FormatTimeAuto");
static_assert(sizeof(AutoMovementUtil_FormatTimeAuto) == 0x000020, "Wrong size on AutoMovementUtil_FormatTimeAuto");
static_assert(offsetof(AutoMovementUtil_FormatTimeAuto, InDuration) == 0x000000, "Member 'AutoMovementUtil_FormatTimeAuto::InDuration' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_FormatTimeAuto, NumDigits) == 0x000008, "Member 'AutoMovementUtil_FormatTimeAuto::NumDigits' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_FormatTimeAuto, ReturnValue) == 0x000010, "Member 'AutoMovementUtil_FormatTimeAuto::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.FormatTimeSeconds
// 0x0018 (0x0018 - 0x0000)
struct AutoMovementUtil_FormatTimeSeconds final
{
public:
	float                                         InDuration;                                        // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_FormatTimeSeconds) == 0x000008, "Wrong alignment on AutoMovementUtil_FormatTimeSeconds");
static_assert(sizeof(AutoMovementUtil_FormatTimeSeconds) == 0x000018, "Wrong size on AutoMovementUtil_FormatTimeSeconds");
static_assert(offsetof(AutoMovementUtil_FormatTimeSeconds, InDuration) == 0x000000, "Member 'AutoMovementUtil_FormatTimeSeconds::InDuration' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_FormatTimeSeconds, ReturnValue) == 0x000008, "Member 'AutoMovementUtil_FormatTimeSeconds::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.FromTimestamp
// 0x0010 (0x0010 - 0x0000)
struct AutoMovementUtil_FromTimestamp final
{
public:
	int64                                         Time;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_FromTimestamp) == 0x000008, "Wrong alignment on AutoMovementUtil_FromTimestamp");
static_assert(sizeof(AutoMovementUtil_FromTimestamp) == 0x000010, "Wrong size on AutoMovementUtil_FromTimestamp");
static_assert(offsetof(AutoMovementUtil_FromTimestamp, Time) == 0x000000, "Member 'AutoMovementUtil_FromTimestamp::Time' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_FromTimestamp, ReturnValue) == 0x000008, "Member 'AutoMovementUtil_FromTimestamp::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.GetCurPointProcessedMetricsMap
// 0x00A0 (0x00A0 - 0x0000)
struct AutoMovementUtil_GetCurPointProcessedMetricsMap final
{
public:
	struct FCapturedInfoArrayPerPoint             InCapturedInfoPerPoint;                            // 0x0000(0x0050)(Parm, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    ReturnValue;                                       // 0x0050(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_GetCurPointProcessedMetricsMap) == 0x000008, "Wrong alignment on AutoMovementUtil_GetCurPointProcessedMetricsMap");
static_assert(sizeof(AutoMovementUtil_GetCurPointProcessedMetricsMap) == 0x0000A0, "Wrong size on AutoMovementUtil_GetCurPointProcessedMetricsMap");
static_assert(offsetof(AutoMovementUtil_GetCurPointProcessedMetricsMap, InCapturedInfoPerPoint) == 0x000000, "Member 'AutoMovementUtil_GetCurPointProcessedMetricsMap::InCapturedInfoPerPoint' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_GetCurPointProcessedMetricsMap, ReturnValue) == 0x000050, "Member 'AutoMovementUtil_GetCurPointProcessedMetricsMap::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.GetNowTimestamp
// 0x0008 (0x0008 - 0x0000)
struct AutoMovementUtil_GetNowTimestamp final
{
public:
	int64                                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_GetNowTimestamp) == 0x000008, "Wrong alignment on AutoMovementUtil_GetNowTimestamp");
static_assert(sizeof(AutoMovementUtil_GetNowTimestamp) == 0x000008, "Wrong size on AutoMovementUtil_GetNowTimestamp");
static_assert(offsetof(AutoMovementUtil_GetNowTimestamp, ReturnValue) == 0x000000, "Member 'AutoMovementUtil_GetNowTimestamp::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.GetOfflinePathPoints
// 0x0028 (0x0028 - 0x0000)
struct AutoMovementUtil_GetOfflinePathPoints final
{
public:
	class FString                                 InFilePathUnderProjDir;                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSparsePoints;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_GetOfflinePathPoints) == 0x000008, "Wrong alignment on AutoMovementUtil_GetOfflinePathPoints");
static_assert(sizeof(AutoMovementUtil_GetOfflinePathPoints) == 0x000028, "Wrong size on AutoMovementUtil_GetOfflinePathPoints");
static_assert(offsetof(AutoMovementUtil_GetOfflinePathPoints, InFilePathUnderProjDir) == 0x000000, "Member 'AutoMovementUtil_GetOfflinePathPoints::InFilePathUnderProjDir' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_GetOfflinePathPoints, bUseSparsePoints) == 0x000010, "Member 'AutoMovementUtil_GetOfflinePathPoints::bUseSparsePoints' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_GetOfflinePathPoints, ReturnValue) == 0x000018, "Member 'AutoMovementUtil_GetOfflinePathPoints::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.GetVfxAutoPlayerRootFolderPath
// 0x0010 (0x0010 - 0x0000)
struct AutoMovementUtil_GetVfxAutoPlayerRootFolderPath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_GetVfxAutoPlayerRootFolderPath) == 0x000008, "Wrong alignment on AutoMovementUtil_GetVfxAutoPlayerRootFolderPath");
static_assert(sizeof(AutoMovementUtil_GetVfxAutoPlayerRootFolderPath) == 0x000010, "Wrong size on AutoMovementUtil_GetVfxAutoPlayerRootFolderPath");
static_assert(offsetof(AutoMovementUtil_GetVfxAutoPlayerRootFolderPath, ReturnValue) == 0x000000, "Member 'AutoMovementUtil_GetVfxAutoPlayerRootFolderPath::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.InsertIntoCapturedInfoArrayPerPoint
// 0x00B0 (0x00B0 - 0x0000)
struct AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint final
{
public:
	TArray<struct FGSCapturedStatResult>          RawCapturedData;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCapturedInfoArrayPerPoint             CapturedInfoArrayPerPoint;                         // 0x0010(0x0050)(Parm, NativeAccessSpecifierPublic)
	struct FCapturedInfoArrayPerPoint             ReturnValue;                                       // 0x0060(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint) == 0x000008, "Wrong alignment on AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint");
static_assert(sizeof(AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint) == 0x0000B0, "Wrong size on AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint");
static_assert(offsetof(AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint, RawCapturedData) == 0x000000, "Member 'AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint::RawCapturedData' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint, CapturedInfoArrayPerPoint) == 0x000010, "Member 'AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint::CapturedInfoArrayPerPoint' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint, ReturnValue) == 0x000060, "Member 'AutoMovementUtil_InsertIntoCapturedInfoArrayPerPoint::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.LoadStatsCapturerReport
// 0x0028 (0x0028 - 0x0000)
struct AutoMovementUtil_LoadStatsCapturerReport final
{
public:
	class FString                                 InFileNameUnderProjFolder;                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGSPathPointStatInfo>           AllPathPointStatInfo;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PointNum;                                          // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementUtil_LoadStatsCapturerReport) == 0x000008, "Wrong alignment on AutoMovementUtil_LoadStatsCapturerReport");
static_assert(sizeof(AutoMovementUtil_LoadStatsCapturerReport) == 0x000028, "Wrong size on AutoMovementUtil_LoadStatsCapturerReport");
static_assert(offsetof(AutoMovementUtil_LoadStatsCapturerReport, InFileNameUnderProjFolder) == 0x000000, "Member 'AutoMovementUtil_LoadStatsCapturerReport::InFileNameUnderProjFolder' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_LoadStatsCapturerReport, AllPathPointStatInfo) == 0x000010, "Member 'AutoMovementUtil_LoadStatsCapturerReport::AllPathPointStatInfo' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_LoadStatsCapturerReport, PointNum) == 0x000020, "Member 'AutoMovementUtil_LoadStatsCapturerReport::PointNum' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_LoadStatsCapturerReport, ReturnValue) == 0x000024, "Member 'AutoMovementUtil_LoadStatsCapturerReport::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.MergeMipReportsWithFileNameKeyword
// 0x0038 (0x0038 - 0x0000)
struct AutoMovementUtil_MergeMipReportsWithFileNameKeyword final
{
public:
	class FString                                 InDirectoryUnderProjDir;                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFileNameKeyword;                                 // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputMergedFileName;                              // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword) == 0x000008, "Wrong alignment on AutoMovementUtil_MergeMipReportsWithFileNameKeyword");
static_assert(sizeof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword) == 0x000038, "Wrong size on AutoMovementUtil_MergeMipReportsWithFileNameKeyword");
static_assert(offsetof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword, InDirectoryUnderProjDir) == 0x000000, "Member 'AutoMovementUtil_MergeMipReportsWithFileNameKeyword::InDirectoryUnderProjDir' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword, InFileNameKeyword) == 0x000010, "Member 'AutoMovementUtil_MergeMipReportsWithFileNameKeyword::InFileNameKeyword' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword, OutputMergedFileName) == 0x000020, "Member 'AutoMovementUtil_MergeMipReportsWithFileNameKeyword::OutputMergedFileName' has a wrong offset!");
static_assert(offsetof(AutoMovementUtil_MergeMipReportsWithFileNameKeyword, ReturnValue) == 0x000030, "Member 'AutoMovementUtil_MergeMipReportsWithFileNameKeyword::ReturnValue' has a wrong offset!");

// Function UnrealExtent.AutoMovementUtil.MergeMultiTextureMipReports
// 0x0028 (0x0028 - 0x0000)
struct AutoMovementUtil_MergeMultiTextureMipReports final
{
public:
	TArray<class FString>                         InReportFilePaths;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 OutputMergedFileName;                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
