#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USharp

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class USharp.DummyRepProps1
// 0x0000 (0x0028 - 0x0028)
class UDummyRepProps1 : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyRepProps1">();
	}
	static class UDummyRepProps1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyRepProps1>();
	}
};
static_assert(alignof(UDummyRepProps1) == 0x000008, "Wrong alignment on UDummyRepProps1");
static_assert(sizeof(UDummyRepProps1) == 0x000028, "Wrong size on UDummyRepProps1");

// Class USharp.DummyRepProps2
// 0x0000 (0x0028 - 0x0028)
class UDummyRepProps2 : public UDummyRepProps1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyRepProps2">();
	}
	static class UDummyRepProps2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyRepProps2>();
	}
};
static_assert(alignof(UDummyRepProps2) == 0x000008, "Wrong alignment on UDummyRepProps2");
static_assert(sizeof(UDummyRepProps2) == 0x000028, "Wrong size on UDummyRepProps2");

// Class USharp.DummyRepProps3
// 0x0000 (0x0028 - 0x0028)
class UDummyRepProps3 final : public UDummyRepProps2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyRepProps3">();
	}
	static class UDummyRepProps3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyRepProps3>();
	}
};
static_assert(alignof(UDummyRepProps3) == 0x000008, "Wrong alignment on UDummyRepProps3");
static_assert(sizeof(UDummyRepProps3) == 0x000028, "Wrong size on UDummyRepProps3");

// Class USharp.SharpClass
// 0x0060 (0x0290 - 0x0230)
class USharpClass final : public UClass
{
public:
	uint8                                         Pad_230[0x60];                                     // 0x0230(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SharpClass">();
	}
	static class USharpClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharpClass>();
	}
};
static_assert(alignof(USharpClass) == 0x000008, "Wrong alignment on USharpClass");
static_assert(sizeof(USharpClass) == 0x000290, "Wrong size on USharpClass");

// Class USharp.SharpStruct
// 0x0010 (0x00D0 - 0x00C0)
class USharpStruct final : public UScriptStruct
{
public:
	uint8                                         Pad_C0[0x10];                                      // 0x00C0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SharpStruct">();
	}
	static class USharpStruct* GetDefaultObj()
	{
		return GetDefaultObjImpl<USharpStruct>();
	}
};
static_assert(alignof(USharpStruct) == 0x000008, "Wrong alignment on USharpStruct");
static_assert(sizeof(USharpStruct) == 0x0000D0, "Wrong size on USharpStruct");

// Class USharp.USharpCommandlet
// 0x0000 (0x0080 - 0x0080)
class UUSharpCommandlet final : public UCommandlet
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"USharpCommandlet">();
	}
	static class UUSharpCommandlet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUSharpCommandlet>();
	}
};
static_assert(alignof(UUSharpCommandlet) == 0x000008, "Wrong alignment on UUSharpCommandlet");
static_assert(sizeof(UUSharpCommandlet) == 0x000080, "Wrong size on UUSharpCommandlet");

// Class USharp.DummySetupPlayerInput1
// 0x0000 (0x02F8 - 0x02F8)
class ADummySetupPlayerInput1 : public APawn
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummySetupPlayerInput1">();
	}
	static class ADummySetupPlayerInput1* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummySetupPlayerInput1>();
	}
};
static_assert(alignof(ADummySetupPlayerInput1) == 0x000008, "Wrong alignment on ADummySetupPlayerInput1");
static_assert(sizeof(ADummySetupPlayerInput1) == 0x0002F8, "Wrong size on ADummySetupPlayerInput1");

// Class USharp.DummySetupPlayerInput2
// 0x0000 (0x02F8 - 0x02F8)
class ADummySetupPlayerInput2 : public ADummySetupPlayerInput1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummySetupPlayerInput2">();
	}
	static class ADummySetupPlayerInput2* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummySetupPlayerInput2>();
	}
};
static_assert(alignof(ADummySetupPlayerInput2) == 0x000008, "Wrong alignment on ADummySetupPlayerInput2");
static_assert(sizeof(ADummySetupPlayerInput2) == 0x0002F8, "Wrong size on ADummySetupPlayerInput2");

// Class USharp.DummySetupPlayerInput3
// 0x0000 (0x02F8 - 0x02F8)
class ADummySetupPlayerInput3 final : public ADummySetupPlayerInput2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummySetupPlayerInput3">();
	}
	static class ADummySetupPlayerInput3* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummySetupPlayerInput3>();
	}
};
static_assert(alignof(ADummySetupPlayerInput3) == 0x000008, "Wrong alignment on ADummySetupPlayerInput3");
static_assert(sizeof(ADummySetupPlayerInput3) == 0x0002F8, "Wrong size on ADummySetupPlayerInput3");

// Class USharp.DummyActorBeginPlay1
// 0x0000 (0x0278 - 0x0278)
class ADummyActorBeginPlay1 : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorBeginPlay1">();
	}
	static class ADummyActorBeginPlay1* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorBeginPlay1>();
	}
};
static_assert(alignof(ADummyActorBeginPlay1) == 0x000008, "Wrong alignment on ADummyActorBeginPlay1");
static_assert(sizeof(ADummyActorBeginPlay1) == 0x000278, "Wrong size on ADummyActorBeginPlay1");

// Class USharp.DummyActorBeginPlay2
// 0x0000 (0x0278 - 0x0278)
class ADummyActorBeginPlay2 : public ADummyActorBeginPlay1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorBeginPlay2">();
	}
	static class ADummyActorBeginPlay2* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorBeginPlay2>();
	}
};
static_assert(alignof(ADummyActorBeginPlay2) == 0x000008, "Wrong alignment on ADummyActorBeginPlay2");
static_assert(sizeof(ADummyActorBeginPlay2) == 0x000278, "Wrong size on ADummyActorBeginPlay2");

// Class USharp.DummyActorBeginPlay3
// 0x0000 (0x0278 - 0x0278)
class ADummyActorBeginPlay3 final : public ADummyActorBeginPlay2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorBeginPlay3">();
	}
	static class ADummyActorBeginPlay3* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorBeginPlay3>();
	}
};
static_assert(alignof(ADummyActorBeginPlay3) == 0x000008, "Wrong alignment on ADummyActorBeginPlay3");
static_assert(sizeof(ADummyActorBeginPlay3) == 0x000278, "Wrong size on ADummyActorBeginPlay3");

// Class USharp.DummyActorEndPlay1
// 0x0000 (0x0278 - 0x0278)
class ADummyActorEndPlay1 : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorEndPlay1">();
	}
	static class ADummyActorEndPlay1* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorEndPlay1>();
	}
};
static_assert(alignof(ADummyActorEndPlay1) == 0x000008, "Wrong alignment on ADummyActorEndPlay1");
static_assert(sizeof(ADummyActorEndPlay1) == 0x000278, "Wrong size on ADummyActorEndPlay1");

// Class USharp.DummyActorEndPlay2
// 0x0000 (0x0278 - 0x0278)
class ADummyActorEndPlay2 : public ADummyActorEndPlay1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorEndPlay2">();
	}
	static class ADummyActorEndPlay2* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorEndPlay2>();
	}
};
static_assert(alignof(ADummyActorEndPlay2) == 0x000008, "Wrong alignment on ADummyActorEndPlay2");
static_assert(sizeof(ADummyActorEndPlay2) == 0x000278, "Wrong size on ADummyActorEndPlay2");

// Class USharp.DummyActorEndPlay3
// 0x0000 (0x0278 - 0x0278)
class ADummyActorEndPlay3 final : public ADummyActorEndPlay2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorEndPlay3">();
	}
	static class ADummyActorEndPlay3* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADummyActorEndPlay3>();
	}
};
static_assert(alignof(ADummyActorEndPlay3) == 0x000008, "Wrong alignment on ADummyActorEndPlay3");
static_assert(sizeof(ADummyActorEndPlay3) == 0x000278, "Wrong size on ADummyActorEndPlay3");

// Class USharp.DummyActorComponentBeginPlay1
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentBeginPlay1 : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentBeginPlay1">();
	}
	static class UDummyActorComponentBeginPlay1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentBeginPlay1>();
	}
};
static_assert(alignof(UDummyActorComponentBeginPlay1) == 0x000008, "Wrong alignment on UDummyActorComponentBeginPlay1");
static_assert(sizeof(UDummyActorComponentBeginPlay1) == 0x0000B0, "Wrong size on UDummyActorComponentBeginPlay1");

// Class USharp.DummyActorComponentBeginPlay2
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentBeginPlay2 : public UDummyActorComponentBeginPlay1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentBeginPlay2">();
	}
	static class UDummyActorComponentBeginPlay2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentBeginPlay2>();
	}
};
static_assert(alignof(UDummyActorComponentBeginPlay2) == 0x000008, "Wrong alignment on UDummyActorComponentBeginPlay2");
static_assert(sizeof(UDummyActorComponentBeginPlay2) == 0x0000B0, "Wrong size on UDummyActorComponentBeginPlay2");

// Class USharp.DummyActorComponentBeginPlay3
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentBeginPlay3 final : public UDummyActorComponentBeginPlay2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentBeginPlay3">();
	}
	static class UDummyActorComponentBeginPlay3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentBeginPlay3>();
	}
};
static_assert(alignof(UDummyActorComponentBeginPlay3) == 0x000008, "Wrong alignment on UDummyActorComponentBeginPlay3");
static_assert(sizeof(UDummyActorComponentBeginPlay3) == 0x0000B0, "Wrong size on UDummyActorComponentBeginPlay3");

// Class USharp.DummyActorComponentEndPlay1
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentEndPlay1 : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentEndPlay1">();
	}
	static class UDummyActorComponentEndPlay1* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentEndPlay1>();
	}
};
static_assert(alignof(UDummyActorComponentEndPlay1) == 0x000008, "Wrong alignment on UDummyActorComponentEndPlay1");
static_assert(sizeof(UDummyActorComponentEndPlay1) == 0x0000B0, "Wrong size on UDummyActorComponentEndPlay1");

// Class USharp.DummyActorComponentEndPlay2
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentEndPlay2 : public UDummyActorComponentEndPlay1
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentEndPlay2">();
	}
	static class UDummyActorComponentEndPlay2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentEndPlay2>();
	}
};
static_assert(alignof(UDummyActorComponentEndPlay2) == 0x000008, "Wrong alignment on UDummyActorComponentEndPlay2");
static_assert(sizeof(UDummyActorComponentEndPlay2) == 0x0000B0, "Wrong size on UDummyActorComponentEndPlay2");

// Class USharp.DummyActorComponentEndPlay3
// 0x0000 (0x00B0 - 0x00B0)
class UDummyActorComponentEndPlay3 final : public UDummyActorComponentEndPlay2
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"DummyActorComponentEndPlay3">();
	}
	static class UDummyActorComponentEndPlay3* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDummyActorComponentEndPlay3>();
	}
};
static_assert(alignof(UDummyActorComponentEndPlay3) == 0x000008, "Wrong alignment on UDummyActorComponentEndPlay3");
static_assert(sizeof(UDummyActorComponentEndPlay3) == 0x0000B0, "Wrong size on UDummyActorComponentEndPlay3");

}

