#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: V8

#include "Basic.hpp"

#include "V8_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function V8.DirectoryWatcher.Contains
// 0x0018 (0x0018 - 0x0000)
struct DirectoryWatcher_Contains final
{
public:
	class FString                                 File;                                              // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(DirectoryWatcher_Contains) == 0x000008, "Wrong alignment on DirectoryWatcher_Contains");
static_assert(sizeof(DirectoryWatcher_Contains) == 0x000018, "Wrong size on DirectoryWatcher_Contains");
static_assert(offsetof(DirectoryWatcher_Contains, File) == 0x000000, "Member 'DirectoryWatcher_Contains::File' has a wrong offset!");
static_assert(offsetof(DirectoryWatcher_Contains, ReturnValue) == 0x000010, "Member 'DirectoryWatcher_Contains::ReturnValue' has a wrong offset!");

// Function V8.DirectoryWatcher.Watch
// 0x0010 (0x0010 - 0x0000)
struct DirectoryWatcher_Watch final
{
public:
	class FString                                 Directory;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DirectoryWatcher_Watch) == 0x000008, "Wrong alignment on DirectoryWatcher_Watch");
static_assert(sizeof(DirectoryWatcher_Watch) == 0x000010, "Wrong size on DirectoryWatcher_Watch");
static_assert(offsetof(DirectoryWatcher_Watch, Directory) == 0x000000, "Member 'DirectoryWatcher_Watch::Directory' has a wrong offset!");

// Function V8.JavascriptComponent.Expose
// 0x0018 (0x0018 - 0x0000)
struct JavascriptComponent_Expose final
{
public:
	class FString                                 ExposedAs;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_Expose) == 0x000008, "Wrong alignment on JavascriptComponent_Expose");
static_assert(sizeof(JavascriptComponent_Expose) == 0x000018, "Wrong size on JavascriptComponent_Expose");
static_assert(offsetof(JavascriptComponent_Expose, ExposedAs) == 0x000000, "Member 'JavascriptComponent_Expose::ExposedAs' has a wrong offset!");
static_assert(offsetof(JavascriptComponent_Expose, Object) == 0x000010, "Member 'JavascriptComponent_Expose::Object' has a wrong offset!");

// Function V8.JavascriptComponent.Invoke
// 0x0008 (0x0008 - 0x0000)
struct JavascriptComponent_Invoke final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_Invoke) == 0x000004, "Wrong alignment on JavascriptComponent_Invoke");
static_assert(sizeof(JavascriptComponent_Invoke) == 0x000008, "Wrong size on JavascriptComponent_Invoke");
static_assert(offsetof(JavascriptComponent_Invoke, Name_0) == 0x000000, "Member 'JavascriptComponent_Invoke::Name_0' has a wrong offset!");

// DelegateFunction V8.JavascriptComponent.JavascriptNameSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct JavascriptComponent_JavascriptNameSignature__DelegateSignature final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_JavascriptNameSignature__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptComponent_JavascriptNameSignature__DelegateSignature");
static_assert(sizeof(JavascriptComponent_JavascriptNameSignature__DelegateSignature) == 0x000008, "Wrong size on JavascriptComponent_JavascriptNameSignature__DelegateSignature");
static_assert(offsetof(JavascriptComponent_JavascriptNameSignature__DelegateSignature, Name_0) == 0x000000, "Member 'JavascriptComponent_JavascriptNameSignature__DelegateSignature::Name_0' has a wrong offset!");

// DelegateFunction V8.JavascriptComponent.JavascriptTickSignature__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct JavascriptComponent_JavascriptTickSignature__DelegateSignature final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_JavascriptTickSignature__DelegateSignature) == 0x000004, "Wrong alignment on JavascriptComponent_JavascriptTickSignature__DelegateSignature");
static_assert(sizeof(JavascriptComponent_JavascriptTickSignature__DelegateSignature) == 0x000004, "Wrong size on JavascriptComponent_JavascriptTickSignature__DelegateSignature");
static_assert(offsetof(JavascriptComponent_JavascriptTickSignature__DelegateSignature, DeltaSeconds) == 0x000000, "Member 'JavascriptComponent_JavascriptTickSignature__DelegateSignature::DeltaSeconds' has a wrong offset!");

// Function V8.JavascriptComponent.ResolveAsset
// 0x0018 (0x0018 - 0x0000)
struct JavascriptComponent_ResolveAsset final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTryLoad;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_ResolveAsset) == 0x000008, "Wrong alignment on JavascriptComponent_ResolveAsset");
static_assert(sizeof(JavascriptComponent_ResolveAsset) == 0x000018, "Wrong size on JavascriptComponent_ResolveAsset");
static_assert(offsetof(JavascriptComponent_ResolveAsset, Name_0) == 0x000000, "Member 'JavascriptComponent_ResolveAsset::Name_0' has a wrong offset!");
static_assert(offsetof(JavascriptComponent_ResolveAsset, bTryLoad) == 0x000008, "Member 'JavascriptComponent_ResolveAsset::bTryLoad' has a wrong offset!");
static_assert(offsetof(JavascriptComponent_ResolveAsset, ReturnValue) == 0x000010, "Member 'JavascriptComponent_ResolveAsset::ReturnValue' has a wrong offset!");

// Function V8.JavascriptComponent.ResolveClass
// 0x0010 (0x0010 - 0x0000)
struct JavascriptComponent_ResolveClass final
{
public:
	class FName                                   Name_0;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptComponent_ResolveClass) == 0x000008, "Wrong alignment on JavascriptComponent_ResolveClass");
static_assert(sizeof(JavascriptComponent_ResolveClass) == 0x000010, "Wrong size on JavascriptComponent_ResolveClass");
static_assert(offsetof(JavascriptComponent_ResolveClass, Name_0) == 0x000000, "Member 'JavascriptComponent_ResolveClass::Name_0' has a wrong offset!");
static_assert(offsetof(JavascriptComponent_ResolveClass, ReturnValue) == 0x000008, "Member 'JavascriptComponent_ResolveClass::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.CreateInspector
// 0x0004 (0x0004 - 0x0000)
struct JavascriptContext_CreateInspector final
{
public:
	int32                                         Port;                                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_CreateInspector) == 0x000004, "Wrong alignment on JavascriptContext_CreateInspector");
static_assert(sizeof(JavascriptContext_CreateInspector) == 0x000004, "Wrong size on JavascriptContext_CreateInspector");
static_assert(offsetof(JavascriptContext_CreateInspector, Port) == 0x000000, "Member 'JavascriptContext_CreateInspector::Port' has a wrong offset!");

// Function V8.JavascriptContext.Expose
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_Expose final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_Expose) == 0x000008, "Wrong alignment on JavascriptContext_Expose");
static_assert(sizeof(JavascriptContext_Expose) == 0x000018, "Wrong size on JavascriptContext_Expose");
static_assert(offsetof(JavascriptContext_Expose, Name_0) == 0x000000, "Member 'JavascriptContext_Expose::Name_0' has a wrong offset!");
static_assert(offsetof(JavascriptContext_Expose, Object) == 0x000010, "Member 'JavascriptContext_Expose::Object' has a wrong offset!");

// Function V8.JavascriptContext.FindPathFile
// 0x0030 (0x0030 - 0x0000)
struct JavascriptContext_FindPathFile final
{
public:
	class FString                                 TargetRootPath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TargetFileName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutFiles;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_FindPathFile) == 0x000008, "Wrong alignment on JavascriptContext_FindPathFile");
static_assert(sizeof(JavascriptContext_FindPathFile) == 0x000030, "Wrong size on JavascriptContext_FindPathFile");
static_assert(offsetof(JavascriptContext_FindPathFile, TargetRootPath) == 0x000000, "Member 'JavascriptContext_FindPathFile::TargetRootPath' has a wrong offset!");
static_assert(offsetof(JavascriptContext_FindPathFile, TargetFileName) == 0x000010, "Member 'JavascriptContext_FindPathFile::TargetFileName' has a wrong offset!");
static_assert(offsetof(JavascriptContext_FindPathFile, OutFiles) == 0x000020, "Member 'JavascriptContext_FindPathFile::OutFiles' has a wrong offset!");

// Function V8.JavascriptContext.GetScriptFileFullPath
// 0x0020 (0x0020 - 0x0000)
struct JavascriptContext_GetScriptFileFullPath final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_GetScriptFileFullPath) == 0x000008, "Wrong alignment on JavascriptContext_GetScriptFileFullPath");
static_assert(sizeof(JavascriptContext_GetScriptFileFullPath) == 0x000020, "Wrong size on JavascriptContext_GetScriptFileFullPath");
static_assert(offsetof(JavascriptContext_GetScriptFileFullPath, Filename) == 0x000000, "Member 'JavascriptContext_GetScriptFileFullPath::Filename' has a wrong offset!");
static_assert(offsetof(JavascriptContext_GetScriptFileFullPath, ReturnValue) == 0x000010, "Member 'JavascriptContext_GetScriptFileFullPath::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.ReadScriptFile
// 0x0020 (0x0020 - 0x0000)
struct JavascriptContext_ReadScriptFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_ReadScriptFile) == 0x000008, "Wrong alignment on JavascriptContext_ReadScriptFile");
static_assert(sizeof(JavascriptContext_ReadScriptFile) == 0x000020, "Wrong size on JavascriptContext_ReadScriptFile");
static_assert(offsetof(JavascriptContext_ReadScriptFile, Filename) == 0x000000, "Member 'JavascriptContext_ReadScriptFile::Filename' has a wrong offset!");
static_assert(offsetof(JavascriptContext_ReadScriptFile, ReturnValue) == 0x000010, "Member 'JavascriptContext_ReadScriptFile::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.RegisterConsoleCommand
// 0x0030 (0x0030 - 0x0000)
struct JavascriptContext_RegisterConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Help;                                              // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FJavascriptFunction                    Function;                                          // 0x0020(0x0010)(Parm, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_RegisterConsoleCommand) == 0x000008, "Wrong alignment on JavascriptContext_RegisterConsoleCommand");
static_assert(sizeof(JavascriptContext_RegisterConsoleCommand) == 0x000030, "Wrong size on JavascriptContext_RegisterConsoleCommand");
static_assert(offsetof(JavascriptContext_RegisterConsoleCommand, Command) == 0x000000, "Member 'JavascriptContext_RegisterConsoleCommand::Command' has a wrong offset!");
static_assert(offsetof(JavascriptContext_RegisterConsoleCommand, Help) == 0x000010, "Member 'JavascriptContext_RegisterConsoleCommand::Help' has a wrong offset!");
static_assert(offsetof(JavascriptContext_RegisterConsoleCommand, Function) == 0x000020, "Member 'JavascriptContext_RegisterConsoleCommand::Function' has a wrong offset!");

// Function V8.JavascriptContext.RunFile
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_RunFile final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_RunFile) == 0x000008, "Wrong alignment on JavascriptContext_RunFile");
static_assert(sizeof(JavascriptContext_RunFile) == 0x000010, "Wrong size on JavascriptContext_RunFile");
static_assert(offsetof(JavascriptContext_RunFile, Filename) == 0x000000, "Member 'JavascriptContext_RunFile::Filename' has a wrong offset!");

// Function V8.JavascriptContext.RunScript
// 0x0028 (0x0028 - 0x0000)
struct JavascriptContext_RunScript final
{
public:
	class FString                                 Script;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutput;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_RunScript) == 0x000008, "Wrong alignment on JavascriptContext_RunScript");
static_assert(sizeof(JavascriptContext_RunScript) == 0x000028, "Wrong size on JavascriptContext_RunScript");
static_assert(offsetof(JavascriptContext_RunScript, Script) == 0x000000, "Member 'JavascriptContext_RunScript::Script' has a wrong offset!");
static_assert(offsetof(JavascriptContext_RunScript, bOutput) == 0x000010, "Member 'JavascriptContext_RunScript::bOutput' has a wrong offset!");
static_assert(offsetof(JavascriptContext_RunScript, ReturnValue) == 0x000018, "Member 'JavascriptContext_RunScript::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.SetContextId
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_SetContextId final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_SetContextId) == 0x000008, "Wrong alignment on JavascriptContext_SetContextId");
static_assert(sizeof(JavascriptContext_SetContextId) == 0x000010, "Wrong size on JavascriptContext_SetContextId");
static_assert(offsetof(JavascriptContext_SetContextId, Name_0) == 0x000000, "Member 'JavascriptContext_SetContextId::Name_0' has a wrong offset!");

// Function V8.JavascriptContext.UnregisterConsoleCommand
// 0x0010 (0x0010 - 0x0000)
struct JavascriptContext_UnregisterConsoleCommand final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_UnregisterConsoleCommand) == 0x000008, "Wrong alignment on JavascriptContext_UnregisterConsoleCommand");
static_assert(sizeof(JavascriptContext_UnregisterConsoleCommand) == 0x000010, "Wrong size on JavascriptContext_UnregisterConsoleCommand");
static_assert(offsetof(JavascriptContext_UnregisterConsoleCommand, Command) == 0x000000, "Member 'JavascriptContext_UnregisterConsoleCommand::Command' has a wrong offset!");

// Function V8.JavascriptContext.WriteAliases
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_WriteAliases final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptContext_WriteAliases) == 0x000008, "Wrong alignment on JavascriptContext_WriteAliases");
static_assert(sizeof(JavascriptContext_WriteAliases) == 0x000018, "Wrong size on JavascriptContext_WriteAliases");
static_assert(offsetof(JavascriptContext_WriteAliases, Target) == 0x000000, "Member 'JavascriptContext_WriteAliases::Target' has a wrong offset!");
static_assert(offsetof(JavascriptContext_WriteAliases, ReturnValue) == 0x000010, "Member 'JavascriptContext_WriteAliases::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.WriteDTS
// 0x0018 (0x0018 - 0x0000)
struct JavascriptContext_WriteDTS final
{
public:
	class FString                                 Target;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludingTooltip;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptContext_WriteDTS) == 0x000008, "Wrong alignment on JavascriptContext_WriteDTS");
static_assert(sizeof(JavascriptContext_WriteDTS) == 0x000018, "Wrong size on JavascriptContext_WriteDTS");
static_assert(offsetof(JavascriptContext_WriteDTS, Target) == 0x000000, "Member 'JavascriptContext_WriteDTS::Target' has a wrong offset!");
static_assert(offsetof(JavascriptContext_WriteDTS, bIncludingTooltip) == 0x000010, "Member 'JavascriptContext_WriteDTS::bIncludingTooltip' has a wrong offset!");
static_assert(offsetof(JavascriptContext_WriteDTS, ReturnValue) == 0x000011, "Member 'JavascriptContext_WriteDTS::ReturnValue' has a wrong offset!");

// Function V8.JavascriptContext.IsDebugContext
// 0x0001 (0x0001 - 0x0000)
struct JavascriptContext_IsDebugContext final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptContext_IsDebugContext) == 0x000001, "Wrong alignment on JavascriptContext_IsDebugContext");
static_assert(sizeof(JavascriptContext_IsDebugContext) == 0x000001, "Wrong size on JavascriptContext_IsDebugContext");
static_assert(offsetof(JavascriptContext_IsDebugContext, ReturnValue) == 0x000000, "Member 'JavascriptContext_IsDebugContext::ReturnValue' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.Bind
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_Bind final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_Bind) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_Bind");
static_assert(sizeof(JavascriptGlobalDelegates_Bind) == 0x000010, "Wrong size on JavascriptGlobalDelegates_Bind");
static_assert(offsetof(JavascriptGlobalDelegates_Bind, Key) == 0x000000, "Member 'JavascriptGlobalDelegates_Bind::Key' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.LevelAddedToWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_LevelAddedToWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_LevelAddedToWorld) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_LevelAddedToWorld");
static_assert(sizeof(JavascriptGlobalDelegates_LevelAddedToWorld) == 0x000010, "Wrong size on JavascriptGlobalDelegates_LevelAddedToWorld");
static_assert(offsetof(JavascriptGlobalDelegates_LevelAddedToWorld, Level) == 0x000000, "Member 'JavascriptGlobalDelegates_LevelAddedToWorld::Level' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_LevelAddedToWorld, World) == 0x000008, "Member 'JavascriptGlobalDelegates_LevelAddedToWorld::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.LevelRemovedFromWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_LevelRemovedFromWorld final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_LevelRemovedFromWorld) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_LevelRemovedFromWorld");
static_assert(sizeof(JavascriptGlobalDelegates_LevelRemovedFromWorld) == 0x000010, "Wrong size on JavascriptGlobalDelegates_LevelRemovedFromWorld");
static_assert(offsetof(JavascriptGlobalDelegates_LevelRemovedFromWorld, Level) == 0x000000, "Member 'JavascriptGlobalDelegates_LevelRemovedFromWorld::Level' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_LevelRemovedFromWorld, World) == 0x000008, "Member 'JavascriptGlobalDelegates_LevelRemovedFromWorld::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnActorLabelChanged
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnActorLabelChanged final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnActorLabelChanged) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnActorLabelChanged");
static_assert(sizeof(JavascriptGlobalDelegates_OnActorLabelChanged) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnActorLabelChanged");
static_assert(offsetof(JavascriptGlobalDelegates_OnActorLabelChanged, Actor) == 0x000000, "Member 'JavascriptGlobalDelegates_OnActorLabelChanged::Actor' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnAssetLoaded
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnAssetLoaded final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnAssetLoaded) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnAssetLoaded");
static_assert(sizeof(JavascriptGlobalDelegates_OnAssetLoaded) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnAssetLoaded");
static_assert(offsetof(JavascriptGlobalDelegates_OnAssetLoaded, Object) == 0x000000, "Member 'JavascriptGlobalDelegates_OnAssetLoaded::Object' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnObjectModified
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectModified final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnObjectModified) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnObjectModified");
static_assert(sizeof(JavascriptGlobalDelegates_OnObjectModified) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnObjectModified");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectModified, Object) == 0x000000, "Member 'JavascriptGlobalDelegates_OnObjectModified::Object' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnObjectPropertyChanged_Friendly
// 0x0050 (0x0050 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<struct FProperty>                  Property;                                          // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<struct FProperty>                  MemberProperty;                                    // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ChangeType;                                        // 0x0048(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly");
static_assert(sizeof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly) == 0x000050, "Wrong size on JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly, InObject) == 0x000000, "Member 'JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly::InObject' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly, Property) == 0x000008, "Member 'JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly::Property' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly, MemberProperty) == 0x000028, "Member 'JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly::MemberProperty' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly, ChangeType) == 0x000048, "Member 'JavascriptGlobalDelegates_OnObjectPropertyChanged_Friendly::ChangeType' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnObjectSaved
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnObjectSaved final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnObjectSaved) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnObjectSaved");
static_assert(sizeof(JavascriptGlobalDelegates_OnObjectSaved) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnObjectSaved");
static_assert(offsetof(JavascriptGlobalDelegates_OnObjectSaved, Object) == 0x000000, "Member 'JavascriptGlobalDelegates_OnObjectSaved::Object' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPostDuplicate_Friendly
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_OnPostDuplicate_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDuplicateForPIE;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptGlobalDelegates_OnPostDuplicate_Friendly) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPostDuplicate_Friendly");
static_assert(sizeof(JavascriptGlobalDelegates_OnPostDuplicate_Friendly) == 0x000010, "Wrong size on JavascriptGlobalDelegates_OnPostDuplicate_Friendly");
static_assert(offsetof(JavascriptGlobalDelegates_OnPostDuplicate_Friendly, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPostDuplicate_Friendly::World' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnPostDuplicate_Friendly, bDuplicateForPIE) == 0x000008, "Member 'JavascriptGlobalDelegates_OnPostDuplicate_Friendly::bDuplicateForPIE' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPostWorldCreation
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPostWorldCreation final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnPostWorldCreation) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPostWorldCreation");
static_assert(sizeof(JavascriptGlobalDelegates_OnPostWorldCreation) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnPostWorldCreation");
static_assert(offsetof(JavascriptGlobalDelegates_OnPostWorldCreation, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPostWorldCreation::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPostWorldInitialization_Friendly
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly");
static_assert(sizeof(JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly");
static_assert(offsetof(JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPostWorldInitialization_Friendly::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPreObjectPropertyChanged_Friendly
// 0x0048 (0x0048 - 0x0000)
struct JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly final
{
public:
	class UObject*                                InObject;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<struct FProperty>                  Property;                                          // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TFieldPath<struct FProperty>                  MemberProperty;                                    // 0x0028(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly");
static_assert(sizeof(JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly) == 0x000048, "Wrong size on JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly");
static_assert(offsetof(JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly, InObject) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly::InObject' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly, Property) == 0x000008, "Member 'JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly::Property' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly, MemberProperty) == 0x000028, "Member 'JavascriptGlobalDelegates_OnPreObjectPropertyChanged_Friendly::MemberProperty' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPreWorldFinishDestroy
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPreWorldFinishDestroy final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnPreWorldFinishDestroy) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPreWorldFinishDestroy");
static_assert(sizeof(JavascriptGlobalDelegates_OnPreWorldFinishDestroy) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnPreWorldFinishDestroy");
static_assert(offsetof(JavascriptGlobalDelegates_OnPreWorldFinishDestroy, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPreWorldFinishDestroy::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnPreWorldInitialization_Friendly
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly");
static_assert(sizeof(JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly) == 0x000008, "Wrong size on JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly");
static_assert(offsetof(JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnPreWorldInitialization_Friendly::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.OnWorldCleanup
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_OnWorldCleanup final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSessionEnded;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanupResources;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptGlobalDelegates_OnWorldCleanup) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_OnWorldCleanup");
static_assert(sizeof(JavascriptGlobalDelegates_OnWorldCleanup) == 0x000010, "Wrong size on JavascriptGlobalDelegates_OnWorldCleanup");
static_assert(offsetof(JavascriptGlobalDelegates_OnWorldCleanup, World) == 0x000000, "Member 'JavascriptGlobalDelegates_OnWorldCleanup::World' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnWorldCleanup, bSessionEnded) == 0x000008, "Member 'JavascriptGlobalDelegates_OnWorldCleanup::bSessionEnded' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_OnWorldCleanup, bCleanupResources) == 0x000009, "Member 'JavascriptGlobalDelegates_OnWorldCleanup::bCleanupResources' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.PackageCreatedForLoad
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_PackageCreatedForLoad final
{
public:
	class UPackage*                               InPackage;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_PackageCreatedForLoad) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_PackageCreatedForLoad");
static_assert(sizeof(JavascriptGlobalDelegates_PackageCreatedForLoad) == 0x000008, "Wrong size on JavascriptGlobalDelegates_PackageCreatedForLoad");
static_assert(offsetof(JavascriptGlobalDelegates_PackageCreatedForLoad, InPackage) == 0x000000, "Member 'JavascriptGlobalDelegates_PackageCreatedForLoad::InPackage' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.PostApplyLevelOffset
// 0x0030 (0x0030 - 0x0000)
struct JavascriptGlobalDelegates_PostApplyLevelOffset final
{
public:
	class ULevel*                                 Level;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 World;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Offset;                                            // 0x0010(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Flag;                                              // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptGlobalDelegates_PostApplyLevelOffset) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_PostApplyLevelOffset");
static_assert(sizeof(JavascriptGlobalDelegates_PostApplyLevelOffset) == 0x000030, "Wrong size on JavascriptGlobalDelegates_PostApplyLevelOffset");
static_assert(offsetof(JavascriptGlobalDelegates_PostApplyLevelOffset, Level) == 0x000000, "Member 'JavascriptGlobalDelegates_PostApplyLevelOffset::Level' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_PostApplyLevelOffset, World) == 0x000008, "Member 'JavascriptGlobalDelegates_PostApplyLevelOffset::World' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_PostApplyLevelOffset, Offset) == 0x000010, "Member 'JavascriptGlobalDelegates_PostApplyLevelOffset::Offset' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_PostApplyLevelOffset, Flag) == 0x000028, "Member 'JavascriptGlobalDelegates_PostApplyLevelOffset::Flag' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.PostLoadMapWithWorld
// 0x0008 (0x0008 - 0x0000)
struct JavascriptGlobalDelegates_PostLoadMapWithWorld final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_PostLoadMapWithWorld) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_PostLoadMapWithWorld");
static_assert(sizeof(JavascriptGlobalDelegates_PostLoadMapWithWorld) == 0x000008, "Wrong size on JavascriptGlobalDelegates_PostLoadMapWithWorld");
static_assert(offsetof(JavascriptGlobalDelegates_PostLoadMapWithWorld, World) == 0x000000, "Member 'JavascriptGlobalDelegates_PostLoadMapWithWorld::World' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.PreLoadMap
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_PreLoadMap final
{
public:
	class FString                                 MapName;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_PreLoadMap) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_PreLoadMap");
static_assert(sizeof(JavascriptGlobalDelegates_PreLoadMap) == 0x000010, "Wrong size on JavascriptGlobalDelegates_PreLoadMap");
static_assert(offsetof(JavascriptGlobalDelegates_PreLoadMap, MapName) == 0x000000, "Member 'JavascriptGlobalDelegates_PreLoadMap::MapName' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.RedirectorFollowed
// 0x0018 (0x0018 - 0x0000)
struct JavascriptGlobalDelegates_RedirectorFollowed final
{
public:
	class FString                                 PackageName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Redirector;                                        // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_RedirectorFollowed) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_RedirectorFollowed");
static_assert(sizeof(JavascriptGlobalDelegates_RedirectorFollowed) == 0x000018, "Wrong size on JavascriptGlobalDelegates_RedirectorFollowed");
static_assert(offsetof(JavascriptGlobalDelegates_RedirectorFollowed, PackageName) == 0x000000, "Member 'JavascriptGlobalDelegates_RedirectorFollowed::PackageName' has a wrong offset!");
static_assert(offsetof(JavascriptGlobalDelegates_RedirectorFollowed, Redirector) == 0x000010, "Member 'JavascriptGlobalDelegates_RedirectorFollowed::Redirector' has a wrong offset!");

// Function V8.JavascriptGlobalDelegates.Unbind
// 0x0010 (0x0010 - 0x0000)
struct JavascriptGlobalDelegates_Unbind final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptGlobalDelegates_Unbind) == 0x000008, "Wrong alignment on JavascriptGlobalDelegates_Unbind");
static_assert(sizeof(JavascriptGlobalDelegates_Unbind) == 0x000010, "Wrong size on JavascriptGlobalDelegates_Unbind");
static_assert(offsetof(JavascriptGlobalDelegates_Unbind, Key) == 0x000000, "Member 'JavascriptGlobalDelegates_Unbind::Key' has a wrong offset!");

// Function V8.JavascriptIsolate.CreateContext
// 0x0008 (0x0008 - 0x0000)
struct JavascriptIsolate_CreateContext final
{
public:
	class UJavascriptContext*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIsolate_CreateContext) == 0x000008, "Wrong alignment on JavascriptIsolate_CreateContext");
static_assert(sizeof(JavascriptIsolate_CreateContext) == 0x000008, "Wrong size on JavascriptIsolate_CreateContext");
static_assert(offsetof(JavascriptIsolate_CreateContext, ReturnValue) == 0x000000, "Member 'JavascriptIsolate_CreateContext::ReturnValue' has a wrong offset!");

// Function V8.JavascriptIsolate.GetHeapStatistics
// 0x0020 (0x0020 - 0x0000)
struct JavascriptIsolate_GetHeapStatistics final
{
public:
	struct FJavascriptHeapStatistics              Statistics;                                        // 0x0000(0x0020)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIsolate_GetHeapStatistics) == 0x000004, "Wrong alignment on JavascriptIsolate_GetHeapStatistics");
static_assert(sizeof(JavascriptIsolate_GetHeapStatistics) == 0x000020, "Wrong size on JavascriptIsolate_GetHeapStatistics");
static_assert(offsetof(JavascriptIsolate_GetHeapStatistics, Statistics) == 0x000000, "Member 'JavascriptIsolate_GetHeapStatistics::Statistics' has a wrong offset!");

// Function V8.JavascriptIsolate.Init
// 0x0001 (0x0001 - 0x0000)
struct JavascriptIsolate_Init final
{
public:
	bool                                          bIsEditor;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptIsolate_Init) == 0x000001, "Wrong alignment on JavascriptIsolate_Init");
static_assert(sizeof(JavascriptIsolate_Init) == 0x000001, "Wrong size on JavascriptIsolate_Init");
static_assert(offsetof(JavascriptIsolate_Init, bIsEditor) == 0x000000, "Member 'JavascriptIsolate_Init::bIsEditor' has a wrong offset!");

// Function V8.JavascriptLibrary.Actor_GetWorld
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_Actor_GetWorld final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorld*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptLibrary_Actor_GetWorld) == 0x000008, "Wrong alignment on JavascriptLibrary_Actor_GetWorld");
static_assert(sizeof(JavascriptLibrary_Actor_GetWorld) == 0x000010, "Wrong size on JavascriptLibrary_Actor_GetWorld");
static_assert(offsetof(JavascriptLibrary_Actor_GetWorld, Actor) == 0x000000, "Member 'JavascriptLibrary_Actor_GetWorld::Actor' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_Actor_GetWorld, ReturnValue) == 0x000008, "Member 'JavascriptLibrary_Actor_GetWorld::ReturnValue' has a wrong offset!");

// Function V8.JavascriptLibrary.AddDynamicBinding
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_AddDynamicBinding final
{
public:
	class UClass*                                 Outer_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDynamicBlueprintBinding*               BindingObject;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptLibrary_AddDynamicBinding) == 0x000008, "Wrong alignment on JavascriptLibrary_AddDynamicBinding");
static_assert(sizeof(JavascriptLibrary_AddDynamicBinding) == 0x000010, "Wrong size on JavascriptLibrary_AddDynamicBinding");
static_assert(offsetof(JavascriptLibrary_AddDynamicBinding, Outer_0) == 0x000000, "Member 'JavascriptLibrary_AddDynamicBinding::Outer_0' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddDynamicBinding, BindingObject) == 0x000008, "Member 'JavascriptLibrary_AddDynamicBinding::BindingObject' has a wrong offset!");

// Function V8.JavascriptLibrary.AddMessage
// 0x0002 (0x0002 - 0x0000)
struct JavascriptLibrary_AddMessage final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptLibrary_AddMessage) == 0x000001, "Wrong alignment on JavascriptLibrary_AddMessage");
static_assert(sizeof(JavascriptLibrary_AddMessage) == 0x000002, "Wrong size on JavascriptLibrary_AddMessage");
static_assert(offsetof(JavascriptLibrary_AddMessage, Stat) == 0x000000, "Member 'JavascriptLibrary_AddMessage::Stat' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage, InStatOperation) == 0x000001, "Member 'JavascriptLibrary_AddMessage::InStatOperation' has a wrong offset!");

// Function V8.JavascriptLibrary.AddMessage_float
// 0x000C (0x000C - 0x0000)
struct JavascriptLibrary_AddMessage_float final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCycle;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptLibrary_AddMessage_float) == 0x000004, "Wrong alignment on JavascriptLibrary_AddMessage_float");
static_assert(sizeof(JavascriptLibrary_AddMessage_float) == 0x00000C, "Wrong size on JavascriptLibrary_AddMessage_float");
static_assert(offsetof(JavascriptLibrary_AddMessage_float, Stat) == 0x000000, "Member 'JavascriptLibrary_AddMessage_float::Stat' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_float, InStatOperation) == 0x000001, "Member 'JavascriptLibrary_AddMessage_float::InStatOperation' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_float, Value) == 0x000004, "Member 'JavascriptLibrary_AddMessage_float::Value' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_float, bIsCycle) == 0x000008, "Member 'JavascriptLibrary_AddMessage_float::bIsCycle' has a wrong offset!");

// Function V8.JavascriptLibrary.AddMessage_int
// 0x000C (0x000C - 0x0000)
struct JavascriptLibrary_AddMessage_int final
{
public:
	struct FJavascriptStat                        Stat;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EJavascriptStatOperation                      InStatOperation;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCycle;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptLibrary_AddMessage_int) == 0x000004, "Wrong alignment on JavascriptLibrary_AddMessage_int");
static_assert(sizeof(JavascriptLibrary_AddMessage_int) == 0x00000C, "Wrong size on JavascriptLibrary_AddMessage_int");
static_assert(offsetof(JavascriptLibrary_AddMessage_int, Stat) == 0x000000, "Member 'JavascriptLibrary_AddMessage_int::Stat' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_int, InStatOperation) == 0x000001, "Member 'JavascriptLibrary_AddMessage_int::InStatOperation' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_int, Value) == 0x000004, "Member 'JavascriptLibrary_AddMessage_int::Value' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_AddMessage_int, bIsCycle) == 0x000008, "Member 'JavascriptLibrary_AddMessage_int::bIsCycle' has a wrong offset!");

// Function V8.JavascriptLibrary.CallJS
// 0x0018 (0x0018 - 0x0000)
struct JavascriptLibrary_CallJS final
{
public:
	struct FJavascriptFunction                    Function;                                          // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	struct FJavascriptStubStruct                  CustomStruct;                                      // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(JavascriptLibrary_CallJS) == 0x000008, "Wrong alignment on JavascriptLibrary_CallJS");
static_assert(sizeof(JavascriptLibrary_CallJS) == 0x000018, "Wrong size on JavascriptLibrary_CallJS");
static_assert(offsetof(JavascriptLibrary_CallJS, Function) == 0x000000, "Member 'JavascriptLibrary_CallJS::Function' has a wrong offset!");
static_assert(offsetof(JavascriptLibrary_CallJS, CustomStruct) == 0x000010, "Member 'JavascriptLibrary_CallJS::CustomStruct' has a wrong offset!");

// Function V8.JavascriptLibrary.ClipboardCopy
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_ClipboardCopy final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptLibrary_ClipboardCopy) == 0x000008, "Wrong alignment on JavascriptLibrary_ClipboardCopy");
static_assert(sizeof(JavascriptLibrary_ClipboardCopy) == 0x000010, "Wrong size on JavascriptLibrary_ClipboardCopy");
static_assert(offsetof(JavascriptLibrary_ClipboardCopy, String) == 0x000000, "Member 'JavascriptLibrary_ClipboardCopy::String' has a wrong offset!");

// Function V8.JavascriptLibrary.ClipboardPaste
// 0x0010 (0x0010 - 0x0000)
struct JavascriptLibrary_ClipboardPaste final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(JavascriptLibrary_ClipboardPaste) == 0x000008, "Wrong alignment on JavascriptLibrary_ClipboardPaste");
static_assert(sizeof(JavascriptLibrary_ClipboardPaste) == 0x000010, "Wrong size on JavascriptLibrary_ClipboardPaste");
