#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water_Caustics_Parameters

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Water_Caustics_Parameters.Water_Caustics_Parameters
// 0x01F8 (0x01F8 - 0x0000)
struct FWater_Caustics_Parameters final
{
public:
	class FString                                 WaterCausticsType_10_22E9DB2B44EBA1DDFCD669BFC4F5A2C3; // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsBufferScale_11_4891F1C1433E69AD7AE583B26CB8B74F; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsRefractiveIntensity_12_84E7671A4C1BAFCE5A912E8B9D549C41; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsReflectiveIntensity_13_A8FAED5646D272D518F78DBF2EC3FFF3; // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsFresnelBaseReflectFraction_23_28BA9C044FF67107897D8E983B459690; // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMapSizeX_24_0DD69E77451F51BCA32B16A0B271FC6C; // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMapSizeY_25_5995CB844729B31103795D9CACF0CF3E; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsNumDenoisePasses_26_5FDE5D6146B749E8B952F89B329F61B2; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMinReflectionRayDistance_27_45097790417E6E7F541B1382E5A0C9AA; // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMaxReflectionRayDistance_28_67F4322D4AF3ACF0CD8B2895974A115B; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMinRefractionRayDistance_29_E9C281484F546DBCAF69C5A7866FD0B2; // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMaxRefractionRayDistance_30_3B0E91A54E9D4AD25FCDD18B13E2A9EB; // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsRectLightTemporalWeight_32_6729E6744212BBA47350FDB9D6743EF6; // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsRefractBackFaceCullingThreshold_33_7EC526954286067A65F5C7A1F3F7A71A; // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsReflectBackFaceCullingThreshold_36_16DE876A4587F2728ED6C2BA6FD54C98; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMapCascades_48_C35E153E4FD3359DF08CED8FD8911D43; // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMapCascadeScale_47_59ED42134835FEEF0A3586B7A60856F1; // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsMapForceLevel_51_4FE7525E45C9D08EA0F96D8388F5BFF6; // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsShowPhoton_46_B3215C834DEFE8DC5DA4A6A8F292D91D; // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsPhotonScale_54_1E5BBCA644165B132F85C78276BB702F; // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsCascadeSamplingOffsetX_61_2719694E494E4EB376BB5DAF45921638; // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsCascadeSamplingOffsetY_63_98AADADD45FD2ED6D43DC0ADDEC6C53A; // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsCascadeSamplingUVScaleX_64_3141DE974ACBDD26008C3E8B72619B44; // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsCascadeSamplingUVScaley_65_A879211B4B47DBCDA46BE4A1A4A3F47D; // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 UseSceneLightDir_68_7B35F1EA4CDF9B9D16F068BF886419AF; // 0x0180(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsReflectiveNormalScale_72_8E7BE7F040BCAA5474D9C58BBEB1FEC7; // 0x0190(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsRefractiveNormalScale_75_11BB4FDF492EC51614A427BC18CFF5B0; // 0x01A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsViewCulling_80_F608F01E4E5DAAE17E8D7B935E7F82DC; // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsEnableShadowRay_85_CD902F404203091E5DF9C5842CB306D6; // 0x01C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsShadowRayMaxDistance_86_3F679E3E4D7596B2D597F59985A5ABEE; // 0x01D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 WaterCausticsEpsilonArea_89_CA86C4EA4576D49218C593A01A6D5E73; // 0x01E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          UseAdaptiveWaterCausticsMapResolution_77_A47539CC44ACAA1663FE2FBB69A479C6; // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWater_Caustics_Parameters) == 0x000008, "Wrong alignment on FWater_Caustics_Parameters");
static_assert(sizeof(FWater_Caustics_Parameters) == 0x0001F8, "Wrong size on FWater_Caustics_Parameters");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsType_10_22E9DB2B44EBA1DDFCD669BFC4F5A2C3) == 0x000000, "Member 'FWater_Caustics_Parameters::WaterCausticsType_10_22E9DB2B44EBA1DDFCD669BFC4F5A2C3' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsBufferScale_11_4891F1C1433E69AD7AE583B26CB8B74F) == 0x000010, "Member 'FWater_Caustics_Parameters::WaterCausticsBufferScale_11_4891F1C1433E69AD7AE583B26CB8B74F' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsRefractiveIntensity_12_84E7671A4C1BAFCE5A912E8B9D549C41) == 0x000020, "Member 'FWater_Caustics_Parameters::WaterCausticsRefractiveIntensity_12_84E7671A4C1BAFCE5A912E8B9D549C41' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsReflectiveIntensity_13_A8FAED5646D272D518F78DBF2EC3FFF3) == 0x000030, "Member 'FWater_Caustics_Parameters::WaterCausticsReflectiveIntensity_13_A8FAED5646D272D518F78DBF2EC3FFF3' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsFresnelBaseReflectFraction_23_28BA9C044FF67107897D8E983B459690) == 0x000040, "Member 'FWater_Caustics_Parameters::WaterCausticsFresnelBaseReflectFraction_23_28BA9C044FF67107897D8E983B459690' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMapSizeX_24_0DD69E77451F51BCA32B16A0B271FC6C) == 0x000050, "Member 'FWater_Caustics_Parameters::WaterCausticsMapSizeX_24_0DD69E77451F51BCA32B16A0B271FC6C' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMapSizeY_25_5995CB844729B31103795D9CACF0CF3E) == 0x000060, "Member 'FWater_Caustics_Parameters::WaterCausticsMapSizeY_25_5995CB844729B31103795D9CACF0CF3E' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsNumDenoisePasses_26_5FDE5D6146B749E8B952F89B329F61B2) == 0x000070, "Member 'FWater_Caustics_Parameters::WaterCausticsNumDenoisePasses_26_5FDE5D6146B749E8B952F89B329F61B2' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMinReflectionRayDistance_27_45097790417E6E7F541B1382E5A0C9AA) == 0x000080, "Member 'FWater_Caustics_Parameters::WaterCausticsMinReflectionRayDistance_27_45097790417E6E7F541B1382E5A0C9AA' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMaxReflectionRayDistance_28_67F4322D4AF3ACF0CD8B2895974A115B) == 0x000090, "Member 'FWater_Caustics_Parameters::WaterCausticsMaxReflectionRayDistance_28_67F4322D4AF3ACF0CD8B2895974A115B' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMinRefractionRayDistance_29_E9C281484F546DBCAF69C5A7866FD0B2) == 0x0000A0, "Member 'FWater_Caustics_Parameters::WaterCausticsMinRefractionRayDistance_29_E9C281484F546DBCAF69C5A7866FD0B2' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMaxRefractionRayDistance_30_3B0E91A54E9D4AD25FCDD18B13E2A9EB) == 0x0000B0, "Member 'FWater_Caustics_Parameters::WaterCausticsMaxRefractionRayDistance_30_3B0E91A54E9D4AD25FCDD18B13E2A9EB' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsRectLightTemporalWeight_32_6729E6744212BBA47350FDB9D6743EF6) == 0x0000C0, "Member 'FWater_Caustics_Parameters::WaterCausticsRectLightTemporalWeight_32_6729E6744212BBA47350FDB9D6743EF6' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsRefractBackFaceCullingThreshold_33_7EC526954286067A65F5C7A1F3F7A71A) == 0x0000D0, "Member 'FWater_Caustics_Parameters::WaterCausticsRefractBackFaceCullingThreshold_33_7EC526954286067A65F5C7A1F3F7A71A' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsReflectBackFaceCullingThreshold_36_16DE876A4587F2728ED6C2BA6FD54C98) == 0x0000E0, "Member 'FWater_Caustics_Parameters::WaterCausticsReflectBackFaceCullingThreshold_36_16DE876A4587F2728ED6C2BA6FD54C98' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMapCascades_48_C35E153E4FD3359DF08CED8FD8911D43) == 0x0000F0, "Member 'FWater_Caustics_Parameters::WaterCausticsMapCascades_48_C35E153E4FD3359DF08CED8FD8911D43' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMapCascadeScale_47_59ED42134835FEEF0A3586B7A60856F1) == 0x000100, "Member 'FWater_Caustics_Parameters::WaterCausticsMapCascadeScale_47_59ED42134835FEEF0A3586B7A60856F1' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsMapForceLevel_51_4FE7525E45C9D08EA0F96D8388F5BFF6) == 0x000110, "Member 'FWater_Caustics_Parameters::WaterCausticsMapForceLevel_51_4FE7525E45C9D08EA0F96D8388F5BFF6' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsShowPhoton_46_B3215C834DEFE8DC5DA4A6A8F292D91D) == 0x000120, "Member 'FWater_Caustics_Parameters::WaterCausticsShowPhoton_46_B3215C834DEFE8DC5DA4A6A8F292D91D' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsPhotonScale_54_1E5BBCA644165B132F85C78276BB702F) == 0x000130, "Member 'FWater_Caustics_Parameters::WaterCausticsPhotonScale_54_1E5BBCA644165B132F85C78276BB702F' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsCascadeSamplingOffsetX_61_2719694E494E4EB376BB5DAF45921638) == 0x000140, "Member 'FWater_Caustics_Parameters::WaterCausticsCascadeSamplingOffsetX_61_2719694E494E4EB376BB5DAF45921638' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsCascadeSamplingOffsetY_63_98AADADD45FD2ED6D43DC0ADDEC6C53A) == 0x000150, "Member 'FWater_Caustics_Parameters::WaterCausticsCascadeSamplingOffsetY_63_98AADADD45FD2ED6D43DC0ADDEC6C53A' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsCascadeSamplingUVScaleX_64_3141DE974ACBDD26008C3E8B72619B44) == 0x000160, "Member 'FWater_Caustics_Parameters::WaterCausticsCascadeSamplingUVScaleX_64_3141DE974ACBDD26008C3E8B72619B44' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsCascadeSamplingUVScaley_65_A879211B4B47DBCDA46BE4A1A4A3F47D) == 0x000170, "Member 'FWater_Caustics_Parameters::WaterCausticsCascadeSamplingUVScaley_65_A879211B4B47DBCDA46BE4A1A4A3F47D' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, UseSceneLightDir_68_7B35F1EA4CDF9B9D16F068BF886419AF) == 0x000180, "Member 'FWater_Caustics_Parameters::UseSceneLightDir_68_7B35F1EA4CDF9B9D16F068BF886419AF' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsReflectiveNormalScale_72_8E7BE7F040BCAA5474D9C58BBEB1FEC7) == 0x000190, "Member 'FWater_Caustics_Parameters::WaterCausticsReflectiveNormalScale_72_8E7BE7F040BCAA5474D9C58BBEB1FEC7' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsRefractiveNormalScale_75_11BB4FDF492EC51614A427BC18CFF5B0) == 0x0001A0, "Member 'FWater_Caustics_Parameters::WaterCausticsRefractiveNormalScale_75_11BB4FDF492EC51614A427BC18CFF5B0' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsViewCulling_80_F608F01E4E5DAAE17E8D7B935E7F82DC) == 0x0001B0, "Member 'FWater_Caustics_Parameters::WaterCausticsViewCulling_80_F608F01E4E5DAAE17E8D7B935E7F82DC' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsEnableShadowRay_85_CD902F404203091E5DF9C5842CB306D6) == 0x0001C0, "Member 'FWater_Caustics_Parameters::WaterCausticsEnableShadowRay_85_CD902F404203091E5DF9C5842CB306D6' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsShadowRayMaxDistance_86_3F679E3E4D7596B2D597F59985A5ABEE) == 0x0001D0, "Member 'FWater_Caustics_Parameters::WaterCausticsShadowRayMaxDistance_86_3F679E3E4D7596B2D597F59985A5ABEE' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, WaterCausticsEpsilonArea_89_CA86C4EA4576D49218C593A01A6D5E73) == 0x0001E0, "Member 'FWater_Caustics_Parameters::WaterCausticsEpsilonArea_89_CA86C4EA4576D49218C593A01A6D5E73' has a wrong offset!");
static_assert(offsetof(FWater_Caustics_Parameters, UseAdaptiveWaterCausticsMapResolution_77_A47539CC44ACAA1663FE2FBB69A479C6) == 0x0001F0, "Member 'FWater_Caustics_Parameters::UseAdaptiveWaterCausticsMapResolution_77_A47539CC44ACAA1663FE2FBB69A479C6' has a wrong offset!");

}

