#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Water

#include "Basic.hpp"

#include "Niagara_classes.hpp"
#include "Water_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AIModule_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class Water.GerstnerWaterWaveGeneratorBase
// 0x0000 (0x0028 - 0x0028)
class UGerstnerWaterWaveGeneratorBase : public UObject
{
public:
	void GenerateGerstnerWaves(TArray<struct FGerstnerWave>* OutWaves) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GerstnerWaterWaveGeneratorBase">();
	}
	static class UGerstnerWaterWaveGeneratorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGerstnerWaterWaveGeneratorBase>();
	}
};
static_assert(alignof(UGerstnerWaterWaveGeneratorBase) == 0x000008, "Wrong alignment on UGerstnerWaterWaveGeneratorBase");
static_assert(sizeof(UGerstnerWaterWaveGeneratorBase) == 0x000028, "Wrong size on UGerstnerWaterWaveGeneratorBase");

// Class Water.GerstnerWaterWaveGeneratorSpectrum
// 0x0018 (0x0040 - 0x0028)
class UGerstnerWaterWaveGeneratorSpectrum final : public UGerstnerWaterWaveGeneratorBase
{
public:
	EWaveSpectrumType                             SpectrumType;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGerstnerWaveOctave>            Octaves;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GerstnerWaterWaveGeneratorSpectrum">();
	}
	static class UGerstnerWaterWaveGeneratorSpectrum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGerstnerWaterWaveGeneratorSpectrum>();
	}
};
static_assert(alignof(UGerstnerWaterWaveGeneratorSpectrum) == 0x000008, "Wrong alignment on UGerstnerWaterWaveGeneratorSpectrum");
static_assert(sizeof(UGerstnerWaterWaveGeneratorSpectrum) == 0x000040, "Wrong size on UGerstnerWaterWaveGeneratorSpectrum");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSpectrum, SpectrumType) == 0x000028, "Member 'UGerstnerWaterWaveGeneratorSpectrum::SpectrumType' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSpectrum, Octaves) == 0x000030, "Member 'UGerstnerWaterWaveGeneratorSpectrum::Octaves' has a wrong offset!");

// Class Water.BuoyancyComponent
// 0x0160 (0x0210 - 0x00B0)
class UBuoyancyComponent final : public UActorComponent
{
public:
	TArray<struct FSphericalPontoon>              Pontoons;                                          // 0x00B0(0x0010)(ZeroConstructor, Deprecated, ContainsInstancedReference, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnEnteredWaterDelegate;                            // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnExitedWaterDelegate;                             // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FBuoyancyData                          BuoyancyData;                                      // 0x00E0(0x0088)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class UWaterBodyComponent*>            CurrentWaterBodyComponents;                        // 0x0168(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UPrimitiveComponent*                    SimulatingComponent;                               // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x90];                                     // 0x0180(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetLastWaterSurfaceInfo(struct FVector* OutWaterPlaneLocation, struct FVector* OutWaterPlaneNormal, struct FVector* OutWaterSurfacePosition, float* OutWaterDepth, int32* OutWaterBodyIdx, struct FVector* OutWaterVelocity);
	void OnPontoonEnteredWater(const struct FSphericalPontoon& Pontoon);
	void OnPontoonExitedWater(const struct FSphericalPontoon& Pontoon);

	const TArray<class UWaterBodyComponent*> GetCurrentWaterBodyComponents() const;
	bool IsInWaterBody() const;
	bool IsOverlappingWaterBody() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuoyancyComponent">();
	}
	static class UBuoyancyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBuoyancyComponent>();
	}
};
static_assert(alignof(UBuoyancyComponent) == 0x000008, "Wrong alignment on UBuoyancyComponent");
static_assert(sizeof(UBuoyancyComponent) == 0x000210, "Wrong size on UBuoyancyComponent");
static_assert(offsetof(UBuoyancyComponent, Pontoons) == 0x0000B0, "Member 'UBuoyancyComponent::Pontoons' has a wrong offset!");
static_assert(offsetof(UBuoyancyComponent, OnEnteredWaterDelegate) == 0x0000C0, "Member 'UBuoyancyComponent::OnEnteredWaterDelegate' has a wrong offset!");
static_assert(offsetof(UBuoyancyComponent, OnExitedWaterDelegate) == 0x0000D0, "Member 'UBuoyancyComponent::OnExitedWaterDelegate' has a wrong offset!");
static_assert(offsetof(UBuoyancyComponent, BuoyancyData) == 0x0000E0, "Member 'UBuoyancyComponent::BuoyancyData' has a wrong offset!");
static_assert(offsetof(UBuoyancyComponent, CurrentWaterBodyComponents) == 0x000168, "Member 'UBuoyancyComponent::CurrentWaterBodyComponents' has a wrong offset!");
static_assert(offsetof(UBuoyancyComponent, SimulatingComponent) == 0x000178, "Member 'UBuoyancyComponent::SimulatingComponent' has a wrong offset!");

// Class Water.WaterWavesBase
// 0x0000 (0x0028 - 0x0028)
class UWaterWavesBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterWavesBase">();
	}
	static class UWaterWavesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterWavesBase>();
	}
};
static_assert(alignof(UWaterWavesBase) == 0x000008, "Wrong alignment on UWaterWavesBase");
static_assert(sizeof(UWaterWavesBase) == 0x000028, "Wrong size on UWaterWavesBase");

// Class Water.BuoyancyManager
// 0x00B8 (0x0330 - 0x0278)
class ABuoyancyManager final : public AActor
{
public:
	uint8                                         Pad_278[0x50];                                     // 0x0278(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBuoyancyComponent*>             BuoyancyComponents;                                // 0x02C8(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2D8[0x58];                                     // 0x02D8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool GetBuoyancyComponentManager(const class UObject* WorldContextObject, class ABuoyancyManager** Manager);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BuoyancyManager">();
	}
	static class ABuoyancyManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABuoyancyManager>();
	}
};
static_assert(alignof(ABuoyancyManager) == 0x000008, "Wrong alignment on ABuoyancyManager");
static_assert(sizeof(ABuoyancyManager) == 0x000330, "Wrong size on ABuoyancyManager");
static_assert(offsetof(ABuoyancyManager, BuoyancyComponents) == 0x0002C8, "Member 'ABuoyancyManager::BuoyancyComponents' has a wrong offset!");

// Class Water.EnvQueryTest_InsideWaterBody
// 0x0008 (0x0200 - 0x01F8)
class UEnvQueryTest_InsideWaterBody final : public UEnvQueryTest
{
public:
	bool                                          bIncludeWaves;                                     // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimpleWaves;                                      // 0x01F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreExclusionVolumes;                           // 0x01FA(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FB[0x5];                                      // 0x01FB(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EnvQueryTest_InsideWaterBody">();
	}
	static class UEnvQueryTest_InsideWaterBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_InsideWaterBody>();
	}
};
static_assert(alignof(UEnvQueryTest_InsideWaterBody) == 0x000008, "Wrong alignment on UEnvQueryTest_InsideWaterBody");
static_assert(sizeof(UEnvQueryTest_InsideWaterBody) == 0x000200, "Wrong size on UEnvQueryTest_InsideWaterBody");
static_assert(offsetof(UEnvQueryTest_InsideWaterBody, bIncludeWaves) == 0x0001F8, "Member 'UEnvQueryTest_InsideWaterBody::bIncludeWaves' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_InsideWaterBody, bSimpleWaves) == 0x0001F9, "Member 'UEnvQueryTest_InsideWaterBody::bSimpleWaves' has a wrong offset!");
static_assert(offsetof(UEnvQueryTest_InsideWaterBody, bIgnoreExclusionVolumes) == 0x0001FA, "Member 'UEnvQueryTest_InsideWaterBody::bIgnoreExclusionVolumes' has a wrong offset!");

// Class Water.GerstnerWaterWaveGeneratorSimple
// 0x0038 (0x0060 - 0x0028)
class UGerstnerWaterWaveGeneratorSimple final : public UGerstnerWaterWaveGeneratorBase
{
public:
	int32                                         NumWaves;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Randomness;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinWavelength;                                     // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWavelength;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WavelengthFalloff;                                 // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAmplitude;                                      // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAmplitude;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmplitudeFalloff;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindAngleDeg;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DirectionAngularSpreadDeg;                         // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmallWaveSteepness;                                // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LargeWaveSteepness;                                // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SteepnessFalloff;                                  // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GerstnerWaterWaveGeneratorSimple">();
	}
	static class UGerstnerWaterWaveGeneratorSimple* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGerstnerWaterWaveGeneratorSimple>();
	}
};
static_assert(alignof(UGerstnerWaterWaveGeneratorSimple) == 0x000008, "Wrong alignment on UGerstnerWaterWaveGeneratorSimple");
static_assert(sizeof(UGerstnerWaterWaveGeneratorSimple) == 0x000060, "Wrong size on UGerstnerWaterWaveGeneratorSimple");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, NumWaves) == 0x000028, "Member 'UGerstnerWaterWaveGeneratorSimple::NumWaves' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, Seed) == 0x00002C, "Member 'UGerstnerWaterWaveGeneratorSimple::Seed' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, Randomness) == 0x000030, "Member 'UGerstnerWaterWaveGeneratorSimple::Randomness' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, MinWavelength) == 0x000034, "Member 'UGerstnerWaterWaveGeneratorSimple::MinWavelength' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, MaxWavelength) == 0x000038, "Member 'UGerstnerWaterWaveGeneratorSimple::MaxWavelength' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, WavelengthFalloff) == 0x00003C, "Member 'UGerstnerWaterWaveGeneratorSimple::WavelengthFalloff' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, MinAmplitude) == 0x000040, "Member 'UGerstnerWaterWaveGeneratorSimple::MinAmplitude' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, MaxAmplitude) == 0x000044, "Member 'UGerstnerWaterWaveGeneratorSimple::MaxAmplitude' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, AmplitudeFalloff) == 0x000048, "Member 'UGerstnerWaterWaveGeneratorSimple::AmplitudeFalloff' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, WindAngleDeg) == 0x00004C, "Member 'UGerstnerWaterWaveGeneratorSimple::WindAngleDeg' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, DirectionAngularSpreadDeg) == 0x000050, "Member 'UGerstnerWaterWaveGeneratorSimple::DirectionAngularSpreadDeg' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, SmallWaveSteepness) == 0x000054, "Member 'UGerstnerWaterWaveGeneratorSimple::SmallWaveSteepness' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, LargeWaveSteepness) == 0x000058, "Member 'UGerstnerWaterWaveGeneratorSimple::LargeWaveSteepness' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaveGeneratorSimple, SteepnessFalloff) == 0x00005C, "Member 'UGerstnerWaterWaveGeneratorSimple::SteepnessFalloff' has a wrong offset!");

// Class Water.WaterWaves
// 0x0000 (0x0028 - 0x0028)
class UWaterWaves : public UWaterWavesBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterWaves">();
	}
	static class UWaterWaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterWaves>();
	}
};
static_assert(alignof(UWaterWaves) == 0x000008, "Wrong alignment on UWaterWaves");
static_assert(sizeof(UWaterWaves) == 0x000028, "Wrong size on UWaterWaves");

// Class Water.GerstnerWaterWaves
// 0x0020 (0x0048 - 0x0028)
class UGerstnerWaterWaves final : public UWaterWaves
{
public:
	class UGerstnerWaterWaveGeneratorBase*        GerstnerWaveGenerator;                             // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGerstnerWave>                  GerstnerWaves;                                     // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                         MaxWaveHeight;                                     // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GerstnerWaterWaves">();
	}
	static class UGerstnerWaterWaves* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGerstnerWaterWaves>();
	}
};
static_assert(alignof(UGerstnerWaterWaves) == 0x000008, "Wrong alignment on UGerstnerWaterWaves");
static_assert(sizeof(UGerstnerWaterWaves) == 0x000048, "Wrong size on UGerstnerWaterWaves");
static_assert(offsetof(UGerstnerWaterWaves, GerstnerWaveGenerator) == 0x000028, "Member 'UGerstnerWaterWaves::GerstnerWaveGenerator' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaves, GerstnerWaves) == 0x000030, "Member 'UGerstnerWaterWaves::GerstnerWaves' has a wrong offset!");
static_assert(offsetof(UGerstnerWaterWaves, MaxWaveHeight) == 0x000040, "Member 'UGerstnerWaterWaves::MaxWaveHeight' has a wrong offset!");

// Class Water.GerstnerWaterWaveSubsystem
// 0x0018 (0x0048 - 0x0030)
class UGerstnerWaterWaveSubsystem final : public UEngineSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GerstnerWaterWaveSubsystem">();
	}
	static class UGerstnerWaterWaveSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGerstnerWaterWaveSubsystem>();
	}
};
static_assert(alignof(UGerstnerWaterWaveSubsystem) == 0x000008, "Wrong alignment on UGerstnerWaterWaveSubsystem");
static_assert(sizeof(UGerstnerWaterWaveSubsystem) == 0x000048, "Wrong size on UGerstnerWaterWaveSubsystem");

// Class Water.LakeCollisionComponent
// 0x0020 (0x0580 - 0x0560)
class ULakeCollisionComponent final : public UPrimitiveComponent
{
public:
	class UBodySetup*                             CachedBodySetup;                                   // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                BoxExtent;                                         // 0x0560(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_578[0x8];                                      // 0x0578(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LakeCollisionComponent">();
	}
	static class ULakeCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULakeCollisionComponent>();
	}
};
static_assert(alignof(ULakeCollisionComponent) == 0x000010, "Wrong alignment on ULakeCollisionComponent");
static_assert(sizeof(ULakeCollisionComponent) == 0x000580, "Wrong size on ULakeCollisionComponent");
static_assert(offsetof(ULakeCollisionComponent, CachedBodySetup) == 0x000558, "Member 'ULakeCollisionComponent::CachedBodySetup' has a wrong offset!");
static_assert(offsetof(ULakeCollisionComponent, BoxExtent) == 0x000560, "Member 'ULakeCollisionComponent::BoxExtent' has a wrong offset!");

// Class Water.NiagaraDataInterfaceWater
// 0x0008 (0x0040 - 0x0038)
class UNiagaraDataInterfaceWater final : public UNiagaraDataInterface
{
public:
	class UWaterBodyComponent*                    SourceBodyComponent;                               // 0x0038(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceWater">();
	}
	static class UNiagaraDataInterfaceWater* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceWater>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceWater) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceWater");
static_assert(sizeof(UNiagaraDataInterfaceWater) == 0x000040, "Wrong size on UNiagaraDataInterfaceWater");
static_assert(offsetof(UNiagaraDataInterfaceWater, SourceBodyComponent) == 0x000038, "Member 'UNiagaraDataInterfaceWater::SourceBodyComponent' has a wrong offset!");

// Class Water.NiagaraWaterFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UNiagaraWaterFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetWaterBody(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class AWaterBody* WaterBody);
	static void SetWaterBodyComponent(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UWaterBodyComponent* WaterBodyComponent);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraWaterFunctionLibrary">();
	}
	static class UNiagaraWaterFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraWaterFunctionLibrary>();
	}
};
static_assert(alignof(UNiagaraWaterFunctionLibrary) == 0x000008, "Wrong alignment on UNiagaraWaterFunctionLibrary");
static_assert(sizeof(UNiagaraWaterFunctionLibrary) == 0x000028, "Wrong size on UNiagaraWaterFunctionLibrary");

// Class Water.OceanCollisionComponent
// 0x0040 (0x05A0 - 0x0560)
class UOceanCollisionComponent final : public UPrimitiveComponent
{
public:
	class UBodySetup*                             CachedBodySetup;                                   // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_560[0x40];                                     // 0x0560(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OceanCollisionComponent">();
	}
	static class UOceanCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOceanCollisionComponent>();
	}
};
static_assert(alignof(UOceanCollisionComponent) == 0x000010, "Wrong alignment on UOceanCollisionComponent");
static_assert(sizeof(UOceanCollisionComponent) == 0x0005A0, "Wrong size on UOceanCollisionComponent");
static_assert(offsetof(UOceanCollisionComponent, CachedBodySetup) == 0x000558, "Member 'UOceanCollisionComponent::CachedBodySetup' has a wrong offset!");

// Class Water.OceanBoxCollisionComponent
// 0x0000 (0x0590 - 0x0590)
class UOceanBoxCollisionComponent final : public UBoxComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OceanBoxCollisionComponent">();
	}
	static class UOceanBoxCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOceanBoxCollisionComponent>();
	}
};
static_assert(alignof(UOceanBoxCollisionComponent) == 0x000010, "Wrong alignment on UOceanBoxCollisionComponent");
static_assert(sizeof(UOceanBoxCollisionComponent) == 0x000590, "Wrong size on UOceanBoxCollisionComponent");

// Class Water.WaterBody
// 0x0030 (0x02A8 - 0x0278)
class AWaterBody : public AActor
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSplineComponent*                  SplineComp;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWaterSplineMetadata*                   WaterSplineMetadata;                               // 0x0288(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWaterBodyComponent*                    WaterBodyComponent;                                // 0x0290(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         WaterBodyIndex;                                    // 0x0298(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWaterBodyType                                WaterBodyType;                                     // 0x029C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterWavesBase*                        WaterWaves;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UMaterialInstanceDynamic* GetRiverToLakeTransitionMaterialInstance();
	class UMaterialInstanceDynamic* GetRiverToOceanTransitionMaterialInstance();
	class UMaterialInstanceDynamic* GetWaterMaterialInstance();
	void OnWaterBodyChanged(bool bShapeOrPositionChanged, bool bWeightmapSettingsChanged);
	void SetWaterMaterial(class UMaterialInterface* InMaterial);
	void SetWaterWaves(class UWaterWavesBase* InWaterWaves);

	float GetAudioIntensityAtSplineInputKey(float InKey) const;
	TArray<class AWaterBodyExclusionVolume*> GetExclusionVolumes() const;
	TArray<class AWaterBodyIsland*> GetIslands() const;
	class UWaterBodyComponent* GetWaterBodyComponent() const;
	EWaterBodyType GetWaterBodyType() const;
	class UWaterSplineComponent* GetWaterSpline() const;
	float GetWaterVelocityAtSplineInputKey(float InKey) const;
	struct FVector GetWaterVelocityVectorAtSplineInputKey(float InKey) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBody">();
	}
	static class AWaterBody* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBody>();
	}
};
static_assert(alignof(AWaterBody) == 0x000008, "Wrong alignment on AWaterBody");
static_assert(sizeof(AWaterBody) == 0x0002A8, "Wrong size on AWaterBody");
static_assert(offsetof(AWaterBody, SplineComp) == 0x000280, "Member 'AWaterBody::SplineComp' has a wrong offset!");
static_assert(offsetof(AWaterBody, WaterSplineMetadata) == 0x000288, "Member 'AWaterBody::WaterSplineMetadata' has a wrong offset!");
static_assert(offsetof(AWaterBody, WaterBodyComponent) == 0x000290, "Member 'AWaterBody::WaterBodyComponent' has a wrong offset!");
static_assert(offsetof(AWaterBody, WaterBodyIndex) == 0x000298, "Member 'AWaterBody::WaterBodyIndex' has a wrong offset!");
static_assert(offsetof(AWaterBody, WaterBodyType) == 0x00029C, "Member 'AWaterBody::WaterBodyType' has a wrong offset!");
static_assert(offsetof(AWaterBody, WaterWaves) == 0x0002A0, "Member 'AWaterBody::WaterWaves' has a wrong offset!");

// Class Water.WaterBodyGenerator
// 0x0000 (0x0028 - 0x0028)
class UWaterBodyGenerator : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyGenerator">();
	}
	static class UWaterBodyGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyGenerator>();
	}
};
static_assert(alignof(UWaterBodyGenerator) == 0x000008, "Wrong alignment on UWaterBodyGenerator");
static_assert(sizeof(UWaterBodyGenerator) == 0x000028, "Wrong size on UWaterBodyGenerator");

// Class Water.WaterBodyComponent
// 0x1040 (0x15A0 - 0x0560)
class UWaterBodyComponent : public UPrimitiveComponent
{
public:
	class UPhysicalMaterial*                      PhysicalMaterial;                                  // 0x0558(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TargetWaveMaskDepth;                               // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxWaveHeightOffset;                               // 0x0564(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFillCollisionUnderWaterBodiesForNavmesh;          // 0x0568(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUnderwaterPostProcessSettings         UnderwaterPostProcessSettings;                     // 0x0570(0x07D0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FWaterCurveSettings                    CurveSettings;                                     // 0x0D40(0x0020)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WaterMaterial;                                     // 0x0D60(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     UnderwaterPostProcessMaterial;                     // 0x0D68(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShapeDilation;                                     // 0x0D70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CollisionHeightOffset;                             // 0x0D74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAffectsLandscape;                                 // 0x0D78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateCollisions;                               // 0x0D79(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D7A[0x2];                                      // 0x0D7A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaterBodyIndex;                                    // 0x0D7C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, DuplicateTransient, IsPlainOldData, NonTransactional, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMesh*                            WaterMeshOverride;                                 // 0x0D80(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         OverlapMaterialPriority;                           // 0x0D88(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   CollisionProfileName;                              // 0x0D8C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D94[0x4];                                      // 0x0D94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSplineMetadata*                   WaterSplineMetadata;                               // 0x0D98(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               WaterMID;                                          // 0x0DA0(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               UnderwaterPostProcessMID;                          // 0x0DA8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TLazyObjectPtr<class AWaterBodyIsland>> Islands;                                           // 0x0DB0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TLazyObjectPtr<class AWaterBodyExclusionVolume>> ExclusionVolumes;                                  // 0x0DC0(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, AdvancedDisplay, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ALandscapeProxy>         Landscape;                                         // 0x0DD0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_DD8[0x8];                                      // 0x0DD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   CurrentPostProcessSettings;                        // 0x0DE0(0x07B0)(Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          bCanAffectNavigation;                              // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1591[0x7];                                     // 0x1591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavAreaBase>               WaterNavAreaClass;                                 // 0x1598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UMaterialInstanceDynamic* GetRiverToLakeTransitionMaterialInstance();
	class UMaterialInstanceDynamic* GetRiverToOceanTransitionMaterialInstance();
	class UMaterialInstanceDynamic* GetUnderwaterPostProcessMaterialInstance();
	class UMaterialInstanceDynamic* GetWaterMaterialInstance();
	void OnWaterBodyChanged(bool bShapeOrPositionChanged, bool bWeightmapSettingsChanged);

	TArray<class UPrimitiveComponent*> GetCollisionComponents() const;
	TArray<class AWaterBodyExclusionVolume*> GetExclusionVolumes() const;
	TArray<class AWaterBodyIsland*> GetIslands() const;
	float GetMaxWaveHeight() const;
	TArray<class UPrimitiveComponent*> GetStandardRenderableComponents() const;
	class AWaterBody* GetWaterBodyActor() const;
	class UMaterialInterface* GetWaterMaterial() const;
	class UWaterSplineComponent* GetWaterSpline() const;
	void GetWaterSurfaceInfoAtLocation(const struct FVector& InLocation, struct FVector* OutWaterSurfaceLocation, struct FVector* OutWaterSurfaceNormal, struct FVector* OutWaterVelocity, float* OutWaterDepth, bool bIncludeDepth) const;
	float GetWaterVelocityAtSplineInputKey(float InKey) const;
	class UWaterWavesBase* GetWaterWaves() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyComponent">();
	}
	static class UWaterBodyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyComponent>();
	}
};
static_assert(alignof(UWaterBodyComponent) == 0x000010, "Wrong alignment on UWaterBodyComponent");
static_assert(sizeof(UWaterBodyComponent) == 0x0015A0, "Wrong size on UWaterBodyComponent");
static_assert(offsetof(UWaterBodyComponent, PhysicalMaterial) == 0x000558, "Member 'UWaterBodyComponent::PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, TargetWaveMaskDepth) == 0x000560, "Member 'UWaterBodyComponent::TargetWaveMaskDepth' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, MaxWaveHeightOffset) == 0x000564, "Member 'UWaterBodyComponent::MaxWaveHeightOffset' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, bFillCollisionUnderWaterBodiesForNavmesh) == 0x000568, "Member 'UWaterBodyComponent::bFillCollisionUnderWaterBodiesForNavmesh' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, UnderwaterPostProcessSettings) == 0x000570, "Member 'UWaterBodyComponent::UnderwaterPostProcessSettings' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, CurveSettings) == 0x000D40, "Member 'UWaterBodyComponent::CurveSettings' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterMaterial) == 0x000D60, "Member 'UWaterBodyComponent::WaterMaterial' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, UnderwaterPostProcessMaterial) == 0x000D68, "Member 'UWaterBodyComponent::UnderwaterPostProcessMaterial' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, ShapeDilation) == 0x000D70, "Member 'UWaterBodyComponent::ShapeDilation' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, CollisionHeightOffset) == 0x000D74, "Member 'UWaterBodyComponent::CollisionHeightOffset' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, bAffectsLandscape) == 0x000D78, "Member 'UWaterBodyComponent::bAffectsLandscape' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, bGenerateCollisions) == 0x000D79, "Member 'UWaterBodyComponent::bGenerateCollisions' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterBodyIndex) == 0x000D7C, "Member 'UWaterBodyComponent::WaterBodyIndex' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterMeshOverride) == 0x000D80, "Member 'UWaterBodyComponent::WaterMeshOverride' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, OverlapMaterialPriority) == 0x000D88, "Member 'UWaterBodyComponent::OverlapMaterialPriority' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, CollisionProfileName) == 0x000D8C, "Member 'UWaterBodyComponent::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterSplineMetadata) == 0x000D98, "Member 'UWaterBodyComponent::WaterSplineMetadata' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterMID) == 0x000DA0, "Member 'UWaterBodyComponent::WaterMID' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, UnderwaterPostProcessMID) == 0x000DA8, "Member 'UWaterBodyComponent::UnderwaterPostProcessMID' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, Islands) == 0x000DB0, "Member 'UWaterBodyComponent::Islands' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, ExclusionVolumes) == 0x000DC0, "Member 'UWaterBodyComponent::ExclusionVolumes' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, Landscape) == 0x000DD0, "Member 'UWaterBodyComponent::Landscape' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, CurrentPostProcessSettings) == 0x000DE0, "Member 'UWaterBodyComponent::CurrentPostProcessSettings' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, bCanAffectNavigation) == 0x001590, "Member 'UWaterBodyComponent::bCanAffectNavigation' has a wrong offset!");
static_assert(offsetof(UWaterBodyComponent, WaterNavAreaClass) == 0x001598, "Member 'UWaterBodyComponent::WaterNavAreaClass' has a wrong offset!");

// Class Water.CustomMeshGenerator
// 0x0008 (0x0030 - 0x0028)
class UCustomMeshGenerator final : public UWaterBodyGenerator
{
public:
	class UStaticMeshComponent*                   MeshComp;                                          // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CustomMeshGenerator">();
	}
	static class UCustomMeshGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomMeshGenerator>();
	}
};
static_assert(alignof(UCustomMeshGenerator) == 0x000008, "Wrong alignment on UCustomMeshGenerator");
static_assert(sizeof(UCustomMeshGenerator) == 0x000030, "Wrong size on UCustomMeshGenerator");
static_assert(offsetof(UCustomMeshGenerator, MeshComp) == 0x000028, "Member 'UCustomMeshGenerator::MeshComp' has a wrong offset!");

// Class Water.WaterBodyCustom
// 0x0000 (0x02A8 - 0x02A8)
class AWaterBodyCustom final : public AWaterBody
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyCustom">();
	}
	static class AWaterBodyCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyCustom>();
	}
};
static_assert(alignof(AWaterBodyCustom) == 0x000008, "Wrong alignment on AWaterBodyCustom");
static_assert(sizeof(AWaterBodyCustom) == 0x0002A8, "Wrong size on AWaterBodyCustom");

// Class Water.WaterBodyCustomComponent
// 0x0010 (0x15B0 - 0x15A0)
class UWaterBodyCustomComponent final : public UWaterBodyComponent
{
public:
	class UStaticMeshComponent*                   MeshComp;                                          // 0x15A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15A8[0x8];                                     // 0x15A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyCustomComponent">();
	}
	static class UWaterBodyCustomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyCustomComponent>();
	}
};
static_assert(alignof(UWaterBodyCustomComponent) == 0x000010, "Wrong alignment on UWaterBodyCustomComponent");
static_assert(sizeof(UWaterBodyCustomComponent) == 0x0015B0, "Wrong size on UWaterBodyCustomComponent");
static_assert(offsetof(UWaterBodyCustomComponent, MeshComp) == 0x0015A0, "Member 'UWaterBodyCustomComponent::MeshComp' has a wrong offset!");

// Class Water.WaterBodyExclusionVolume
// 0x0018 (0x02D8 - 0x02C0)
class AWaterBodyExclusionVolume final : public APhysicsVolume
{
public:
	bool                                          bIgnoreAllOverlappingWaterBodies;                  // 0x02C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AWaterBody*>                     WaterBodiesToIgnore;                               // 0x02C8(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyExclusionVolume">();
	}
	static class AWaterBodyExclusionVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyExclusionVolume>();
	}
};
static_assert(alignof(AWaterBodyExclusionVolume) == 0x000008, "Wrong alignment on AWaterBodyExclusionVolume");
static_assert(sizeof(AWaterBodyExclusionVolume) == 0x0002D8, "Wrong size on AWaterBodyExclusionVolume");
static_assert(offsetof(AWaterBodyExclusionVolume, bIgnoreAllOverlappingWaterBodies) == 0x0002C0, "Member 'AWaterBodyExclusionVolume::bIgnoreAllOverlappingWaterBodies' has a wrong offset!");
static_assert(offsetof(AWaterBodyExclusionVolume, WaterBodiesToIgnore) == 0x0002C8, "Member 'AWaterBodyExclusionVolume::WaterBodiesToIgnore' has a wrong offset!");

// Class Water.WaterBodyIsland
// 0x0010 (0x0288 - 0x0278)
class AWaterBodyIsland final : public AActor
{
public:
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UWaterSplineComponent*                  SplineComp;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UWaterSplineComponent* GetWaterSpline() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyIsland">();
	}
	static class AWaterBodyIsland* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyIsland>();
	}
};
static_assert(alignof(AWaterBodyIsland) == 0x000008, "Wrong alignment on AWaterBodyIsland");
static_assert(sizeof(AWaterBodyIsland) == 0x000288, "Wrong size on AWaterBodyIsland");
static_assert(offsetof(AWaterBodyIsland, SplineComp) == 0x000280, "Member 'AWaterBodyIsland::SplineComp' has a wrong offset!");

// Class Water.LakeGenerator
// 0x0018 (0x0040 - 0x0028)
class ULakeGenerator final : public UWaterBodyGenerator
{
public:
	class UStaticMeshComponent*                   LakeMeshComp;                                      // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                          LakeCollisionComp;                                 // 0x0030(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULakeCollisionComponent*                LakeCollision;                                     // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LakeGenerator">();
	}
	static class ULakeGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULakeGenerator>();
	}
};
static_assert(alignof(ULakeGenerator) == 0x000008, "Wrong alignment on ULakeGenerator");
static_assert(sizeof(ULakeGenerator) == 0x000040, "Wrong size on ULakeGenerator");
static_assert(offsetof(ULakeGenerator, LakeMeshComp) == 0x000028, "Member 'ULakeGenerator::LakeMeshComp' has a wrong offset!");
static_assert(offsetof(ULakeGenerator, LakeCollisionComp) == 0x000030, "Member 'ULakeGenerator::LakeCollisionComp' has a wrong offset!");
static_assert(offsetof(ULakeGenerator, LakeCollision) == 0x000038, "Member 'ULakeGenerator::LakeCollision' has a wrong offset!");

// Class Water.WaterBodyLake
// 0x0000 (0x02A8 - 0x02A8)
class AWaterBodyLake final : public AWaterBody
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyLake">();
	}
	static class AWaterBodyLake* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyLake>();
	}
};
static_assert(alignof(AWaterBodyLake) == 0x000008, "Wrong alignment on AWaterBodyLake");
static_assert(sizeof(AWaterBodyLake) == 0x0002A8, "Wrong size on AWaterBodyLake");

// Class Water.WaterBodyLakeComponent
// 0x0010 (0x15B0 - 0x15A0)
class UWaterBodyLakeComponent final : public UWaterBodyComponent
{
public:
	class UStaticMeshComponent*                   LakeMeshComp;                                      // 0x15A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULakeCollisionComponent*                LakeCollision;                                     // 0x15A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyLakeComponent">();
	}
	static class UWaterBodyLakeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyLakeComponent>();
	}
};
static_assert(alignof(UWaterBodyLakeComponent) == 0x000010, "Wrong alignment on UWaterBodyLakeComponent");
static_assert(sizeof(UWaterBodyLakeComponent) == 0x0015B0, "Wrong size on UWaterBodyLakeComponent");
static_assert(offsetof(UWaterBodyLakeComponent, LakeMeshComp) == 0x0015A0, "Member 'UWaterBodyLakeComponent::LakeMeshComp' has a wrong offset!");
static_assert(offsetof(UWaterBodyLakeComponent, LakeCollision) == 0x0015A8, "Member 'UWaterBodyLakeComponent::LakeCollision' has a wrong offset!");

// Class Water.OceanGenerator
// 0x0020 (0x0048 - 0x0028)
class UOceanGenerator final : public UWaterBodyGenerator
{
public:
	TArray<class UOceanBoxCollisionComponent*>    CollisionBoxes;                                    // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)
	TArray<class UOceanCollisionComponent*>       CollisionHullSets;                                 // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OceanGenerator">();
	}
	static class UOceanGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOceanGenerator>();
	}
};
static_assert(alignof(UOceanGenerator) == 0x000008, "Wrong alignment on UOceanGenerator");
static_assert(sizeof(UOceanGenerator) == 0x000048, "Wrong size on UOceanGenerator");
static_assert(offsetof(UOceanGenerator, CollisionBoxes) == 0x000028, "Member 'UOceanGenerator::CollisionBoxes' has a wrong offset!");
static_assert(offsetof(UOceanGenerator, CollisionHullSets) == 0x000038, "Member 'UOceanGenerator::CollisionHullSets' has a wrong offset!");

// Class Water.WaterBodyOcean
// 0x0000 (0x02A8 - 0x02A8)
class AWaterBodyOcean final : public AWaterBody
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyOcean">();
	}
	static class AWaterBodyOcean* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyOcean>();
	}
};
static_assert(alignof(AWaterBodyOcean) == 0x000008, "Wrong alignment on AWaterBodyOcean");
static_assert(sizeof(AWaterBodyOcean) == 0x0002A8, "Wrong size on AWaterBodyOcean");

// Class Water.WaterBodyOceanComponent
// 0x0040 (0x15E0 - 0x15A0)
class UWaterBodyOceanComponent final : public UWaterBodyComponent
{
public:
	TArray<class UOceanBoxCollisionComponent*>    CollisionBoxes;                                    // 0x15A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected)
	TArray<class UOceanCollisionComponent*>       CollisionHullSets;                                 // 0x15B0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected)
	struct FVector                                CollisionExtents;                                  // 0x15C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         HeightOffset;                                      // 0x15D8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_15DC[0x4];                                     // 0x15DC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyOceanComponent">();
	}
	static class UWaterBodyOceanComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyOceanComponent>();
	}
};
static_assert(alignof(UWaterBodyOceanComponent) == 0x000010, "Wrong alignment on UWaterBodyOceanComponent");
static_assert(sizeof(UWaterBodyOceanComponent) == 0x0015E0, "Wrong size on UWaterBodyOceanComponent");
static_assert(offsetof(UWaterBodyOceanComponent, CollisionBoxes) == 0x0015A0, "Member 'UWaterBodyOceanComponent::CollisionBoxes' has a wrong offset!");
static_assert(offsetof(UWaterBodyOceanComponent, CollisionHullSets) == 0x0015B0, "Member 'UWaterBodyOceanComponent::CollisionHullSets' has a wrong offset!");
static_assert(offsetof(UWaterBodyOceanComponent, CollisionExtents) == 0x0015C0, "Member 'UWaterBodyOceanComponent::CollisionExtents' has a wrong offset!");
static_assert(offsetof(UWaterBodyOceanComponent, HeightOffset) == 0x0015D8, "Member 'UWaterBodyOceanComponent::HeightOffset' has a wrong offset!");

// Class Water.RiverGenerator
// 0x0010 (0x0038 - 0x0028)
class URiverGenerator final : public UWaterBodyGenerator
{
public:
	TArray<class USplineMeshComponent*>           SplineMeshComponents;                              // 0x0028(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NonPIEDuplicateTransient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RiverGenerator">();
	}
	static class URiverGenerator* GetDefaultObj()
	{
		return GetDefaultObjImpl<URiverGenerator>();
	}
};
static_assert(alignof(URiverGenerator) == 0x000008, "Wrong alignment on URiverGenerator");
static_assert(sizeof(URiverGenerator) == 0x000038, "Wrong size on URiverGenerator");
static_assert(offsetof(URiverGenerator, SplineMeshComponents) == 0x000028, "Member 'URiverGenerator::SplineMeshComponents' has a wrong offset!");

// Class Water.WaterBodyRiver
// 0x0000 (0x02A8 - 0x02A8)
class AWaterBodyRiver : public AWaterBody
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyRiver">();
	}
	static class AWaterBodyRiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWaterBodyRiver>();
	}
};
static_assert(alignof(AWaterBodyRiver) == 0x000008, "Wrong alignment on AWaterBodyRiver");
static_assert(sizeof(AWaterBodyRiver) == 0x0002A8, "Wrong size on AWaterBodyRiver");

// Class Water.WaterBodyRiverComponent
// 0x0030 (0x15D0 - 0x15A0)
class UWaterBodyRiverComponent final : public UWaterBodyComponent
{
public:
	TArray<class USplineMeshComponent*>           SplineMeshComponents;                              // 0x15A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NonPIEDuplicateTransient, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     LakeTransitionMaterial;                            // 0x15B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               LakeTransitionMID;                                 // 0x15B8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     OceanTransitionMaterial;                           // 0x15C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               OceanTransitionMID;                                // 0x15C8(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, TextExportTransient, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBodyRiverComponent">();
	}
	static class UWaterBodyRiverComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaterBodyRiverComponent>();
	}
};
static_assert(alignof(UWaterBodyRiverComponent) == 0x000010, "Wrong alignment on UWaterBodyRiverComponent");
static_assert(sizeof(UWaterBodyRiverComponent) == 0x0015D0, "Wrong size on UWaterBodyRiverComponent");
static_assert(offsetof(UWaterBodyRiverComponent, SplineMeshComponents) == 0x0015A0, "Member 'UWaterBodyRiverComponent::SplineMeshComponents' has a wrong offset!");
static_assert(offsetof(UWaterBodyRiverComponent, LakeTransitionMaterial) == 0x0015B0, "Member 'UWaterBodyRiverComponent::LakeTransitionMaterial' has a wrong offset!");
static_assert(offsetof(UWaterBodyRiverComponent, LakeTransitionMID) == 0x0015B8, "Member 'UWaterBodyRiverComponent::LakeTransitionMID' has a wrong offset!");
static_assert(offsetof(UWaterBodyRiverComponent, OceanTransitionMaterial) == 0x0015C0, "Member 'UWaterBodyRiverComponent::OceanTransitionMaterial' has a wrong offset!");
static_assert(offsetof(UWaterBodyRiverComponent, OceanTransitionMID) == 0x0015C8, "Member 'UWaterBodyRiverComponent::OceanTransitionMID' has a wrong offset!");

// Class Water.WaterBrushActorInterface
// 0x0000 (0x0028 - 0x0028)
class IWaterBrushActorInterface final : public IInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WaterBrushActorInterface">();
	}
	static class IWaterBrushActorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IWaterBrushActorInterface>();
	}
};
static_assert(alignof(IWaterBrushActorInterface) == 0x000008, "Wrong alignment on IWaterBrushActorInterface");
static_assert(sizeof(IWaterBrushActorInterface) == 0x000028, "Wrong size on IWaterBrushActorInterface");

// Class Water.WaterMeshComponent
// 0x0160 (0x06E0 - 0x0580)
class UWaterMeshComponent final : public UMeshComponent
{
public:
