#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WebBrowser

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct WebBrowser.WebJSCallbackBase
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FWebJSCallbackBase
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWebJSCallbackBase) == 0x000008, "Wrong alignment on FWebJSCallbackBase");
static_assert(sizeof(FWebJSCallbackBase) == 0x000020, "Wrong size on FWebJSCallbackBase");

// ScriptStruct WebBrowser.WebJSFunction
// 0x0000 (0x0020 - 0x0020)
struct FWebJSFunction final : public FWebJSCallbackBase
{
};
static_assert(alignof(FWebJSFunction) == 0x000008, "Wrong alignment on FWebJSFunction");
static_assert(sizeof(FWebJSFunction) == 0x000020, "Wrong size on FWebJSFunction");

// ScriptStruct WebBrowser.WebJSResponse
// 0x0000 (0x0020 - 0x0020)
struct FWebJSResponse final : public FWebJSCallbackBase
{
};
static_assert(alignof(FWebJSResponse) == 0x000008, "Wrong alignment on FWebJSResponse");
static_assert(sizeof(FWebJSResponse) == 0x000020, "Wrong size on FWebJSResponse");

}

